{
  "backend/main.mo": "Defines main canister actor with mixin-based storage, authorization, and extensive user, contribution, reward, and U.S. geography type definitions.",
  "feature_evidence.json": "Lists features, involved files, components, and test IDs for earned‑points toast and contribution‑logging behaviors.",
  "frontend-file-summaries.txt": "Provides prewritten summaries describing purpose and functionality of numerous frontend files.",
  "frontend/docs/ARCHITECTURE.md": "High-level architecture document detailing Whisper’s vision, hierarchical installations, canister mapping, and modular subsystem design.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Specification for complaint category suggestion system including backend storage arrays and location-based mapping.",
  "frontend/docs/DEPLOYMENT.md": "Deployment guide outlining prerequisites, configuration, and steps for deploying Whisper to ICP.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes describing homepage UX and visual redesign including hero section, contrast fixes, and typography updates.",
  "frontend/docs/PHASED_PLAN.md": "Outlines phased development of Whisper from core architecture to single‑installation prototype and later multi‑installation features, with clear deliverables and non‑goals.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Describes the registry system for registering navigation destinations so the Secretary assistant can route users via options, keywords, or deep links.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Provides a full manual smoke test for instance creation, issue reporting workflows, task management, and regression checks.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Lists regression-focused smoke tests covering logo rendering, header styling, profile loading, navigation, Secretary flows, and base‑path deployment.",
  "frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md": "Defines smoke tests for the Secretary assistant's menu, discovery, issue reporting, custom categories, keyword routing, and error recovery flows.",
  "frontend/docs/STYLE_GUIDE.md": "Specifies Whisper’s visual design principles, color palette, typography, and accessibility guidelines.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Base HTML file mounting the app root and loading the main frontend entry script.",
  "frontend/public/whisper-logo-teal.svg": "SVG file containing the teal Whisper logo graphic.",
  "frontend/src/App.tsx": "Main app component handling routing via popstate, initializing React Query, and registering secretary navigation actions.",
  "frontend/src/components/common/HomeHeader.tsx": "Responsive header with navigation, authentication-aware menu items, and mobile menu handling.",
  "frontend/src/components/common/IconBubble.tsx": "Reusable circular icon wrapper with configurable size and color variants.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Shared spinner component with optional label and size variants.",
  "frontend/src/components/common/LoginButton.tsx": "Authentication button that triggers login/logout flows and displays status icons.",
  "frontend/src/components/common/UserProfileMenu.tsx": "Dropdown menu showing user avatar, profile navigation, and logout handling.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form for creating a new instance with auto-generated names, geographic selection, validation, and proposal submission.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "Dropdown for selecting a county based on a chosen state, with loading and error handling.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown for selecting a place within a county, loading data via useGetPlacesForCounty and handling errors and disabled states.",
  "frontend/src/components/create-instance/SelectState.tsx": "State selection dropdown that loads all states with useGetAllStates and displays errors or loading states.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing issue project details, status, category, geography, and a tasks tab for a proposal.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Task list and creation UI for an issue project, supporting adding tasks, toggling completion, and logging contribution events.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog displaying full proposal details with live data refresh and optional auto-opening of the related issue project view.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Section that lists all proposals with loading/error states and opens a detail dialog, also responding to secretary navigation events.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "UI card prompting users to engage with the Secretary feature, with dismiss and open actions.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Provides a typeahead input with keyboard navigation and selectable location options, filtering and displaying matches as the user types.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Implements the main secretary chat UI, sending user messages to a brain engine and handling location selections and assistant responses.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Renders the SecretaryWidget into a global overlay portal and adapts keyword lookup behavior for parent consumers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, auto‑refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminContributionLogs.ts": "Fetches paginated admin-only contribution logs using the backend actor.",
  "frontend/src/hooks/useAdminUserContributionLogs.ts": "Fetches contribution logs for a specific user principal, restricted to admin access.",
  "frontend/src/hooks/useCallerContributionSummary.ts": "Retrieves the authenticated caller’s contribution summary with identity-scoped caching.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Loads and saves the caller’s user profile with identity-scoped caching and mutation invalidation.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Provides complaint category suggestions and full category lists based on US hierarchy level and search term.",
  "frontend/src/hooks/useContributionEventLogger.ts": "Logs contribution events with client-side deduping, error normalization, and reward handling, updating summary caches accordingly.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Provides hooks to check instance name availability and submit new instance proposals with validation and React Query mutations.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the current route path using popstate events for SPA navigation updates.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useDeleteProposal.ts": "Defines a mutation to delete proposals and invalidate related queries on success.",
  "frontend/src/hooks/useHideProposal.ts": "Defines a mutation to hide proposals and refresh moderation and proposal data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context and hooks to manage Internet Identity login, stored identity loading, and auth client setup.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Contains hooks to fetch, create, and update tasks for a proposal with error handling and optimistic updates.",
  "frontend/src/hooks/useLocalStorageState.ts": "Persists state in localStorage with SSR safety and syncs updates automatically.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches admin moderation queue items and maps backend proposals into UI moderation objects.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and returns readiness and error state, resetting when the source changes.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple React Query hooks for fetching and mutating user profiles, proposals, geography data, and admin status via the actor API.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages secretary chat state including messages, menu visibility, and reset actions.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Implements a registry for navigation destinations with keyword lookup and action execution.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Provides mutations and getters for setting and reading issue project categories stored temporarily in localStorage.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Exposes a mutation to approve or reject proposals and invalidates related queries on success.",
  "frontend/src/hooks/useUSGeography.ts": "Defines React Query hooks for fetching states, counties, and places with error handling and caching.",
  "frontend/src/index.css": "Defines Tailwind base/theme variables and utility classes for light/dark modes and UI effects.",
  "frontend/src/lib/contributionActionTypes.ts": "Exports canonical action type constants and type for contribution events.",
  "frontend/src/lib/earnedPointsToast.ts": "Implements a unified earned‑points toast with action‑specific messaging, chat variants, lockout, and optional cached totals.",
  "frontend/src/lib/formatProposalGeography.ts": "Utilities to label, format, and assemble geography and population info for proposals.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines Secretary navigation options with keyword matching and deep-link helpers.",
  "frontend/src/lib/secretaryReportIssueData.ts": "Fetches geography details and top issues for reporting, combining backend calls with fallbacks.",
  "frontend/src/lib/secretaryTopIssuesMessaging.ts": "Class that retrieves and formats top-issues messages for states, counties, and cities.",
  "frontend/src/lib/uiCopy.ts": "Centralized UI text strings for product, navigation, proposals, and other app sections.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Generates, validates, and parses WHISPER-prefixed instance names based on geography.",
  "frontend/src/main.tsx": "App entry point setting up React, React Query, and Internet Identity provider.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin-only page that checks admin access and displays moderation items with login and error states.",
  "frontend/src/pages/admin/components/ContributionLogsSection.tsx": "Admin UI section for viewing global or user-scoped contribution logs with pagination and search.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Renders a table of moderation items with status badges and actions like approve, reject, hide, and delete.",
  "frontend/src/pages/GeographyPage.tsx": "Geography page UI displaying placeholder content and navigation back to home.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page that loads, edits, and saves a user’s profile with image upload and contribution logging hooks.",
  "frontend/src/secretary/brain/FlowEngineBrain.ts": "Implements the flow-engine-based secretary brain handling intents, slots, geography data, messaging, and navigation.",
  "frontend/src/secretary/brain/hooks.ts": "Utility helpers for composing and filtering flow event listeners, including no-op and console loggers.",
  "frontend/src/secretary/brain/SecretaryBrain.ts": "Defines the SecretaryBrain interface for handling input, actions, state, messages, typeahead, and listeners.",
  "frontend/src/secretary/copy/secretaryCopy.ts": "Provides fixed English UI strings and prompt templates for all Secretary menu, discovery, reporting, intent, and recovery flows.",
  "frontend/src/secretary/copy/secretaryPrompts.ts": "Defines helper functions to format location names and build dynamic prompts, lists, and messages for Secretary interactions.",
  "frontend/src/secretary/decisions/secretaryDecisions.ts": "Contains pure decision logic for branching Secretary flows, including issue-flow routing, unknown input recovery, and geography/instance checks.",
  "frontend/src/secretary/flow/flows.ts": "Defines all Secretary conversation nodes and their view models, integrating static copy and prompt builders for menu, discovery, and issue-reporting flows.",
  "frontend/src/secretary/flow/runner.ts": "Implements the flow controller that processes actions, transitions nodes, emits events, and produces view models using node definitions.",
  "frontend/src/secretary/flow/types.ts": "Declares core types for nodes, actions, transitions, context, and view models used across the Secretary flow engine.",
  "frontend/src/secretary/intent/flowRegistry.ts": "Maps intents to their required slots and order, and exposes registration for navigation handlers within the slot-filling system.",
  "frontend/src/secretary/intent/flowRunner.ts": "Implements slot-based flow execution for intents, including finding missing slots, prompting, filling values, and triggering completion navigation.",
  "frontend/src/secretary/intent/geographyLookup.ts": "Performs backend-powered state, county, and place lookup from free text, returning the most specific geography match.",
  "frontend/src/secretary/intent/geographyNlp.ts": "Provides client-side string-matching helpers to detect states, counties, and places in text and extract hierarchical geography info.",
  "frontend/src/secretary/intent/index.ts": "Barrel file exporting all intent, flow, repair, and geography utilities and types.",
  "frontend/src/secretary/intent/intentClassifier.ts": "Rule-based classifier mapping normalized user text to supported Secretary intents using keyword patterns.",
  "frontend/src/secretary/intent/repair.ts": "Detects correction messages, identifies which slot to repair, and clears affected slots via dependents logic.",
  "frontend/src/secretary/intent/slotState.ts": "Manages slot storage including getting, setting, clearing, dependency resets, and detecting filled state.",
  "frontend/src/secretary/intent/types.ts": "Defines Secretary intents, slots, value types, and the slot bag used in mini-flow processing.",
  "frontend/src/secretary/observability/secretaryTrace.ts": "Lightweight in-memory trace logger for recording Secretary events with enable/disable controls.",
  "frontend/src/secretary/state/secretaryContext.ts": "Creates and manages the Secretary conversation context, including slot resets, message handling, and flow state.",
  "frontend/src/secretary/ui/secretaryViewModel.ts": "Transforms internal node view models into UI-ready rendering instructions and resolves icon names.",
  "frontend/src/utils/assetUrl.ts": "Provides helpers to resolve asset URLs and join navigation paths with the app’s base path.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Implements event-based navigation for Secretary flows, allowing signaling and listening for project navigation events.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in session storage, and managing hash-based params.",
  "frontend/src/utils/userFacingError.ts": "Maps backend error messages to concise, user-friendly strings for display in the UI.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and required plugins.",
  "project_state.json": "Project state describing requirements and progress for implementing earned-points toast feedback in the app."
}