{
  "backend/main.mo": "Defines authorization mixin, US geography data types, proposals, tasks, and helper constructors for empty geography structures in a single Motoko actor.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs with high-confidence metadata.",
  "frontend-file-summaries.txt": "Auto‑generated summaries describing the purpose of various frontend files including docs, hooks, components, and styling config.",
  "frontend/docs/ARCHITECTURE.md": "Architecture document outlining Whisper’s vision, hierarchical installation model, ICP canister mapping, and modular subsystem design.",
  "frontend/docs/DEPLOYMENT.md": "Developer deployment guide for the ICP stack including sample dfx.json, deployment steps, upgrades, and cycle management.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes detailing homepage hero redesign, overlay specs, typography, contrast fixes, and component-level visual improvements.",
  "frontend/docs/PHASED_PLAN.md": "Phased development roadmap describing goals and deliverables from initial architecture through future multi‑installation expansion.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Explains how features register navigable destinations for the Secretary assistant using a registry hook. Covers option selection, free‑text routing, and deep‑link navigation.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Provides end‑to‑end smoke test steps for creating an instance proposal and completing follow‑up actions. Details expected UI behavior across creation, browsing, detail views, and Issue Project tasks.",
  "frontend/docs/STYLE_GUIDE.md": "Defines Whisper’s visual design principles, color palette, typography, and accessibility guidelines. Establishes consistent civic‑themed styling across the UI.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "HTML entry point that sets up root containers and loads the React application.",
  "frontend/src/App.tsx": "Main application component managing page sections, Secretary navigation registration, and UI state such as proposals, support, and image preloading. Integrates multiple feature sections and scroll targets.",
  "frontend/src/components/common/IconBubble.tsx": "UI component rendering a styled circular icon container with size and variant options. Used for decorative or status icons.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Shared loading component showing a spinner and optional text with configurable sizes. Standardizes loading visuals across the app.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Implements the full create‑instance proposal form with name validation, geography selectors, and submission flow. Manages form state, debouncing, validation, and success UI.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "County dropdown component that loads counties for a selected state and handles errors and loading states. Emits county selection to parent components.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown to choose a place within a county, handling loading, errors, and disabled states.",
  "frontend/src/components/create-instance/SelectState.tsx": "State selection dropdown that fetches all states and handles loading and error displays.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing project details with overview and tasks tabs for a proposal’s issued project.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Task management tab allowing creation and completion toggling of project tasks.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog presenting proposal details with admin controls for approval, rejection, and viewing the issued project.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Lists all proposals, supports refreshing and opening proposal detail dialogs.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "UI card prompting users to try the Secretary assistant with dismiss and open actions.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Interactive chat-style secretary widget that handles user input, keyword matching, menu navigation, and triggers option selection callbacks.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Creates a portal-mounted container for rendering the SecretaryWidget into an overlay root element.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Provides hooks for checking instance name availability and submitting new instance proposals with error handling and localStorage persistence.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a specified delay to reduce rapid updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity loading through a React context provider.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Hooks for fetching, creating, and updating tasks associated with a proposal, with automatic query invalidation.",
  "frontend/src/hooks/useLocalStorageState.ts": "Persist React state to localStorage with SSR-safe access and JSON serialization.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and reports readiness or load failures, logging warnings on errors.",
  "frontend/src/hooks/useQueries.ts": "Query hooks for parent-child relationship checks, fetching proposals, individual proposal lookup, and admin status validation.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages chat state for a secretary assistant, including messages, menu visibility, and helper functions to update or reset conversation state.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Provides a registry for navigation destinations with registration, lookup, keyword matching, and navigation execution.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook to update a proposal's status and invalidate related queries after success.",
  "frontend/src/hooks/useUSGeography.ts": "React Query hooks for fetching US states, counties, and places from the backend with error handling and caching.",
  "frontend/src/index.css": "Tailwind-based global styles defining color themes, utilities, animations, and layout rules for light and dark modes.",
  "frontend/src/lib/formatProposalGeography.ts": "Formats proposal geography into a readable string and provides labels for geography hierarchy levels.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines deep link parsing/creation, secretary navigation options, and keyword or number-based option matching.",
  "frontend/src/main.tsx": "App entry point that sets up React Query, Internet Identity, and renders the root component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using both query strings and session storage.",
  "frontend/src/utils/userFacingError.ts": "Normalizes unknown errors into safe user-facing messages while preserving the original error for debugging.",
  "frontend/tailwind.config.js": "Tailwind config enabling class-based dark mode, custom theme extensions, animations, and plugins.",
  "project_state.json": "Defines project state, existing features, and pending feature requests related to hero image settings and end-to-end flow handling."
}