{
  "backend/main.mo": "Defines actor with access control mixin, extensive US geography and proposal types, and helpers for initializing empty data structures.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries for numerous frontend files describing their purpose and recent changes.",
  "frontend/docs/ARCHITECTURE.md": "Detailed architectural vision describing hierarchical installations, ICP mapping, and modular subsystem design.",
  "frontend/docs/DEPLOYMENT.md": "Developer-focused deployment guide covering dfx configuration, upgrade workflow, and cycle management.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes on homepage redesign including updated hero image, contrast fixes, typography, spacing, and visual effects.",
  "frontend/docs/PHASED_PLAN.md": "Outlines Whisper's phased development plan from foundational architecture through single‑installation prototype to multi‑installation scaling with explicit goals and non‑goals.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Describes the registry system for adding navigable destinations the Secretary assistant can route users to via options, keywords, or deep links.",
  "frontend/docs/STYLE_GUIDE.md": "Defines Whisper’s visual design principles, color palette, typography, and accessibility guidelines for consistent UI styling.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Base HTML template mounting the Whisper frontend and loading the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Main application shell handling navigation, Secretary assistant integration, and UI section visibility via registered destinations.",
  "frontend/src/components/common/IconBubble.tsx": "Reusable component rendering an icon inside a styled circular container with size and variant options.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form component for creating a Whisper instance, handling geography selection, name validation, and proposal submission.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "Controlled select component for choosing a county based on selected state, with loading and error handling.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Controlled select component for choosing a place within a county, supporting loading, empty, and error states.",
  "frontend/src/components/create-instance/SelectState.tsx": "Controlled select component for choosing a US state, handling loading, errors, and disabled states.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog showing detailed proposal info with admin moderation actions for approving or rejecting.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Lists all proposals with loading and error states and opens a detail dialog for each entry.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "Promotional card encouraging users to open the Secretary assistant with dismiss functionality.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Interactive chat widget for the Secretary assistant, handling messages, menu navigation, and option selection.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Creates and mounts the Secretary widget into a portal container for overlay rendering.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor using identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Provides hooks to check instance name availability and submit new creation proposals with geography metadata.",
  "frontend/src/hooks/useDebouncedValue.ts": "Debounces any value over a configurable delay to reduce rapid updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for Internet Identity authentication, handling identity loading, login flow, and status tracking.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook that syncs React state to localStorage with SSR safeguards and JSON serialization.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend interactions such as parent checks, proposal retrieval, and admin status checks.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages secretary-style chat state, including messages, menu visibility, and helper actions.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Maintains a registry of navigation destinations with keyword search and action execution.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook to update proposal status and invalidate related queries.",
  "frontend/src/hooks/useUSGeography.ts": "React Query hooks for fetching US states, counties, and places with error handling and caching.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, dark mode, utilities, and animations.",
  "frontend/src/lib/formatProposalGeography.ts": "Formats proposal geography into readable strings and provides labels for hierarchy levels.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines navigation intent types, parses and creates deep links, provides secretary option metadata, and includes helpers to match keywords or select options.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL or session-stored parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend styling system.",
  "project_state.json": "Describes the project’s current frontend-only styling update scope, known issues, and feature requirements for theme and hero image changes."
}