{
  "backend/main.mo": "Defines backend actor with storage and authorization mixins plus extensive types for geography, proposals, user profiles, and internal data structures.",
  "feature_evidence.json": "Feature evidence report listing completed frontend tasks, associated files, components, and test IDs with high-confidence assessments.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files, their purpose, and recent functional updates.",
  "frontend/docs/ARCHITECTURE.md": "Architecture document outlining Whisper’s vision, hierarchical installation model, ICP canister mapping, and modular subsystem design.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Specification describing stable-memory complaint category storage and schema for AI Secretary suggestions.",
  "frontend/docs/DEPLOYMENT.md": "Deployment guide covering prerequisites, configuration, and steps for deploying Whisper to the ICP network.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes detailing homepage hero‑section redesign, permanent mission text, contrast improvements, and visual/UX updates.",
  "frontend/docs/PHASED_PLAN.md": "Phased development plan defining deliverables and non-goals across stages from architecture through multi‑installation features.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Explains how features register navigable destinations for the Secretary assistant via a registry hook supporting options, free-text routing, and deep links.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Provides a full manual smoke test for proposal creation, moderation, issue reporting, task management, and several UI regression checks.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Defines a focused QA checklist validating regression fixes around logo rendering, hover styles, profile handling, and navigation behavior.",
  "frontend/docs/STYLE_GUIDE.md": "Outlines Whisper’s visual design principles, color palette, typography rules, and accessibility-focused styling guidelines.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Base HTML file that sets up the root containers and loads the main frontend script.",
  "frontend/public/whisper-logo-teal.svg": "SVG asset containing a teal circular Whisper logo with stylized white elements.",
  "frontend/src/App.tsx": "Main app component that handles SPA-style routing via pathname parsing and renders pages with lazy loading and a hero home view.",
  "frontend/src/components/common/AppErrorBoundary.tsx": "React error boundary that catches runtime errors, logs details, and displays a user-friendly reloadable fallback screen.",
  "frontend/src/components/common/HomeHeader.tsx": "Renders the main site header with logo, navigation, login handling, and mobile menu logic.",
  "frontend/src/components/common/IconBubble.tsx": "Displays an icon inside a styled circular container with size and variant options.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Provides a spinner with an optional label for consistent loading UI.",
  "frontend/src/components/common/LoginButton.tsx": "Handles login/logout actions and shows appropriate button text and icon states.",
  "frontend/src/components/common/UserProfileMenu.tsx": "Shows a dropdown with user profile info and actions like navigating to profile or logging out.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Implements the form for creating an instance, including name generation, geography selection, validation, and proposal submission.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "County selector that loads counties for a state and handles errors and loading states.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Place selector that loads places for a county with support for errors and loading.",
  "frontend/src/components/create-instance/SelectState.tsx": "State selector component that fetches and displays all states with error and loading handling.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing an issue project's overview and tasks tabs, with status, category, geography, and task list integration.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Task management UI for creating and toggling tasks tied to a proposal, with loading, error, and mutation handling.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog that displays detailed proposal info with live query updates and links to open the related issue project dialog.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Main proposals list section handling fetching, navigation events, and opening detailed proposal dialogs.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "Dismissible card prompting users to open the secretary assistant with styled messaging and a button.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Typeahead input for searching and selecting location options with keyboard navigation and loading states.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Main interactive secretary widget handling chat, discovery flow, issue reporting, and geographic selection with many hooks and UI components.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Creates a portal target for rendering the SecretaryWidget into an overlay div mounted on the document body.",
  "frontend/src/hooks/useAccountDeletion.ts": "Provides mutations for users to request account deletion and for admins to process deletion requests, with query invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Fetches and saves the current user's profile using actor and identity-scoped queries with proper cache invalidation.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Fetches complaint suggestions and all complaint categories by geography level using actor-backed queries.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Checks instance-name availability and submits new instance proposals with validation and error handling, invalidating proposal caches.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the app’s current route path using popstate events for navigation state updates.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced version of a value for delaying updates like API calls while typing.",
  "frontend/src/hooks/useDeleteProposal.ts": "Mutation for deleting a proposal and invalidating moderation and proposal queries.",
  "frontend/src/hooks/useHideProposal.ts": "Mutation for hiding a proposal with related query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Defines React Query hooks to fetch, create, and update project tasks using the backend actor with optimistic updates.",
  "frontend/src/hooks/useLocalStorageState.ts": "Implements a SSR-safe hook for persisting state to localStorage with automatic JSON parsing and syncing.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches moderation queue proposals and maps them into UI-ready moderation items with loading and error handling.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and exposes ready/error state, resetting when the source changes.",
  "frontend/src/hooks/useQueries.ts": "Contains assorted backend query hooks for parent checks, proposals, single proposal fetch, and admin status.",
  "frontend/src/hooks/useSecretaryAutoCreateInstance.ts": "Mutation hook that auto-creates a Whisper instance proposal based on geography, handling naming, validation, and query invalidation.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages simple chat state for the Secretary UI, including messages and menu visibility.",
  "frontend/src/hooks/useSecretaryGeography.ts": "Provides React Query hooks for secretary endpoints to fetch states, counties, cities, top issues, and city name search by hierarchical ID.",
  "frontend/src/hooks/useSecretaryInstanceAvailability.ts": "Checks Whisper instance availability for selected geography levels and aggregates multi-level availability states.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Implements a registry for navigation destinations with keyword search and invocation support.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Stores and retrieves temporary issue project categories in localStorage using React Query mutations.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Handles proposal status updates with validation and invalidates related queries after mutation.",
  "frontend/src/hooks/useUSGeography.ts": "Fetches US states, counties, and places via backend with safe fallbacks and caching using React Query.",
  "frontend/src/index.css": "Defines Tailwind-based theming, colors, utilities, and layout styles for light and dark modes.",
  "frontend/src/lib/formatProposalGeography.ts": "Formats proposal geography labels, population, and human-readable descriptions for UI display.",
  "frontend/src/lib/secretaryFriendlyMessages.ts": "Builds friendly secretary messages based on geography, instance existence, and top issues, including helper functions for founding and existing instance messages.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines secretary navigation options with keyword matching and utilities for creating and parsing deep links.",
  "frontend/src/lib/uiCopy.ts": "Centralizes user‑facing UI text for product, auth, secretary, profile, and other app sections.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Generates, validates, and extracts Whisper instance names based on geography and computes canonical names for Secretary workflows.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and Internet Identity provider and renders the root component.",
  "frontend/src/pages/admin/AdminDeletionRequestsPage.tsx": "Admin page for viewing and processing account deletion requests with authentication, authorization, and mutation handling.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin moderation page handling auth, admin checks, navigation, and displaying moderation items.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Renders a table of moderation items with status badges, actions, confirmations, and empty state handling.",
  "frontend/src/pages/GeographyPage.tsx": "Displays a placeholder geography page with navigation back to home and UI copy integration.",
  "frontend/src/pages/profile/ProfileEditPage.tsx": "Profile editing page supporting name updates, image upload/removal, local-only fields, and account deletion requests.",
  "frontend/src/pages/profile/profileLocalState.ts": "LocalStorage helpers for storing and retrieving profile fields not yet supported by the backend.",
  "frontend/src/pages/profile/ProfileViewPage.tsx": "Displays the authenticated user's profile with backend and local-only fields plus edit navigation.",
  "frontend/src/pages/ProfilePage.tsx": "Empty file with no implementation.",
  "frontend/src/utils/assetUrl.ts": "Utility to resolve asset URLs safely based on the app's base path.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Implements custom event-based navigation for secretary-to-project transitions.",
  "frontend/src/utils/spaNavigate.ts": "Simple SPA navigation helper using history.pushState and popstate events.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing) and persisting them in sessionStorage, plus utilities to clear stored or hash-based params.",
  "frontend/src/utils/userFacingError.ts": "Normalizes various error types into concise user-friendly messages with special handling for moderation, auth, and backend errors.",
  "frontend/tailwind.config.js": "Defines TailwindCSS configuration with custom colors, fonts, animations, and plugin setup for the frontend.",
  "project_state.json": "Defines project state, required updates, and feature requests for removing editor dependencies and updating the homepage hero text."
}