{
  "backend/main.mo": "Defines the backend actor with authorization, blob storage, and a large set of geography, proposal, and profile types plus helpers for initializing empty US geography data.",
  "feature_evidence.json": "Lists implemented features with metadata, linking feature IDs to affected frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Provides concise summaries of many frontend project files including docs, hooks, components, and styles for quick reference.",
  "frontend/docs/ARCHITECTURE.md": "Describes Whisper’s overall system architecture, installation hierarchy model, canister mapping, and modular subsystem design principles.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Specifies the complaint category suggestion system including backend category storage, data structures, and frontend integration expectations.",
  "frontend/docs/DEPLOYMENT.md": "Deployment guide detailing prerequisites, configuration, and instructions for deploying the app to the Internet Computer.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Documents homepage redesign updates including hero section assets, color/contrast fixes, and typography and layout improvements.",
  "frontend/docs/PHASED_PLAN.md": "Outlines a multi-phase development plan for Whisper, detailing deliverables, non-goals, and scaling hooks from prototype to multi-installation system.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Describes the registry system for registering and navigating destinations within the Secretary assistant.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Provides a full smoke test for proposal creation, moderation, issue reporting, task workflows, and regression checks.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Lists regression-focused smoke tests covering logo fixes, navigation, Secretary flows, and base-path deployment.",
  "frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md": "Defines smoke tests for all Secretary assistant flows including discovery, issue reporting, keyword routing, and recovery.",
  "frontend/docs/STYLE_GUIDE.md": "Specifies Whisper’s visual design system including principles, color palette, typography, and accessibility rules.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Minimal HTML shell that mounts the app and loads the main TypeScript entrypoint.",
  "frontend/public/whisper-logo-teal.svg": "SVG asset containing the teal Whisper logo with geometric and symbolic elements.",
  "frontend/src/App.tsx": "Main app component handling routing, secretary widget behavior, query client setup, and lazy-loaded pages.",
  "frontend/src/components/common/HomeHeader.tsx": "Header with navigation, authentication controls, and mobile menu that updates routing via history API.",
  "frontend/src/components/common/IconBubble.tsx": "Reusable styled circular icon container supporting size and color variants.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Standardized spinner with optional label and size settings for loading states.",
  "frontend/src/components/common/LoginButton.tsx": "Login/logout button integrating Internet Identity auth with loading state and icon changes.",
  "frontend/src/components/common/UserProfileMenu.tsx": "User dropdown showing avatar, profile navigation, and logout, using caller profile query data.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form card for creating an instance with auto-generated names, validation, and proposal submission.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "County selector fetching counties by state and rendering options with loading and error handling.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown component that loads and selects places for a given county, handling loading and error states.",
  "frontend/src/components/create-instance/SelectState.tsx": "Dropdown for selecting a US state using fetched state data with loading and error handling.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing issue project details, category, status, geography, and a tasks tab for a proposal.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Tasks tab allowing creation, display, and status updates of tasks for an issue project.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog showing detailed proposal information, loading live data, and linking to its Issue Project view.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Section listing all proposals with loading/error states and a dialog for viewing proposal details.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "UI card prompting users to open the Secretary assistant, with dismiss and open actions.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "A searchable typeahead component that filters options, supports keyboard navigation, and triggers selection callbacks.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Main interactive secretary widget that drives flow logic, loads geography and proposal data, and integrates with the FlowEngineBrain.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Creates a portal-mounted wrapper for rendering the SecretaryWidget into an overlay root.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Fetches and saves the caller’s user profile with identity-scoped caching and mutation invalidation.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Fetches complaint category suggestions and lists based on geography level using backend actor queries.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Validates and submits new instance proposals and checks name availability, invalidating proposal queries on success.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the current SPA route path and updates on browser navigation events.",
  "frontend/src/hooks/useDebouncedValue.ts": "Debounces a value by a configurable delay to reduce rapid updates.",
  "frontend/src/hooks/useDeleteProposal.ts": "Provides a mutation to delete proposals and invalidates moderation and proposal queries.",
  "frontend/src/hooks/useHideProposal.ts": "Provides a mutation to hide proposals and invalidates moderation and proposal queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login state and identity persistence.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Implements task CRUD hooks using react-query, supporting fetching, creating, and updating tasks with optimistic UI updates.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook that syncs React state with localStorage, safely handling SSR and JSON parsing errors.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches and maps backend moderation queue items into UI-friendly structures with react-query, handling loading and errors.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and exposes ready/error state, resetting when the source changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for user profiles, proposals, admin checks, geography lookups, and related backend queries.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages simple chat state for a secretary assistant UI, including messages and menu visibility.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Provides a registry for navigable destinations, supporting registration, keyword lookup, and programmatic navigation.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Temporary client-side workaround to store and retrieve issue project categories via localStorage with related query invalidation.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Hook using react-query to update proposal status with validation and cache invalidation.",
  "frontend/src/hooks/useUSGeography.ts": "React-query hooks for fetching states, counties, and places from the backend, with robust empty-result handling and caching.",
  "frontend/src/index.css": "Tailwind-based global stylesheet defining color variables, theming, utilities, and layout helpers.",
  "frontend/src/lib/formatProposalGeography.ts": "Helpers to format proposal geography, population, and readable location strings.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines Secretary navigation options with keyword matching and deep-link utilities.",
  "frontend/src/lib/secretaryReportIssueData.ts": "Fetches geography details and top issues from backend with structured results and fallbacks.",
  "frontend/src/lib/secretaryTopIssuesMessaging.ts": "Class providing formatted top-issue messages for states, counties, and cities with backend lookups.",
  "frontend/src/lib/uiCopy.ts": "Centralized UI text constants for product, navigation, proposals, and Secretary flows.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Provides helpers to generate, validate, normalize, and extract geography from WHISPER-prefixed instance names.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin interface for checking admin status and moderating proposals with approve, reject, hide, and delete actions.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Displays a table of moderation items with status badges, category icons, and action confirmations.",
  "frontend/src/pages/GeographyPage.tsx": "Renders a geography placeholder page with navigation back to home.",
  "frontend/src/pages/ProfilePage.tsx": "Implements user profile editing with name and image upload, using identity hooks and backend mutations.",
  "frontend/src/secretary/brain/FlowEngineBrain.ts": "Implements the SecretaryBrain using a flow engine with intent classification, slot filling, navigation, and geography data.",
  "frontend/src/secretary/brain/hooks.ts": "Provides utilities to compose and filter flow event listeners, including multicast, no-op, logging, and type-filtered listeners.",
  "frontend/src/secretary/brain/SecretaryBrain.ts": "Defines the SecretaryBrain interface for handling user input, actions, messages, events, and context.",
  "frontend/src/secretary/copy/secretaryCopy.ts": "Defines static English UI copy and prompt templates for menu, discovery, reporting issues, intent flows, and error handling.",
  "frontend/src/secretary/copy/secretaryPrompts.ts": "Generates dynamic prompt strings for issues, discovery results, unknown input, and slot-filling based on location and context.",
  "frontend/src/secretary/decisions/secretaryDecisions.ts": "Implements pure branching logic for determining next nodes, geography resolution, instance existence, and report-issue validation.",
  "frontend/src/secretary/flow/flows.ts": "Declares all Secretary conversation nodes with UI view models and enter actions for menu, discovery, and report issue flows.",
  "frontend/src/secretary/flow/runner.ts": "Controls flow execution by handling actions, transitions, node lifecycle events, and emitting flow events, producing updated view models.",
  "frontend/src/secretary/flow/types.ts": "Defines core flow engine types including nodes, transitions, actions, context shape, view models, and event listener interfaces.",
  "frontend/src/secretary/intent/flowRegistry.ts": "Defines and registers intent flows with required slots, prompt order, and completion behaviors.",
  "frontend/src/secretary/intent/flowRunner.ts": "Runs intent flows by determining missing slots, generating prompts, filling slots, and executing completion actions.",
  "frontend/src/secretary/intent/index.ts": "Barrel file re-exporting all intent-related modules.",
  "frontend/src/secretary/intent/intentClassifier.ts": "Classifies user text into intents using keyword matching and detects intent-trigger-like input.",
  "frontend/src/secretary/intent/repair.ts": "Detects repair messages, identifies which slot to correct, and applies slot updates with dependency clearing.",
  "frontend/src/secretary/intent/slotState.ts": "Manages slot values with utilities to set, clear, reset dependents, and check filled status.",
  "frontend/src/secretary/intent/types.ts": "Defines Secretary intents, slot types, slot bags, and intent-related context structures.",
  "frontend/src/secretary/state/secretaryContext.ts": "Manages full conversation state, providing initialization, reset, messaging, and slot-reset helpers.",
  "frontend/src/secretary/ui/secretaryViewModel.ts": "Transforms view models into UI-friendly structures and maps icon names to identifiers.",
  "frontend/src/utils/assetUrl.ts": "Safely resolves asset URLs using the app's base path.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Provides custom event helpers for signaling navigation from the Secretary to project views.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters across routing modes and session storage.",
  "frontend/src/utils/userFacingError.ts": "Maps various backend error messages to short user-friendly strings covering auth, moderation, geography, tasks, profiles, and network issues.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, typography, dark mode, and extended theme settings.",
  "project_state.json": "Stores project state, goals, and implemented features for a client-side AI Secretary with intent and slot-based flows."
}