{
  "backend/main.mo": "Defines an actor with access control mixin plus a large set of geographic, installation, and proposal types, along with helper functions for creating empty geography and proposal data structures.",
  "feature_evidence.json": "Lists feature changes, affected files, components, and test IDs for UI, hero section, secretary widget, and navigation enhancements with high-confidence evidence links.",
  "frontend-file-summaries.txt": "Catalog of frontend files with brief descriptions summarizing architecture docs, style guides, UI updates, React components, and supporting hooks.",
  "frontend/docs/ARCHITECTURE.md": "Architecture document describing Whisper’s vision, hierarchical installation model, ICP canister mapping, and modular subsystem design principles.",
  "frontend/docs/DEPLOYMENT.md": "Developer deployment guide detailing dfx configuration, deployment workflow, upgrade process, and cycle management on ICP.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes documenting the redesigned hero section, UI contrast fixes, secretary widget readability improvements, and updated typography, spacing, and effects.",
  "frontend/docs/PHASED_PLAN.md": "Outlines multi‑phase development for Whisper, defining deliverables, non‑goals, and scaling hooks for installations and issue workflows.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Describes the registry system for registering and routing Secretary assistant navigation destinations.",
  "frontend/docs/STYLE_GUIDE.md": "Provides Whisper’s visual design rules including color palette, typography, and accessibility standards.",
  "frontend/index.css": "Defines global Tailwind layers and theme variables for light/dark modes, including color and layout tokens.",
  "frontend/index.html": "Base HTML entry point mounting the root element and loading the main TSX application.",
  "frontend/src/App.tsx": "Main application component handling navigation registry, Secretary widget state, and UI section rendering.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "UI form for proposing new Whisper instances with location selection, name generation, and validation.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog showing proposal details with admin approval/rejection actions and loading/error handling.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Displays proposal list with loading, error, and empty states, allowing users to view proposal details and statuses. Fetches proposals via useGetAllProposals and formats geography info.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "Shows a dismissible card introducing the AI Secretary with a button to start a conversation. Intended as a lightweight discoverability prompt.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Implements a floating chat widget for interacting with the AI Secretary, handling messages, menu navigation, and UI state. Integrates with useSecretaryChat for message logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, reinitializing on identity changes. Automatically invalidates dependent queries when the actor updates.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Provides hooks to check instance name availability and submit new proposals to the backend. Invalidates relevant caches after successful submission.",
  "frontend/src/hooks/useDebouncedValue.ts": "Debounces a changing value by a specified delay to reduce rapid updates. Useful for delaying calls during user input.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login, persistence, and state exposure through a React context. Provides helpers for login, logout, and identity lifecycle handling.",
  "frontend/src/hooks/useLocalStorageState.ts": "Stores React state in localStorage with SSR safety and automatic persistence. Returns a state/value pair similar to useState.",
  "frontend/src/hooks/useQueries.ts": "Collection of backend query hooks for checking relationships, fetching proposals, and verifying admin access. All queries depend on the authenticated actor from useActor.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages chat state for a secretary-style assistant, handling initialization, message addition, and option selection.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Provides a registry for navigation destinations with keyword matching and programmatic navigation actions.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook to update a proposal's status and invalidate related queries after success.",
  "frontend/src/hooks/useUSGeography.ts": "React Query hooks that fetch U.S. states, counties, and places from the backend with error handling and caching.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and theme variables for light and dark modes, including custom utilities.",
  "frontend/src/lib/formatProposalGeography.ts": "Formats proposal geography data into readable text and provides labels for geography levels.",
  "frontend/src/lib/secretaryNavigation.ts": "Parses and creates deep links and maps keywords to navigation options for the secretary assistant.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, identity provider, and renders the main app.",
  "frontend/src/utils/urlParams.ts": "Utility functions for getting, storing, and clearing URL and session parameters, including hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling class-based dark mode, custom color tokens, extended animations, fonts, shadows, and plugin integrations.",
  "project_state.json": "Project state file outlining UI refinement goals, hero image updates, secretary deep-linking architecture, and tracked feature requests."
}