{
  "backend/main.mo": "Motoko actor defining authorization, blob storage mixins, and extensive types for US geography, proposals, tasks, and related data structures.",
  "feature_evidence.json": "JSON report listing implemented features, affected frontend files, components, and test IDs with high‑level metadata.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short summaries describing their purpose and functionality.",
  "frontend/docs/ARCHITECTURE.md": "Architecture document outlining Whisper’s vision, hierarchical installation model, and ICP-based canister architecture.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Specification defining stable-memory storage and schema for complaint categories used by the AI Secretary.",
  "frontend/docs/DEPLOYMENT.md": "Guide describing prerequisites, configuration, and steps for deploying Whisper to the ICP network.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes detailing homepage visual/UX changes, including hero section, contrast fixes, and typography updates.",
  "frontend/docs/PHASED_PLAN.md": "Phased development plan outlining feature milestones from architecture through multi-installation scaling.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Explains how features register navigable destinations for the Secretary assistant using a registry hook. Covers option selection, free-text routing, and deep links.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Manual end‑to‑end smoke test covering proposal creation, admin moderation, issue project flow, task management, and regression checks. Includes expected behaviors and a failure reporting template.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Focused QA checklist validating regression fixes for logo rendering, hover styling, profile behavior, and navigation. Includes environment setup and expected outcomes.",
  "frontend/docs/STYLE_GUIDE.md": "Defines Whisper’s visual design principles, color palette, typography, and accessibility rules. Provides detailed guidance for consistent UI styling.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Base HTML file setting up the app root elements and loading the main TypeScript entry point.",
  "frontend/public/whisper-logo-teal.svg": "SVG logo containing a teal circular emblem with white geometric accents.",
  "frontend/src/App.tsx": "Main app component handling page routing via popstate and rendering lazy‑loaded pages inside an error boundary and suspense wrapper.",
  "frontend/src/components/common/AppErrorBoundary.tsx": "Top-level React error boundary that catches runtime errors and displays a fallback screen with optional debug details.",
  "frontend/src/components/common/HomeHeader.tsx": "Responsive header with logo, navigation links, login handling, mobile menu, and base‑path‑aware navigation updates.",
  "frontend/src/components/common/IconBubble.tsx": "Reusable circular icon container with size and color variants for UI decoration.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Reusable spinner component with configurable size, label, and styling.",
  "frontend/src/components/common/LoginButton.tsx": "Authentication button handling login/logout states with icons and loading behavior.",
  "frontend/src/components/common/UserProfileMenu.tsx": "User dropdown menu showing profile info, navigation to profile, and logout handling.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form card for creating a new instance with auto‑generated names, validation, and proposal submission.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "Dropdown component for selecting a county based on a chosen state, with loading and error states.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown component for selecting a place based on a chosen county, with loading and error handling.",
  "frontend/src/components/create-instance/SelectState.tsx": "Dropdown for selecting a US state with data loading and error display.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing detailed info for an issue project, including geography, status, category, and tasks.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Displays and manages a task list for a proposal, supporting creation and completion toggling with loading and error states.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Shows a dialog with detailed proposal info, live data fetching, and an option to open the related Issue Project dialog.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Lists all proposals with loading, error, and empty states, and opens a detail dialog with optional navigation triggers.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "A dismissible card prompting users to open the Secretary widget via a call-to-action button.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Provides a searchable dropdown for selecting geographic options with keyboard navigation and loading states.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Implements the full Secretary assistant UI, handling chat, discovery flow, issue reporting, location selection, and navigation actions.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Renders the Secretary widget into a dedicated overlay container using a React portal.",
  "frontend/src/hooks/useAccountDeletion.ts": "Provides mutations to request or process user account deletion and invalidates related admin queries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Fetches and updates the caller's user profile with identity‑scoped caching and mutations.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Fetches complaint suggestions or full complaint category lists based on geography level and search term.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Checks instance name availability and submits new instance proposals with validation and cache invalidation.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the current SPA route path using popstate events.",
  "frontend/src/hooks/useDebouncedValue.ts": "Debounces a value by a delay to limit rapid updates.",
  "frontend/src/hooks/useDeleteProposal.ts": "Deletes a proposal and invalidates moderation and proposal queries.",
  "frontend/src/hooks/useHideProposal.ts": "Hides a proposal and refreshes moderation and proposal data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login, and logout.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Fetches and mutates project tasks with optimistic updates for create and status changes.",
  "frontend/src/hooks/useLocalStorageState.ts": "Persists React state to localStorage with SSR‑safe access.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches the admin moderation queue and maps backend proposals into moderation item objects with loading state tied to actor readiness.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and returns simple ready/error flags, resetting when the source changes.",
  "frontend/src/hooks/useQueries.ts": "Provides various backend query hooks for parent checks, proposals, single proposal fetching, and admin status with identity-aware enabling.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages a lightweight chat log and menu visibility with helpers to add messages and reset state.",
  "frontend/src/hooks/useSecretaryGeography.ts": "Provides secretary-specific geography queries for states, counties, cities, top issues, and city-name search with caching and guarded enabling.",
  "frontend/src/hooks/useSecretaryInstanceAvailability.ts": "Checks if a Whisper instance name is taken for geography selections and aggregates availability across multiple levels.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Maintains a registry of navigable destinations with keyword lookup and programmatic navigation support.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Temporarily stores and retrieves issue project categories in localStorage and invalidates related queries on update.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Updates proposal status with validation and invalidates proposals, moderation items, and specific proposal queries on success.",
  "frontend/src/hooks/useUSGeography.ts": "Provides geography queries for states, counties, and places with safe empty-return handling and caching.",
  "frontend/src/index.css": "Tailwind setup defining theme variables, dark mode tokens, and custom utility classes like hero layout, hover effects, and overlay handling.",
  "frontend/src/lib/formatProposalGeography.ts": "Utility functions to format proposal geography info, including labels, population formatting, and readable geography strings.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines Secretary navigation options with keyword matching and utilities for creating and parsing deep links.",
  "frontend/src/lib/uiCopy.ts": "Centralized UI text constants covering product labels, auth text, Secretary dialog copy, and general interface messaging.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Helpers for generating, validating, and extracting data from WHISPER-prefixed instance names based on geographic levels.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, identity provider, and global styles.",
  "frontend/src/pages/admin/AdminDeletionRequestsPage.tsx": "Admin page to view and process account deletion requests with authentication and access checks.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin interface for viewing and managing moderation items, with access validation and navigation controls.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Reusable list component rendering moderation items with status badges and actions like approve, reject, hide, and delete.",
  "frontend/src/pages/GeographyPage.tsx": "Page component displaying a placeholder for upcoming geography features with navigation and styled card layout.",
  "frontend/src/pages/profile/ProfileEditPage.tsx": "User profile editing page supporting image upload, backend-synced fields, and client-stored auxiliary fields.",
  "frontend/src/pages/profile/profileLocalState.ts": "Local storage helpers for storing profile fields not supported by the backend, including getters and setters.",
  "frontend/src/pages/profile/ProfileViewPage.tsx": "Displays a user's profile with backend and locally stored fields, offering navigation and edit options.",
  "frontend/src/pages/ProfilePage.tsx": "Empty placeholder file for the profile page.",
  "frontend/src/utils/assetUrl.ts": "Utility for resolving static asset URLs safely relative to the app’s base path.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Event-based navigation utilities for signaling and listening to secretary-to-project navigation events.",
  "frontend/src/utils/spaNavigate.ts": "Implements SPA navigation using pushState and dispatching a popstate event.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL params, persisting them in sessionStorage, and managing hash/query-based routing.",
  "frontend/src/utils/userFacingError.ts": "Normalizes unknown errors into user-friendly messages while logging original errors.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, animations, and plugin settings for the frontend.",
  "project_state.json": "Stores project state, known issues, feature requirements, and pending Secretary-related backend additions."
}