{
  "backend/main.mo": "Main canister actor defining user profiles, contribution logging types, governance stubs, geo types, and includes authorization, storage, and migration integration.",
  "backend/migration.mo": "Migration module converting old contribution log entries into new format by adding an `invalidated` field and updating stored maps.",
  "feature_evidence.json": "Feature evidence manifest listing features, related files, components, and test IDs for UI and token operations work.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files covering architecture, deployment, hooks, components, and UI updates.",
  "frontend/docs/ARCHITECTURE.md": "Architecture document describing Whisper’s vision, hierarchical installation model, ICP canister mapping, and modular subsystem design.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Spec defining the complaint category suggestion system including backend storage arrays and location-based mappings.",
  "frontend/docs/DEPLOYMENT.md": "Deployment guide with prerequisites, configuration steps, and instructions for deploying Whisper to ICP.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes detailing homepage redesign decisions including hero image, overlay, contrast fixes, typography, and spacing.",
  "frontend/docs/PHASED_PLAN.md": "Outlines a multi‑phase development plan for Whisper, detailing deliverables, non‑goals, and architectural foundations for each phase.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Describes the registry system for Secretary navigation, allowing features to register destinations for option selection, keyword routing, and deep links.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Provides a full manual smoke test covering instance creation, proposal moderation, issue project flows, task management, and regression checks.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Lists regression-focused smoke tests validating UI fixes, Secretary flow behavior, and base‑path deployment correctness.",
  "frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md": "Defines smoke tests for all Secretary assistant flows including discovery, issue reporting, keyword/deep‑link routing, and error recovery.",
  "frontend/docs/STYLE_GUIDE.md": "Specifies Whisper's visual style guidelines including color palette, typography, design principles, and accessibility rules.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Base HTML file setting up the root containers and loading the frontend entry script.",
  "frontend/public/whisper-logo-teal.svg": "SVG asset containing the teal Whisper logo with circle and arrow-like elements.",
  "frontend/src/App.tsx": "Main app component handling routing, secretary navigation, and lazy-loaded pages with react-query setup.",
  "frontend/src/components/common/EarnedPointsInlineBadge.tsx": "Inline badge showing earned contribution points unless duplicate or zero.",
  "frontend/src/components/common/HomeHeader.tsx": "Responsive site header with navigation, authentication-aware menus, and mobile menu handling.",
  "frontend/src/components/common/IconBubble.tsx": "Styled circular wrapper component for icons with size and variant options.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Reusable spinner with optional label for loading states.",
  "frontend/src/components/common/LoginButton.tsx": "Button handling login/logout with Internet Identity and query cache clearing.",
  "frontend/src/components/common/UserProfileMenu.tsx": "User dropdown menu showing profile info and logout option with avatar rendering.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form card for creating a new instance, handling geography selection, validation, submission, and contribution logging.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "County selector that loads counties by state, handles loading and errors, and emits selected county.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown to choose a place within a county, loading place data and handling errors and disabled states.",
  "frontend/src/components/create-instance/SelectState.tsx": "Dropdown to select a U.S. state, fetching state data and showing loading or error states.",
  "frontend/src/components/issue-project/EvidenceUploadSection.tsx": "UI for uploading evidence files and logging contribution events, with validation, error handling, and earned-points feedback.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing issue‑project details with tabs for overview, tasks, and evidence, loading proposal data and geography info.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Task list and creation UI for issue projects, including task mutations and contribution logging with inline feedback.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog showing detailed proposal information with live data loading and optional automatic opening of the Issue Project view.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Displays a list of proposals with loading, error, empty states, refresh handling, and opens a detail dialog on selection or navigation events.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "Renders a dismissible UI card prompting users to open the Secretary assistant.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Provides a searchable typeahead input for selecting a location with keyboard navigation and selectable options.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Implements the Secretary chat widget, handling user messages, assistant responses, brain actions, and location selections.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Creates a portal wrapper for rendering the Secretary widget into an overlay root with open/close management.",
  "frontend/src/hooks/useActor.ts": "Loads and caches the backend actor based on identity, initializing access control and invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdminContributionLogs.ts": "Fetches paginated admin-only contribution logs using the authenticated actor.",
  "frontend/src/hooks/useAdminUserContributionLogs.ts": "Fetches contribution logs for a specific user principal with admin-only access.",
  "frontend/src/hooks/useAdminWspTokenOperations.ts": "Provides admin mutations for minting and burning WSP tokens with validation and query invalidation.",
  "frontend/src/hooks/useCallerContributionSummary.ts": "Retrieves the caller's contribution summary from the backend using the current identity.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Provides hooks to fetch and save the caller’s user profile with identity-scoped caching and invalidation.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Fetches complaint category suggestions and full category lists based on hierarchy level using React Query.",
  "frontend/src/hooks/useContributionEventLogger.ts": "Logs user contribution events with deduping, error normalization, and cache updates for rewards and summaries.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Checks instance-name availability and submits new instance proposals with validation and cache invalidation.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the SPA’s current path by listening to popstate events for navigation changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Debounces a value by a delay to reduce rapid updates, often for search inputs.",
  "frontend/src/hooks/useDeleteProposal.ts": "Deletes a proposal and invalidates moderation and proposal queries on success.",
  "frontend/src/hooks/useHideProposal.ts": "Hides a proposal and refreshes moderation and proposal caches afterward.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login handling, and identity persistence via a React context.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Manages fetching, creating, and updating proposal tasks with optimistic updates and error handling.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom React hook syncing state with localStorage, with SSR guards and error handling.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches and maps backend moderation queue proposals into UI-friendly moderation items.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and exposes ready/error state, resetting when src changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, proposals, roles, and geography data.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages chat messages and menu visibility for a secretary-style chat UI.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Provides a registry for navigation destinations with keyword lookup and action execution.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Temporarily stores proposal category in localStorage and exposes hooks to set/get it.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook to approve or reject proposals and invalidate related queries.",
  "frontend/src/hooks/useUSGeography.ts": "React Query hooks for fetching states, counties, and places with stable empty defaults and error handling.",
  "frontend/src/hooks/useWspBalance.ts": "Fetches the caller's WSP token balance using identity-scoped React Query keys.",
  "frontend/src/index.css": "Tailwind CSS theme and utility definitions implementing a teal-to-navy OKLCH design system.",
  "frontend/src/lib/contributionActionTypes.ts": "Defines canonical contribution action type constants and exports them for UI use.",
  "frontend/src/lib/earnedPointsToast.ts": "Shows contribution point toasts with action‑specific copy, a lock to avoid duplicates, and optional totals from cache.",
  "frontend/src/lib/formatProposalGeography.ts": "Formats proposal geography fields into readable labels, parts, and strings, including population parsing and fallback handling.",
  "frontend/src/lib/formatTokenAmount.ts": "Formats BigInt token amounts into display strings with optional decimal precision.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines Secretary navigation options, keyword-based lookup, and deep-link creation and parsing.",
  "frontend/src/lib/secretaryReportIssueData.ts": "Fetches geography details and top issues for reporting, combining backend lookups with friendly fallback messages.",
  "frontend/src/lib/secretaryTopIssuesMessaging.ts": "Retrieves and formats top issues for states, counties, and cities with clear user messaging and error handling.",
  "frontend/src/lib/uiCopy.ts": "Centralized UI copy strings for product text, navigation, actions, proposals, instance creation, and more.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Provides helpers to generate, validate, normalize, and parse WHISPER-prefixed geography-based instance names.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin panel page that checks authentication/admin status and displays moderation tools and logs.",
  "frontend/src/pages/admin/components/ContributionLogsSection.tsx": "Loads, filters, paginates, and displays admin contribution logs with actions for copying and navigation.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Renders a table of moderation items with status badges, category icons, and confirmation dialogs for moderation actions.",
  "frontend/src/pages/admin/components/TokenOperationsSection.tsx": "Admin UI for minting and burning WSP tokens with input validation and success/error feedback.",
  "frontend/src/pages/GeographyPage.tsx": "Displays a placeholder geography page with navigation back to home.",
  "frontend/src/pages/profile/components/StakingSection.tsx": "Frontend-only staking settings with localStorage persistence and basic amount validation.",
  "frontend/src/pages/ProfilePage.tsx": "Implements the user profile page with editing, image upload, profile saving, and contribution/points data handling.",
  "frontend/src/secretary/brain/FlowEngineBrain.ts": "Implements the flow-engine-based SecretaryBrain with intent handling, geography support, and navigation hooks.",
  "frontend/src/secretary/brain/hooks.ts": "Utility helpers for composing and filtering flow event listeners for the Secretary brain.",
  "frontend/src/secretary/brain/SecretaryBrain.ts": "Defines the SecretaryBrain interface for handling user input, actions, view models, and flow events.",
  "frontend/src/secretary/copy/secretaryCopy.ts": "Static English copy strings for Secretary flows including menu, discovery, reporting, and slot prompts.",
  "frontend/src/secretary/copy/secretaryPrompts.ts": "Prompt-building helpers for Secretary flows, generating dynamic messages for locations, issues, and slot filling.",
  "frontend/src/secretary/decisions/secretaryDecisions.ts": "Provides pure decision helpers for Secretary flow, determining next nodes based on context, geography, and input.",
  "frontend/src/secretary/flow/flows.ts": "Defines all Secretary flow nodes, their enter/exit behavior, and view-model outputs for the UI.",
  "frontend/src/secretary/flow/runner.ts": "Implements the state machine that processes actions, transitions between nodes, and emits flow events.",
  "frontend/src/secretary/flow/types.ts": "Declares core flow-engine types including nodes, transitions, context, actions, and view models.",
  "frontend/src/secretary/intent/flowRegistry.ts": "Maps intents to their slot requirements and defines navigation hooks for intent completion.",
  "frontend/src/secretary/intent/flowRunner.ts": "Runs slot-filling for intents, generating prompts, updating slots, and triggering completion behavior.",
  "frontend/src/secretary/intent/geographyLookup.ts": "Performs backend-powered free-text US geography resolution, returning matched state, county, or place.",
  "frontend/src/secretary/intent/geographyNlp.ts": "Client-side text matching helpers to detect states, counties, and places from free text and extract the most specific geography.",
  "frontend/src/secretary/intent/index.ts": "Barrel file exporting all intent, flow, repair, and geography lookup utilities.",
  "frontend/src/secretary/intent/intentClassifier.ts": "Rule-based classifier mapping normalized user text to predefined intents via keyword patterns.",
  "frontend/src/secretary/intent/repair.ts": "Detects correction cues in user text and identifies which slot to repair, then clears dependent slots.",
  "frontend/src/secretary/intent/slotState.ts": "Utilities for getting, setting, clearing, and checking slots, including dependent-slot reset logic.",
  "frontend/src/secretary/intent/types.ts": "Type definitions for intents, slots, slot bags, and intent context used across the Secretary system.",
  "frontend/src/secretary/observability/secretaryTrace.ts": "In-memory tracing utility for recording and querying small debug event histories.",
  "frontend/src/secretary/state/secretaryContext.ts": "Manages the full Secretary conversation context and provides reset and message-handling helpers.",
  "frontend/src/secretary/ui/secretaryViewModel.ts": "Converts flow node models into UI-ready view instructions and exposes icon lookup.",
  "frontend/src/utils/assetUrl.ts": "Resolves asset and navigation paths correctly under variable base paths using Vite env settings.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Implements custom-event-based navigation signaling from Secretary flows to project views.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters including hash-based routing and session persistence.",
  "frontend/src/utils/userFacingError.ts": "Provides a function that normalizes various backend error messages into concise, user-friendly English strings. It maps known patterns for authorization, geography, proposals, tasks, contributions, and token operations.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, animations, and container settings using CSS variables. Includes plugins for animations and typography.",
  "project_state.json": "Defines the current project state for Phase 3 WSP token integration, listing existing features, pending feature requests, and architectural notes. Tracks the evolution of WSP tokenization, governance stubs, and UI updates."
}