{
  "backend/main.mo": "Defines actor with mixin-based storage and authorization plus extensive U.S. geography, proposal, and profile data types.",
  "feature_evidence.json": "Report linking implemented features to source files, components, test IDs, and confidence for audit tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend architecture docs, hooks, components, and configuration files.",
  "frontend/docs/ARCHITECTURE.md": "Explains Whisper’s installation hierarchy, ICP canister strategy, and modular subsystem architecture.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Spec for storing jurisdiction-level complaint categories in stable memory for Secretary suggestions.",
  "frontend/docs/DEPLOYMENT.md": "Guide for deploying Whisper to ICP, covering prerequisites, config, workflows, and best practices.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes describing homepage UX changes including hero image, overlay, CTA styling, contrast fixes, and typography.",
  "frontend/docs/PHASED_PLAN.md": "Outlines phased development of Whisper from architecture groundwork to single-installation prototype and future multi-installation escalation features with clear deliverables and non-goals.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Describes the registry pattern enabling features to register navigable destinations for the Secretary assistant via actions, keywords, and deep links.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Provides a detailed manual smoke test for instance creation, moderation, issue projects, task management, and regression checks across UI features.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Supplies a focused QA checklist validating regression fixes including logo rendering, hover colors, profile loading, and navigation behavior.",
  "frontend/docs/STYLE_GUIDE.md": "Defines Whisper's visual design system including colors, typography, layout principles, and accessibility-focused styling guidance.",
  "frontend/index.css": "Empty stylesheet placeholder for global CSS.",
  "frontend/index.html": "Base HTML shell setting up root containers and loading the main frontend script.",
  "frontend/public/whisper-logo-teal.svg": "SVG asset containing a teal circular Whisper logo with stylized white markings.",
  "frontend/src/App.tsx": "Main application component wiring routing, Secretary navigation registry, lazy-loaded pages, and UI behavior including popstate handling and feature registration.",
  "frontend/src/components/common/HomeHeader.tsx": "Header component handling logo display, navigation, mobile menu, login, and admin link visibility.",
  "frontend/src/components/common/IconBubble.tsx": "Rounded icon container with size and color variants.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Spinner with optional label and size presets for loading states.",
  "frontend/src/components/common/LoginButton.tsx": "Login/logout button that integrates with Internet Identity and shows appropriate icons and states.",
  "frontend/src/components/common/UserProfileMenu.tsx": "User menu showing avatar, profile link, and logout, with profile image/initials handling.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form card for creating an instance, managing geography selection, name validation, and proposal submission.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "County dropdown populated by API, with loading and error handling.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Place dropdown filtered by county with loading and error handling.",
  "frontend/src/components/create-instance/SelectState.tsx": "State selector loading all states and supporting disabled and error states.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing issue project details with overview and tasks tabs, including status, category, and geography info.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Task management UI allowing creation and status updates of tasks tied to a proposal, with loading and error handling.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog displaying detailed proposal information and optionally opening its issue project view using live data.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Main proposals list with loading, error, refresh, and navigation handling, opening proposal detail dialogs.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "UI card prompting users to open the Secretary feature with dismiss and action controls.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Searchable typeahead component filtering and selecting location options with keyboard navigation.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Implements a multi-step secretary chat widget handling discovery and issue-report flows with geography lookups, suggestions, and message management.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Renders the SecretaryWidget into a portal container mounted in the document body.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Fetches and updates the caller’s user profile using identity-scoped query keys.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Retrieves complaint suggestions and categories based on hierarchy level and search term using backend actor calls.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Provides hooks to check instance-name availability and submit new instance proposals with validation and error handling.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the current SPA path and updates it on popstate events for navigation highlighting.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value to delay updates such as API calls.",
  "frontend/src/hooks/useDeleteProposal.ts": "Deletes a proposal via backend actor and invalidates related queries on success.",
  "frontend/src/hooks/useHideProposal.ts": "Hides a proposal through the backend actor and refreshes moderation and proposal queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login, stored identity loading, and exposes identity and login state via context.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Provides React Query hooks for fetching, creating, and updating tasks tied to a proposal with optimistic cache updates.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook syncing React state with localStorage while handling SSR safety and JSON parsing.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches the admin moderation queue and maps proposals into UI-friendly moderation item objects.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and exposes ready and error state with automatic resets on source changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for parent checks, fetching proposals, and checking admin status via the backend actor.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages simple chat-style state between user and assistant messages with menu visibility control.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Registry for navigation destinations supporting keyword search and triggering associated actions.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Temporarily stores and retrieves proposal category in localStorage and invalidates related queries.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook to update proposal status with validation and UI refresh via query invalidation.",
  "frontend/src/hooks/useUSGeography.ts": "Provides React Query hooks for fetching states, counties, and places with graceful handling of empty results.",
  "frontend/src/index.css": "Tailwind setup defining light/dark OKLCH color tokens and utility classes for layout, hero sections, and visual effects.",
  "frontend/src/lib/formatProposalGeography.ts": "Helpers to label geography levels, format population, extract geography parts, and build display strings for proposal metadata.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines Secretary navigation options with keywords and provides keyword matching plus deep-link creation and parsing.",
  "frontend/src/lib/uiCopy.ts": "Centralized UI copy object providing text labels and messages for navigation, proposals, auth, and other app sections.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Utilities to generate, validate, normalize, and parse WHISPER-prefixed instance names based on geography level.",
  "frontend/src/main.tsx": "App entry point bootstrapping React, Internet Identity provider, React Query, and global styles.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin moderation page that checks admin access, loads moderation items, and handles approve, reject, hide, and delete actions with status feedback.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Renders a table of moderation items with status badges, icons, formatted dates, and confirmation dialogs for reject, hide, and delete actions.",
  "frontend/src/pages/GeographyPage.tsx": "Static page rendering geography placeholder content with header, back navigation, and styled card layout.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page allowing authenticated users to view and edit their name and avatar with upload, preview, and save logic.",
  "frontend/src/utils/assetUrl.ts": "Provides a helper to resolve asset URLs using the app’s base path safely.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Implements a custom window event system for signaling navigation to a Secretary-related project.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters across normal and hash-based routing.",
  "frontend/src/utils/userFacingError.ts": "Maps unknown or technical errors into safe user-facing messages while logging the original error.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins for the UI.",
  "project_state.json": "Project metadata defining current features, pending requests, and scope for UI and membership flow updates."
}