{
  "backend/main.mo": "Defines the canister’s data structures for users, contributions, governance, geography, and includes authorization and blob‑storage mixins with counters for IDs.",
  "feature_evidence.json": "Lists implemented features with associated source files, components, tests, and confidence metadata for development tracking.",
  "frontend-file-summaries.txt": "Contains prewritten one‑line summaries of various frontend files, describing their purpose and key behaviors.",
  "frontend/docs/ARCHITECTURE.md": "Explains Whisper’s architectural vision, hierarchical installation model, canister topology, and modular subsystem design.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Describes the complaint category suggestion system including backend storage structures and intended API integration.",
  "frontend/docs/DEPLOYMENT.md": "Provides deployment prerequisites, configuration steps, and instructions for launching Whisper on the ICP network.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Outlines homepage redesign updates covering hero section assets, contrast fixes, widget styling, and typography adjustments.",
  "frontend/docs/PHASED_PLAN.md": "Outlines the phased development plan for Whisper, detailing deliverables, non-goals, and scaling hooks from prototype to multi-installation architecture.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Describes the registry-based system for registering and navigating Secretary assistant destinations via options, keywords, and deep links.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Provides a full manual smoke test for proposal creation, moderation, issue reporting flows, task management, and regression checks.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Checklist for validating regression fixes and Secretary flow updates, including UI behavior, navigation, and base-path deployment.",
  "frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md": "Defines smoke tests for all Secretary assistant flows, covering menu behavior, discovery, issue reporting, keyword routing, and error recovery.",
  "frontend/docs/STYLE_GUIDE.md": "Visual style guide specifying Whisper’s design principles, color palette, typography, and accessibility rules.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry point defining root containers and loading the frontend application.",
  "frontend/public/whisper-logo-teal.svg": "SVG file containing the teal Whisper logo with circular motif and stylized inner shapes.",
  "frontend/src/App.tsx": "Defines the main app container handling routing, Secretary widget behavior, navigation registry setup, and lazy-loaded pages using React Query.",
  "frontend/src/components/common/EarnedPointsInlineBadge.tsx": "Renders a small inline badge showing earned contribution points, hidden for duplicates or zero points.",
  "frontend/src/components/common/HomeHeader.tsx": "Implements the main site header with navigation, authentication-aware menu items, and mobile menu handling.",
  "frontend/src/components/common/IconBubble.tsx": "Provides a styled circular icon wrapper with size and variant options.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Displays a spinner with an optional label for consistent loading UI across features.",
  "frontend/src/components/common/LoginButton.tsx": "Provides a login/logout button wired to Internet Identity with loading states and cache clearing.",
  "frontend/src/components/common/UserProfileMenu.tsx": "Shows a dropdown user menu with avatar, profile navigation, and logout functionality.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Implements the main UI flow for creating a new instance, including name generation, validation, geography selection, and proposal submission.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "Dropdown component for selecting a county based on a chosen state, handling loading and error states.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown for selecting a place within a county, loading data via useGetPlacesForCounty and handling errors or disabled states.",
  "frontend/src/components/create-instance/SelectState.tsx": "State selection dropdown that loads all states with useGetAllStates and handles loading and error states.",
  "frontend/src/components/issue-project/EvidenceUploadSection.tsx": "UI for uploading evidence files and descriptions, generating a referenceId, and logging contributions with earned‑points feedback.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing issue‑project details with tabs for overview, tasks, and evidence, loading proposal data and category info.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Task list and creation UI for issue projects, supporting task creation, status toggling, and contribution logging.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Proposal details dialog that loads live proposal data, displays geography and status, and can open the related issue‑project dialog.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Displays a list of proposals with loading, error, refresh handling, and opens a detail dialog including support for external navigation events.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "A dismissible UI card prompting users to open the Secretary assistant with a call-to-action button.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Provides a searchable typeahead input with keyboard navigation and selectable location options.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Main Secretary chat widget handling user input, speech-to-text, suggestions, typeahead selections, and brain-driven conversation flow.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Mounts the SecretaryWidget into an overlay portal and wires it to a FlowEngineBrain with geography and actor data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdminContributionLogs.ts": "Fetches paginated admin-only contribution logs using the backend actor and React Query.",
  "frontend/src/hooks/useAdminUserContributionLogs.ts": "Fetches admin-only contribution logs for a specific user principal with validation and pagination.",
  "frontend/src/hooks/useAdminWspTokenOperations.ts": "Provides admin-only WSP mint and burn mutation hooks with validation and query invalidation.",
  "frontend/src/hooks/useCallerContributionSummary.ts": "Loads the caller's contribution summary via React Query using actor and identity state for scoping.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Provides hooks to fetch and save the caller's user profile with identity‑scoped cache invalidation.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Fetches complaint category suggestions and full category lists by geography level with error handling and caching.",
  "frontend/src/hooks/useContributionEventLogger.ts": "Logs contribution events with deduping, error normalization, and immediate cache updates for earned‑points UI.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Checks instance name availability and submits new instance proposals with validation and cache invalidation.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the current SPA route path for navigation highlighting using popstate events.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced value hook to delay updates for actions like search input.",
  "frontend/src/hooks/useDeleteProposal.ts": "Deletes a proposal and invalidates moderation and proposal queries.",
  "frontend/src/hooks/useGovernanceProposals.ts": "Manages governance proposal listing, retrieval, creation, and voting with identity‑gated actions and cache updates.",
  "frontend/src/hooks/useHideProposal.ts": "Hides a proposal and invalidates moderation and proposal caches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout handling, and persistence using AuthClient.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Provides React Query hooks to fetch, create, and update tasks for a proposal with optimistic updates and error handling.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook that syncs React state with localStorage while handling SSR safety and JSON serialization.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches admin moderation queue items and maps proposals into moderation item objects with loading and error handling.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and returns readiness and error state, resetting when the source changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, admin checks, proposals, geography stubs, and related actor-backed data.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages secretary chat state, storing messages and menu visibility with helpers to add and reset messages.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Maintains a registry of navigable destinations with keyword lookup, registration, and navigation actions.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Stores and retrieves temporary issue project categories in localStorage and invalidates related queries.",
  "frontend/src/hooks/useSpeechToText.ts": "Provides browser speech‑to‑text integration with transcript updates, error handling, and start/stop controls.",
  "frontend/src/hooks/useStakingInfo.ts": "Fetches staking info for the current user using actor calls with identity‑scoped caching.",
  "frontend/src/hooks/useStakingMutations.ts": "Defines stake and unstake mutations that call backend methods and invalidate staking and balance queries.",
  "frontend/src/hooks/useSystemVoices.ts": "Hook that loads available browser speech synthesis voices and tracks loading/support state.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook that updates a proposal’s status and invalidates related queries on success.",
  "frontend/src/hooks/useUSGeography.ts": "Collection of React Query hooks that fetch states, counties, and places from the backend with safe empty-array fallbacks.",
  "frontend/src/hooks/useWspBalance.ts": "Hook that fetches the caller’s WSP token balance using identity-scoped query keys.",
  "frontend/src/index.css": "Global Tailwind-based styling defining light/dark themes, utilities, and layout helpers.",
  "frontend/src/lib/contributionActionTypes.ts": "Defines canonical contribution action type constants and exports them for UI usage.",
  "frontend/src/lib/earnedPointsToast.ts": "Utility to show deduplicated earned-points toasts with action-specific messaging and optional cached totals.",
  "frontend/src/lib/formatProposalGeography.ts": "Helpers to format proposal geography level, parts, population, and readable geography strings.",
  "frontend/src/lib/formatTokenAmount.ts": "Formats BigInt token amounts into display strings with optional decimal handling.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines Secretary navigation options, keyword matching, and deep-link creation/parsing utilities.",
  "frontend/src/lib/secretaryReportIssueData.ts": "Provides helpers to fetch geography details and top issues for reporting, currently returning placeholder data.",
  "frontend/src/lib/secretaryTopIssuesMessaging.ts": "Implements a messaging helper for retrieving and formatting top-issues data, using fallback messages until backend is available.",
  "frontend/src/lib/uiCopy.ts": "Centralized UI text definitions for product info, navigation, forms, and feature copy.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Generates, validates, normalizes, and parses WHISPER-prefixed instance names based on geography level.",
  "frontend/src/main.tsx": "Sets up React app root with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin page that checks authentication and admin status, then displays moderation items, token operations, and contribution logs.",
  "frontend/src/pages/admin/components/ContributionLogsSection.tsx": "Displays admin contribution logs with filtering, pagination, copy and navigation helpers, and loading/error states.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Renders a table of moderation items with status badges, category icons, and confirmable actions like approve, reject, hide, or delete.",
  "frontend/src/pages/admin/components/TokenOperationsSection.tsx": "Admin interface to mint or burn WSP tokens with input validation and success/error feedback.",
  "frontend/src/pages/GeographyPage.tsx": "Renders a placeholder geography page with header, navigation, and coming-soon message.",
  "frontend/src/pages/profile/components/CreateGovernanceProposalDialog.tsx": "Dialog for creating governance proposals with title/description inputs, auth checks, submission handling, and error feedback.",
  "frontend/src/pages/profile/components/GovernanceProposalDetailDialog.tsx": "Dialog showing proposal details, status, vote tallies, and vote controls with authentication and vote submission logic.",
  "frontend/src/pages/profile/components/GovernanceSection.tsx": "Renders a governance proposals list with loading, empty, and error states and opens dialogs for viewing or creating proposals.",
  "frontend/src/pages/profile/components/StakingSection.tsx": "Implements staking and unstaking controls with validation, balance checks, and mutation handling with UI feedback.",
  "frontend/src/pages/ProfilePage.tsx": "Implements user profile page with profile editing, image upload, contribution summary, and staking/governance sections.",
  "frontend/src/secretary/brain/FlowEngineBrain.ts": "Implements the SecretaryBrain using a flow engine, managing context, messages, navigation, slot filling, geography data, and listeners.",
  "frontend/src/secretary/brain/hooks.ts": "Provides utilities for composing, filtering, and logging flow event listeners.",
  "frontend/src/secretary/brain/SecretaryBrain.ts": "Defines the SecretaryBrain interface specifying methods for handling input, actions, events, context, and UI view models.",
  "frontend/src/secretary/copy/secretaryCopy.ts": "Contains static English copy used for Secretary prompts, menu text, slot prompts, and error messages.",
  "frontend/src/secretary/copy/secretaryPrompts.ts": "Builds dynamic text prompts for top issues, discovery results, slot filling, unknown input, and repair confirmations.",
  "frontend/src/secretary/decisions/secretaryDecisions.ts": "Defines pure branching logic for Secretary flows, including next-node decisions, input recovery, geography resolution, instance checks, and report-issue validation.",
  "frontend/src/secretary/flow/flows.ts": "Declares all conversation nodes and their view models for discovery, menu, and report-issue flows with associated enter behaviors.",
  "frontend/src/secretary/flow/runner.ts": "Implements the flow controller that executes transitions, manages context, triggers node lifecycle hooks, and notifies listeners.",
  "frontend/src/secretary/flow/types.ts": "Defines all core types for nodes, transitions, actions, context, and view models used in the Secretary flow engine.",
  "frontend/src/secretary/intent/flowRegistry.ts": "Registers intent-to-slot workflows, specifying required slots, order, and completion navigation behavior.",
  "frontend/src/secretary/intent/flowRunner.ts": "Provides helper logic for intent-driven slot filling, including missing-slot detection, slot updates, prompting, and completion handling.",
  "frontend/src/secretary/intent/geographyLookup.ts": "Performs backend-powered NLP geography lookup to extract state, county, or place from free text with fallback handling.",
  "frontend/src/secretary/intent/geographyNlp.ts": "Client-side text matchers to detect states, counties, and places and extract the most specific geography from free text.",
  "frontend/src/secretary/intent/index.ts": "Barrel file exporting all intent, flow, repair, geography, and type utilities.",
  "frontend/src/secretary/intent/intentClassifier.ts": "Rule-based classifier mapping normalized user text to supported intents using keyword patterns.",
  "frontend/src/secretary/intent/issueDescriptionNlp.ts": "Strips geography terms and connectors from user text to generate a cleaned issue description.",
  "frontend/src/secretary/intent/repair.ts": "Detects repair cues in messages, infers which slot is being corrected, and clears dependent slots.",
  "frontend/src/secretary/intent/slotState.ts": "Utility functions to get, set, clear, and check slot values, including dependent-slot clearing logic.",
  "frontend/src/secretary/intent/types.ts": "Defines Secretary intent types, slot names, slot structures, and intent context interfaces.",
  "frontend/src/secretary/observability/secretaryTrace.ts": "Lightweight tracing system for recording in-memory debug events with optional console output.",
  "frontend/src/secretary/state/secretaryContext.ts": "Manages conversation state, slot resets, message history, and flow-specific state for the Secretary.",
  "frontend/src/secretary/ui/secretaryViewModel.ts": "Transforms flow node models into UI render instructions and maps icon names for display.",
  "frontend/src/utils/assetUrl.ts": "Resolves static asset URLs and navigation paths using the app’s base URL.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Defines event-based API for signaling navigation to projects with optional metadata.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters with sessionStorage persistence and utilities to clear parameters.",
  "frontend/src/utils/userFacingError.ts": "Converts various backend and string errors into concise user-friendly English messages.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and content paths for the frontend.",
  "project_state.json": "Describes the project’s state, planned features, architecture notes, and known issues for the Whisper platform."
}