{
  "backend/main.mo": "Defines the main actor with access control, extensive US geography types, proposal types, and helpers for initializing empty geography structures.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected frontend files, components, test IDs, and confidence ratings.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files, documentation, hooks, and UI components across the project.",
  "frontend/docs/ARCHITECTURE.md": "Architecture document detailing Whisper’s vision, hierarchical installation model, canister mapping, and modular subsystems.",
  "frontend/docs/DEPLOYMENT.md": "Developer-focused guide for configuring, deploying, and upgrading Whisper on ICP with sample dfx setup.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes describing homepage redesign details including hero image implementation, contrast fixes, typography, spacing, and UI effects.",
  "frontend/docs/PHASED_PLAN.md": "Outlines multi-phase plan for building Whisper, detailing deliverables, non-goals, and scaling hooks from prototype to multi-installation system.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Describes the registry pattern for Secretary assistant navigation, enabling features to register destinations and routing behaviors.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Provides step-by-step smoke test procedures for verifying instance proposal creation and related follow-up actions like Issue Project tasks.",
  "frontend/docs/STYLE_GUIDE.md": "Defines Whisper’s visual design system including philosophy, color palette, typography, and usage guidelines.",
  "frontend/index.css": "Empty stylesheet placeholder for global CSS.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main application component handling navigation, state for feature sections, Secretary integration, and image preloading.",
  "frontend/src/components/common/HomeHeader.tsx": "Header component rendering the logo and a Get Started button with fixed positioning and styled visuals.",
  "frontend/src/components/common/IconBubble.tsx": "Reusable circular icon wrapper supporting size and color variants.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Shared spinner + label component used to show loading states with consistent styling.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Main form component for creating an instance proposal, handling name validation, geography selection, description input, and submission state.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "Dropdown component that loads and selects counties for a chosen state with loading and error handling.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown component for selecting a place within a county, including async loading and fallback UI.",
  "frontend/src/components/create-instance/SelectState.tsx": "Dropdown component that loads and selects U.S. states with error and loading handling.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing detailed information and tabs for an issue project, including geography, status, description, and tasks.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Task management tab allowing users to create tasks, view task lists, and toggle task completion for an issue project.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog displaying proposal details with admin moderation actions and an option to open the issue project view.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Displays proposals list with loading/error states and opens proposal details via dialog.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "Shows a dismissible card prompting users to try the Secretary assistant.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Implements the interactive Secretary chat widget with message handling and option matching.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Renders the Secretary widget into a dedicated overlay root using a React portal.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Provides hooks to check instance-name availability and submit new instance proposals with validation.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, persistence, and provides an authentication context.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Provides hooks to fetch, create, and update tasks linked to a proposal via backend actor.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom React hook that syncs state to localStorage with SSR guards and error handling.",
  "frontend/src/hooks/usePreloadedImage.ts": "React hook that preloads an image and returns ready/error status with console warnings.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for backend actions like checking parent relationships, fetching proposals, and admin status.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages secretary chat state, including messages, menu visibility, and reset/navigation helpers.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Registry for navigation destinations with keyword lookup, navigation actions, and registration helpers.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook to update a proposal’s status and invalidate related proposal queries.",
  "frontend/src/hooks/useUSGeography.ts": "React-query hooks for fetching US geography data (states, counties, places) with caching and error handling.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes, color tokens, utilities, and animations.",
  "frontend/src/lib/formatProposalGeography.ts": "Formats proposal geography into readable strings and provides labels for geography levels.",
  "frontend/src/lib/secretaryNavigation.ts": "Utility for deep link parsing/creation and secretary navigation options with keyword matching.",
  "frontend/src/main.tsx": "App entry initializing React, query client, identity provider, and global styles.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them to sessionStorage, and clear them when needed.",
  "frontend/src/utils/userFacingError.ts": "Converts unknown errors into friendly user messages while logging the original error for debugging.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, fonts, and plugins for the frontend.",
  "project_state.json": "Describes project state, existing features, new feature requests, and architectural notes for ongoing development."
}