{
  "backend/main.mo": "Defines actor with authorization mixin, extensive U.S. geography and proposal types, and helpers returning empty data structures.",
  "feature_evidence.json": "Lists feature evidence records linking UX changes to specific frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptions of key frontend files covering architecture docs, styles, components, hooks, and proposal UI logic.",
  "frontend/docs/ARCHITECTURE.md": "Explains Whisper’s architectural vision, hierarchical installations, ICP canister mapping, and modular subsystem design.",
  "frontend/docs/DEPLOYMENT.md": "Developer deployment guide with dfx configuration, upgrade workflow, cycle management, and best‑practice notes.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Details homepage redesign including new hero image, overlay, CTA contrast fixes, typography, spacing, and UI effects.",
  "frontend/docs/PHASED_PLAN.md": "Outlines phased development plan from architecture to multi‑installation support with deliverables, hooks, and non‑goals.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Explains how features register navigable destinations for the Secretary assistant via option buttons, keyword routing, and deep links.",
  "frontend/docs/STYLE_GUIDE.md": "Defines Whisper’s visual design system including color palette, typography, and accessibility-focused design principles.",
  "frontend/index.css": "Sets global Tailwind layers and defines light/dark theme CSS variables for colors, layout, and component styling.",
  "frontend/index.html": "Base HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Root application component managing layout, Secretary assistant behavior, navigation registry setup, and deep-link handling.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "UI flow for creating an instance, handling geographic selection, name generation, validation, and proposal submission.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog showing proposal details with loading/error states and admin moderation actions.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Lists all instance creation proposals with loading, error, and empty states, and opens proposal detail dialogs.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "UI card prompting users to try the AI Secretary with a dismiss button and start conversation action.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Floating chat widget enabling interaction with the Secretary assistant, handling messages, options, and chat state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Provides hooks to check instance name availability and submit instance creation proposals via the backend actor.",
  "frontend/src/hooks/useDebouncedValue.ts": "Debounces a changing value to delay updates, useful for throttling input-driven API calls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useLocalStorageState.ts": "Persists React state to localStorage with SSR safety and error handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of backend query hooks for relationships, proposals, single proposal retrieval, and admin status checks.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages Secretary chat state, messages, menu logic, and interpreting user selections or free-text input.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Provides a registry for navigation destinations with register, unregister, search, and trigger functions.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook to update a proposal’s status and invalidate related queries.",
  "frontend/src/hooks/useUSGeography.ts": "React-query hooks to fetch US states, counties, and places with error handling and caching.",
  "frontend/src/index.css": "Tailwind base styles and theme variables defining a high-contrast navy/teal design with utilities.",
  "frontend/src/lib/formatProposalGeography.ts": "Formats proposal geography into readable text and provides labels for geography levels.",
  "frontend/src/lib/secretaryNavigation.ts": "Parses and generates deep links and matches text keywords to navigation options.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, shadows, and animations.",
  "project_state.json": "Contains project metadata and requirements for updating the homepage hero image, adjusting overlay warmth, and fixing CTA button contrast and styling issues."
}