{
  "backend/main.mo": "Motoko backend actor defining geography models, proposals, storage mixins, and access control with various record types for US regions and user-related data.",
  "feature_evidence.json": "Feature evidence report placeholder with no features listed.",
  "frontend-file-summaries.txt": "Aggregated summaries of various frontend documentation and source files describing architecture, plans, deployment, styles, hooks, and components.",
  "frontend/docs/ARCHITECTURE.md": "Architecture document detailing Whisper’s vision, hierarchical installations, ICP canister mapping, and modular system design principles.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Specification for backend-stored jurisdiction-level complaint categories supporting AI Secretary suggestions.",
  "frontend/docs/DEPLOYMENT.md": "Deployment guide covering prerequisites, configuration, and steps for deploying Whisper to the Internet Computer.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes on homepage redesign including permanent hero text, asset details, overlay specs, and accessibility fixes.",
  "frontend/docs/PHASED_PLAN.md": "Phased development roadmap outlining multi-stage build plan from architecture to multi-installation support.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Documentation for the Secretary navigation registry enabling feature-level routing and destination registration.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Manual smoke test covering proposal creation, admin moderation, issue project workflow, task management, and regression checks.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Focused QA checklist validating regression fixes including logo rendering, hover colors, profile behavior, and navigation.",
  "frontend/docs/STYLE_GUIDE.md": "Visual style guide defining color palette, typography, and design principles for a civic-focused UI.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Basic HTML entry point mounting the app and loading main.tsx.",
  "frontend/public/whisper-logo-teal.svg": "SVG logo featuring a teal circular emblem with white icon elements.",
  "frontend/src/App.tsx": "Main app component handling SPA routing with lazy-loaded pages and a static home hero section.",
  "frontend/src/components/common/AppErrorBoundary.tsx": "React error boundary providing a user-friendly fallback with reload support and error details.",
  "frontend/src/components/common/HomeHeader.tsx": "Header component with logo handling, SPA navigation, admin link logic, mobile menu, and identity-based UI.",
  "frontend/src/components/common/IconBubble.tsx": "Reusable rounded icon container supporting size and color variants.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Spinner with optional label and size variants for consistent loading UI.",
  "frontend/src/components/common/LoginButton.tsx": "Authentication button handling login/logout state, UI copy, and loading behavior.",
  "frontend/src/components/common/UserProfileMenu.tsx": "Dropdown menu showing user avatar, profile navigation, and logout actions.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form card for creating an instance with name generation, geography selection, validation, and proposal submission.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "County dropdown that loads counties by state and handles selection and loading/error states.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Place dropdown that loads places by county and supports selection and error handling.",
  "frontend/src/components/create-instance/SelectState.tsx": "State selector that loads all states and handles selection and loading/error states.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog displaying detailed issue project info with tabs for overview and tasks, using geographic and status data.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Task management UI allowing users to create and toggle tasks for a proposal, using related task mutations and showing load/error states.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog showing detailed proposal info with live fetching, geography display, and optional auto-opening of the Issue Project dialog.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Section listing all proposals with loading/error handling, refresh support, and a detail dialog triggered manually or via navigation events.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "Dismissible card encouraging users to open the Secretary assistant with a prompt and button.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Searchable typeahead input for selecting geographic options with keyboard navigation and loading/empty states.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Main Secretary assistant widget managing chat, discovery flow, issue reporting, geographic selection, and instance availability/creation.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Portal component that mounts the Secretary widget into a dedicated overlay root in the DOM.",
  "frontend/src/hooks/useAccountDeletion.ts": "Provides mutations for users to request account deletion and admins to process them, with query invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the current identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Fetches and saves the caller's user profile with identity‑scoped caching and proper actor readiness handling.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Fetches complaint suggestions and all complaint categories based on geographic level and search terms.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Checks instance name availability and submits new instance proposals with validation and error handling.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the current SPA route path by listening to popstate events.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useDeleteProposal.ts": "Provides a mutation to delete proposals and invalidates related moderation and proposal queries.",
  "frontend/src/hooks/useHideProposal.ts": "Provides a mutation to hide proposals and invalidates related moderation and proposal queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing identity state and providing login and logout utilities.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Fetches tasks and provides mutations to create and update them with optimistic updates.",
  "frontend/src/hooks/useLocalStorageState.ts": "Persists React state to localStorage with SSR safety and JSON serialization.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches moderation items from the backend and maps proposals into a UI-friendly shape with loading states tied to actor initialization.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and returns simple ready/error state, resetting when the source changes.",
  "frontend/src/hooks/useQueries.ts": "Provides various backend query hooks for parent checks, proposal retrieval, and admin status, all gated on actor and identity readiness.",
  "frontend/src/hooks/useSecretaryAutoCreateInstance.ts": "Creates a new Whisper instance proposal based on geographic parameters and updates related caches on success.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages a simple user–assistant message history and menu visibility for the Secretary chat UI.",
  "frontend/src/hooks/useSecretaryGeography.ts": "Supplies Secretary-focused geography queries for states, counties, cities, top issues, and city-name search with caching.",
  "frontend/src/hooks/useSecretaryInstanceAvailability.ts": "Checks whether an instance name is already taken for given geography and bundles multi-level availability results.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Maintains a registry of navigable destinations with keyword search and execution callbacks.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Temporarily stores issue project categories in localStorage and invalidates relevant queries for UI updates.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook to update proposal status with validation and query invalidation on success.",
  "frontend/src/hooks/useUSGeography.ts": "React-query hooks for fetching US states, counties, and places with graceful empty-result handling and caching.",
  "frontend/src/index.css": "Tailwind CSS theme and utility definitions including color tokens, dark mode, hero styling, and UI effects.",
  "frontend/src/lib/formatProposalGeography.ts": "Helpers to format proposal geography labels, population, and display strings based on hierarchy level.",
  "frontend/src/lib/secretaryFriendlyMessages.ts": "Generates user-friendly Secretary messages based on geography, instance existence, and common issues.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines Secretary navigation options with keyword matching and utilities for deep-link creation and parsing.",
  "frontend/src/lib/uiCopy.ts": "Defines centralized UI text constants for product, hero, auth, secretary, and profile sections.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Provides utilities for generating, validating, and parsing Whisper-prefixed instance names based on geographic hierarchy.",
  "frontend/src/main.tsx": "Initializes the React app root and wraps it with query and identity providers.",
  "frontend/src/pages/admin/AdminDeletionRequestsPage.tsx": "Admin page to view and process account deletion requests with authentication and permission checks.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin moderation dashboard handling auth, access checks, and listing moderation items.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Renders a table of moderation items with status badges, category icons, and action confirmation dialogs.",
  "frontend/src/pages/GeographyPage.tsx": "Displays a placeholder geography page with header navigation and coming‑soon messaging.",
  "frontend/src/pages/profile/ProfileEditPage.tsx": "React page for editing a user profile, handling image upload, backend-synced fields, and locally stored fields with save/delete actions.",
  "frontend/src/pages/profile/profileLocalState.ts": "LocalStorage helpers for storing and retrieving profile fields not yet supported by the backend.",
  "frontend/src/pages/profile/ProfileViewPage.tsx": "React page displaying the user's profile, combining backend data with locally stored fields and providing navigation to edit mode.",
  "frontend/src/pages/ProfilePage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/utils/assetUrl.ts": "Resolves asset URLs using the app’s base path for safe deployment under nested routes.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Implements custom event-based navigation for secretary-to-project routing.",
  "frontend/src/utils/spaNavigate.ts": "PushState-based navigation helper that triggers SPA route changes.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters across query and hash routes.",
  "frontend/src/utils/userFacingError.ts": "Normalizes various error types into user-friendly messages with special handling for moderation and backend errors.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and container settings for the frontend.",
  "project_state.json": "Defines the project’s current state, including schema version, issues with Caffeine draft preview, and a new documentation-related feature request. Contains project metadata, known issues, and pending fix requirements."
}