{
  "backend/main.mo": "Defines Motoko actor with user profiles, contribution logging, governance structs, and social feed posts including instance-scoped storage.",
  "feature_evidence.json": "Evidence report linking a textarea feature addition to affected frontend files and components with high confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend architecture, styling, hooks, and component behaviors across the codebase.",
  "frontend/docs/ARCHITECTURE.md": "Explains Whisper’s architectural vision, installation hierarchy, canister mapping, and modular subsystem design for scalable ICP deployment.",
  "frontend/docs/ATOMIC_MILESTONES_FEED_ISSUES_SECRETARY.md": "Outlines milestone-based implementation plan for feed, civic issues, and Secretary integration with detailed frontend/backend scopes and tests.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Specifies backend category storage and location-based complaint suggestion structures for the Secretary assistant.",
  "frontend/docs/DEPLOYMENT.md": "Provides deployment instructions for Whisper including prerequisites, setup, and ICP deployment steps.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Documents homepage redesign details including hero section visuals, contrast fixes, typography, spacing, and UI accessibility changes.",
  "frontend/docs/PHASED_PLAN.md": "Outlines phased development for Whisper, detailing deliverables and non-goals for architecture, single-installation prototype, and upcoming multi-installation features.",
  "frontend/docs/RETRY_PROD_DEPLOYMENT_RUNBOOK.md": "Provides a checklist and steps for diagnosing and retrying failed production deployments.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Describes the navigation registry system enabling the Secretary assistant to route users to registered destinations.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Defines manual smoke tests for instance creation, moderation, task management, evidence uploads, regression fixes, and hyperlocal feed/issue/Secretary flows.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Lists regression smoke tests covering logo rendering, header styling, profile actor fixes, navigation, Secretary flows, and base-path deployment behavior.",
  "frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md": "Documents smoke tests for the Secretary assistant’s menu, discovery flow, issue reporting flows, keyword/deep link navigation, and recovery behavior.",
  "frontend/docs/STYLE_GUIDE.md": "Defines Whisper’s visual style, including design principles, color palette, typography, and usage guidelines.",
  "frontend/index.css": "Placeholder stylesheet with no content.",
  "frontend/index.html": "Basic HTML shell containing root mount points and loading the main frontend script.",
  "frontend/public/whisper-logo-teal.svg": "SVG file defining the teal Whisper logo with circular elements and white iconography.",
  "frontend/src/App.tsx": "Root app manages routing, secretary widget state, and lazy-loaded pages with React Query configuration.",
  "frontend/src/components/common/EarnedPointsInlineBadge.tsx": "Shows an inline badge for earned contribution points unless duplicate or zero points.",
  "frontend/src/components/common/HomeHeader.tsx": "Responsive site header with navigation, authentication-aware menus, and path-based active state handling.",
  "frontend/src/components/common/IconBubble.tsx": "Reusable circular icon container with size and color variants.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Shared spinner component with size and label options.",
  "frontend/src/components/common/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow with loading states and cache clearing.",
  "frontend/src/components/common/UserProfileMenu.tsx": "Dropdown showing user avatar, profile link, and logout, with profile image handling.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form card for proposing new geographic instances with auto-name generation and contribution logging.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "County dropdown that loads counties for a state and handles loading and error states.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown for selecting a place within a county, loading places via hook and handling errors and disabled states.",
  "frontend/src/components/create-instance/SelectState.tsx": "Dropdown for selecting a US state, loading all states via hook and showing errors or loading states.",
  "frontend/src/components/feed/FeedList.tsx": "Displays an infinite-scrolling feed of posts with loading, error, and empty states using IntersectionObserver.",
  "frontend/src/components/feed/FlagPostDialog.tsx": "Dialog allowing authenticated users to flag a post with an optional reason and submit via mutation.",
  "frontend/src/components/feed/PostCard.tsx": "Card showing a post preview, author info, and actions to view details or flag the post.",
  "frontend/src/components/feed/PostComposer.tsx": "Form for creating a post, handling authentication, content validation, and mutation submission.",
  "frontend/src/components/feed/PostDetailDialog.tsx": "Dialog showing full post details including author info, timestamps, and loading or error states.",
  "frontend/src/components/issue-project/EvidenceUploadSection.tsx": "Provides a UI for uploading evidence files with descriptions and logs a contribution event, handling duplicates and showing earned points.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Displays issue project details with tabs, related tasks, and actions like converting an issue to a task.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Shows and manages tasks for an issue project, allowing creation, status updates, and contribution logging.",
  "frontend/src/components/location/LocationAcquisitionCard.tsx": "Offers geolocation-based or manual location selection with clear fallback behavior and status messaging.",
  "frontend/src/components/location/LocationSelector.tsx": "Composable selector for state, county, and place that updates dependent dropdowns.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Displays full proposal details and can open an embedded Issue Project dialog, using live data when available.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Displays a list of proposals with loading, error, refresh, and detail dialog handling, including navigation-triggered auto‑opening. Manages proposal selection and integrates UI copy and toast errors.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "Renders a dismissible nudge card prompting users to open the Secretary feature. Includes icon, text, and an action button.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Provides a searchable typeahead input for selecting geographic options with keyboard navigation and loading/empty states. Calls onSelect when an option is chosen and resets the search term.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Implements the Secretary chat widget with text/textarea input, speech‑to‑text, geography typeahead integration, and FlowEngineBrain-driven interaction flow. Manages view model updates, scrolling, sending messages, and action handling.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Creates and mounts a SecretaryWidget into an overlay portal and initializes a FlowEngineBrain instance. Syncs geography data, actor updates, and open/close behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user’s Internet Identity and refetches dependent queries when the actor changes. Supports anonymous and authenticated actors with admin token initialization.",
  "frontend/src/hooks/useAdminContributionLogs.ts": "Fetches paginated admin contribution logs when the user is authorized. Uses the actor and restricts access via an isAdmin flag.",
  "frontend/src/hooks/useAdminFlaggedPosts.ts": "Fetches flagged posts for admins and provides mutations to clear flags or delete posts with proper cache invalidation. Shows user-facing toasts for success and error states.",
  "frontend/src/hooks/useAdminUserContributionLogs.ts": "Retrieves contribution logs for a specific user principal, restricted to admins. Converts the principal and queries via the backend actor.",
  "frontend/src/hooks/useAdminWspTokenOperations.ts": "Provides admin mint and burn WSP token mutations with input validation and balance/profile cache invalidation.",
  "frontend/src/hooks/useBrowserGeolocation.ts": "Wraps the browser geolocation API, exposing status, coordinates, errors, and reset functionality.",
  "frontend/src/hooks/useCallerContributionSummary.ts": "Fetches the caller's contribution summary using identity-scoped query keys with controlled loading behavior.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Loads and updates the caller's user profile with identity-scoped caching and mutation-driven invalidation.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Fetches complaint category suggestions or full lists by geography level with error handling and caching.",
  "frontend/src/hooks/useContributionEventLogger.ts": "Logs contribution events with deduping, user-friendly errors, and cache updates for contribution summaries.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Checks instance-name availability and submits new instance proposals with validation and cache invalidation.",
  "frontend/src/hooks/useCreatePost.ts": "Creates posts, invalidates related post queries, and surfaces success or user-friendly error toasts.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the app’s current route path using popstate listeners for SPA navigation updates.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useDeleteProposal.ts": "Deletes proposals and invalidates moderation and proposal caches on success.",
  "frontend/src/hooks/useFlagPost.ts": "Flags posts with backend validation, invalidates feed/post caches, and shows success or error toasts.",
  "frontend/src/hooks/useGovernanceProposals.ts": "Provides React Query hooks to list, fetch, create, and vote on governance proposals with identity and actor checks.",
  "frontend/src/hooks/useHideProposal.ts": "Mutation hook to hide a proposal and invalidate moderation and proposal queries.",
  "frontend/src/hooks/useInstanceFeed.ts": "Infinite query hook that loads paginated posts for an instance with error handling.",
  "frontend/src/hooks/useInstanceScopeLocation.ts": "Manages and persists selected location metadata in localStorage and restores it on mount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading, login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries backend to determine if the current caller is an admin.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Hooks to fetch, create, and update legacy project tasks with optimistic updates and error handling.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook for state synchronized with localStorage and safe for SSR.",
  "frontend/src/hooks/useLocationSelection.ts": "Manages hierarchical location selection and derives a canonical locationId and display name.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches admin moderation queue and maps proposals into moderation item objects.",
  "frontend/src/hooks/usePostDetail.ts": "Fetches a single post by ID with actor readiness checks and error mapping.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and exposes ready and error states, resetting on source change.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching proposals, geography data, complaint categories, and staking info from the actor with error handling.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages secretary chat state, storing messages, menu visibility, and providing functions to add messages or reset the chat.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Maintains a registry of navigable destinations with keyword lookup and actions for a secretary navigation system.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Provides mutation to temporarily store issue project categories in localStorage and a getter to read them.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements speech-to-text using the browser SpeechRecognition API, exposing listening state, transcript, and errors.",
  "frontend/src/hooks/useStakingInfo.ts": "Fetches staking info scoped to the current identity with React Query and returns loading and fetched states.",
  "frontend/src/hooks/useStakingMutations.ts": "Mutation hooks for staking and unstaking actions, with error handling and cache invalidation for staking and balance data.",
  "frontend/src/hooks/useSystemVoices.ts": "Loads system speech synthesis voices, tracking support and loading state.",
  "frontend/src/hooks/useTasks.ts": "Provides query and mutation hooks for listing, fetching, creating, and converting civic tasks with error handling and cache invalidation.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook to update a proposal’s status and invalidate related queries on success.",
  "frontend/src/hooks/useUserProfileByPrincipal.ts": "Fetches a user profile by principal with null-safe fallbacks and short caching.",
  "frontend/src/hooks/useUSGeography.ts": "Provides React Query hooks to fetch states, counties, and places from the backend with safe fallbacks and caching.",
  "frontend/src/hooks/useWspBalance.ts": "Retrieves the caller’s WSP token balance using identity-scoped query keys.",
  "frontend/src/index.css": "Tailwind CSS theme and utilities defining light/dark color tokens and custom UI helpers.",
  "frontend/src/lib/contributionActionTypes.ts": "Defines canonical contribution action type constants and exports them for UI use.",
  "frontend/src/lib/earnedPointsToast.ts": "Utility to show contribution-earned toasts with action-specific messaging and cache‑aware totals.",
  "frontend/src/lib/formatProposalGeography.ts": "Helpers to format proposal geography levels, population, and display strings.",
  "frontend/src/lib/formatTokenAmount.ts": "Formats BigInt token amounts into readable strings with configurable decimals.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines secretary navigation options and helpers to map text to navigation destinations and deep links.",
  "frontend/src/lib/secretaryReportIssueData.ts": "Provides helpers to fetch geography details and top issues, currently returning placeholder data due to unimplemented backend endpoints.",
  "frontend/src/lib/secretaryTopIssuesMessaging.ts": "Defines a helper class for formatting and retrieving top‑issues messages, returning default text until backend support exists.",
  "frontend/src/lib/uiCopy.ts": "Centralizes static UI copy for product text, labels, and messages across the frontend.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Implements generation, validation, normalization, and extraction utilities for WHISPER‑ prefixed instance names.",
  "frontend/src/main.tsx": "Initializes the React app root and wraps it with Internet Identity and React Query providers.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin moderation dashboard that checks admin access, loads moderation items, and provides handlers for approving, rejecting, hiding, and deleting proposals.",
  "frontend/src/pages/admin/components/ContributionLogsSection.tsx": "Displays paginated, filterable admin contribution logs with options to copy reference IDs and navigate to related issues.",
  "frontend/src/pages/admin/components/FlaggedPostsSection.tsx": "Shows flagged posts with pagination and allows admins to clear flags or delete posts using confirmation dialogs.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Renders a table of moderation items with badges, category icons, and actions for approving, rejecting, hiding, or deleting items.",
  "frontend/src/pages/admin/components/TokenOperationsSection.tsx": "Admin test interface for minting and burning WSP tokens with input validation and success/error feedback.",
  "frontend/src/pages/FeedPage.tsx": "Renders the community feed page, manages location selection, and generates/persists Whisper instance names based on user geography.",
  "frontend/src/pages/GeographyPage.tsx": "Displays a placeholder geography page with navigation back to home and basic UI layout.",
  "frontend/src/pages/profile/components/CreateGovernanceProposalDialog.tsx": "Dialog component for creating governance proposals with validation, authentication checks, and mutation submission states.",
  "frontend/src/pages/profile/components/GovernanceProposalDetailDialog.tsx": "Shows full proposal details, vote tallies, and voting controls with authentication and mutation handling.",
  "frontend/src/pages/profile/components/GovernanceSection.tsx": "Lists governance proposals with loading/empty/error states and opens dialogs for viewing details or creating new proposals.",
  "frontend/src/pages/profile/components/StakingSection.tsx": "Provides staking and unstaking controls with validation, balance checks, and mutation actions tied to user authentication.",
  "frontend/src/pages/ProfilePage.tsx": "Handles user profile display and editing, including identity, avatar upload, contribution data, and staking/governance sections.",
  "frontend/src/pages/tasks/TaskCreatePage.tsx": "Form page for creating a new task with validation, mutation submission, and navigation to the new task on success.",
  "frontend/src/pages/tasks/TaskDetailPage.tsx": "Displays task details, supports status changes and assignment actions, and handles navigation and validation for principal-based assignment.",
  "frontend/src/pages/tasks/TasksListPage.tsx": "Lists tasks for a location with loading/error states and supports navigation to create or view individual tasks.",
  "frontend/src/secretary/brain/FlowEngineBrain.ts": "Implements a flow-engine-powered SecretaryBrain handling intents, slot filling, geography data, and task-related actions.",
  "frontend/src/secretary/brain/hooks.ts": "Provides helper utilities to compose, filter, and log flow event listeners for the Secretary system.",
  "frontend/src/secretary/brain/SecretaryBrain.ts": "Defines the SecretaryBrain interface for handling input, actions, events, and exposing context and view model data.",
  "frontend/src/secretary/copy/secretaryCopy.ts": "Contains English UI text for the Secretary, including menu prompts, discovery flow, issue reporting, and fallback messages.",
  "frontend/src/secretary/copy/secretaryPrompts.ts": "Builds dynamic prompts for slot filling, category suggestions, discovery results, repair confirmations, and guided issue summaries.",
  "frontend/src/secretary/decisions/secretaryDecisions.ts": "Provides pure decision functions for Secretary flow branching, including next-node logic, geography resolution, instance checks, and validation rules.",
  "frontend/src/secretary/flow/flows.ts": "Defines all Secretary flow nodes, their enter behavior, and view models for menu, discovery, and report-issue steps.",
  "frontend/src/secretary/flow/runner.ts": "Implements the flow runner handling transitions, node lifecycle, view model retrieval, and provides a FlowRunner wrapper.",
  "frontend/src/secretary/flow/types.ts": "Declares core types for nodes, transitions, context, guided report drafts, and view models used throughout the flow engine.",
  "frontend/src/secretary/intent/flowRegistry.ts": "Maps intents to required slots, slot order, and completion actions, including task‑related intent flows.",
  "frontend/src/secretary/intent/flowRunner.ts": "Controls slot filling for intents, selecting next missing slots, generating prompts, and executing intent completion actions.",
  "frontend/src/secretary/intent/geographyLookup.ts": "Provides utilities for NLP‑based geography lookup and resolving state/county/place or location IDs from free text.",
  "frontend/src/secretary/intent/geographyNlp.ts": "Provides deterministic client-side matching of states, counties, and places in free text and extracts the most specific geography from it.",
  "frontend/src/secretary/intent/index.ts": "Barrel file exporting all intent classification, flow, slot, geography lookup, and task intent utilities.",
  "frontend/src/secretary/intent/intentClassifier.ts": "Rule-based classifier mapping normalized user text to intents for tasks, issues, and instances using keyword patterns.",
  "frontend/src/secretary/intent/issueDescriptionNlp.ts": "Removes detected geography terms and connectors from user text to derive a cleaned issue description.",
  "frontend/src/secretary/intent/repair.ts": "Detects repair cues in user text and identifies which slot is being corrected, including task-specific slots.",
  "frontend/src/secretary/intent/slotState.ts": "Manages slot values with getters, setters, clearing logic, dependency resets, and empty slot-bag creation.",
  "frontend/src/secretary/intent/taskExecutor.ts": "Dispatches task intents to create, find, or update tasks using backend actor helpers.",
  "frontend/src/secretary/intent/taskIntentActions.ts": "Implements create, find, and update task actions, calling backend APIs and returning user-facing messages.",
  "frontend/src/secretary/intent/taskSlotParsing.ts": "Provides helper functions to parse task-related fields from free text, including IDs, status, location IDs, titles, descriptions, and categories.",
  "frontend/src/secretary/intent/types.ts": "Defines Secretary intent types, slot names, and data structures for slot values and intent context.",
  "frontend/src/secretary/observability/secretaryTrace.ts": "Implements a lightweight tracing utility with an in-memory event buffer for debugging intent and slot operations.",
  "frontend/src/secretary/state/secretaryContext.ts": "Manages the Secretary conversation context, including initialization, resets, message handling, and slot clearing.",
  "frontend/src/secretary/ui/secretaryViewModel.ts": "Transforms flow node view models into UI-ready structures and exposes icon lookup logic.",
  "frontend/src/utils/assetUrl.ts": "Resolves asset and navigation URLs using the app’s base path for safe deployment under custom prefixes.",
  "frontend/src/utils/instanceScope.ts": "Stores and retrieves last-used location IDs and metadata in localStorage with validation and cleanup helpers.",
  "frontend/src/utils/profileImageUrl.ts": "Creates and revokes object URLs for profile image byte arrays for safe browser display.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Implements custom-event signaling for Secretary-triggered project navigation with optional metadata.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters across normal and hash-based routing.",
  "frontend/src/utils/userFacingError.ts": "Provides a function that maps various backend error strings to concise user-friendly messages across multiple domains like auth, geography, proposals, tasks, tokens, and staking.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, animations, and container settings, using CSS variables for theming.",
  "project_state.json": "Tracks project state for adding an issueDescription textarea to an issue form, including existing and pending feature requests."
}