{
  "backend/main.mo": "Motoko canister defining installations and proposals with queries for lookup and mutations for submitting and updating proposal status with strict status transition rules.",
  "feature_evidence.json": "Feature evidence report listing implemented UI features, related files, components, and test identifiers for proposals listing, details, and status updates.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file, including docs, hooks, and UI components.",
  "frontend/docs/ARCHITECTURE.md": "High-level architecture document outlining Whisper’s vision, installation hierarchy, canister topology, and modular subsystem design.",
  "frontend/docs/DEPLOYMENT.md": "Deployment guide covering dfx configuration, canister deployment steps, upgrade patterns, and cycle management.",
  "frontend/docs/PHASED_PLAN.md": "Phased roadmap describing deliverables, non-goals, and success criteria from initial architecture through multi-installation expansion.",
  "frontend/docs/STYLE_GUIDE.md": "Visual style guide defining design principles, color system, typography, and UI behavior for Whisper’s civic aesthetic.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app layout rendering header, proposals section, and create‑instance CTA with state toggles.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form card for creating instance proposals with validation, debounced name checks, and success handling.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog showing full proposal details with status update actions and loading/error states.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Lists all instance proposals with loading/error states and opens detail dialogs.",
  "frontend/src/hooks/useActor.ts": "Creates and caches authenticated or anonymous backend actors, refreshing dependent queries on change.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Hooks for checking instance-name availability and submitting proposals with error handling and cache invalidation.",
  "frontend/src/hooks/useDebouncedValue.ts": "Utility hook that returns a debounced version of any value for delayed reactions like API calls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider wrapping Dfinity AuthClient to load, manage, and clear Internet Identity along with login status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend calls to check parent-child relationships and fetch proposals or a single proposal.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "React Query mutation for updating a proposal’s status and invalidating related queries on success.",
  "frontend/src/index.css": "Tailwind and custom CSS variables defining theme colors, typography, and light/dark mode styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radius, fonts, shadows, and enabling plugins like typography and animations.",
  "project_state.json": "Project metadata describing architecture goals, design principles, and tracked features for the Whisper ICP platform."
}