{
  "backend/main.mo": "Defines core types for users, contributions, geography, and includes storage and authorization mixins in a single backend actor.",
  "feature_evidence.json": "Lists feature evidence reports with associated files, components, and test IDs for Secretary flows and geography suggestions.",
  "frontend-file-summaries.txt": "Provides short summaries of various frontend files including docs, hooks, components, and configuration.",
  "frontend/docs/ARCHITECTURE.md": "Architecture document outlining Whisper’s vision, hierarchical installations, ICP canister mapping, and modular subsystem design.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Specification for complaint category suggestion system including storage in backend/main.mo and location-based top issues mapping.",
  "frontend/docs/DEPLOYMENT.md": "Deployment guide for Whisper with prerequisites, dfx configuration, and deployment instructions.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes detailing homepage redesign including hero section assets, contrast fixes, and updated typography and spacing.",
  "frontend/docs/PHASED_PLAN.md": "Phased development plan outlining Whisper’s build stages from architecture through multi-installation expansion.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Explains how features register destinations and actions for Secretary navigation using a registry hook.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Provides a full manual smoke test for instance creation, moderation, issue project workflow, task management, and regression checks.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Outlines regression-focused smoke tests covering logo rendering, header styling, profile loading, navigation, geography suggestions, and Secretary flow behavior.",
  "frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md": "Details smoke tests for all Secretary assistant flows including menu, discovery, issue reporting, custom categories, keyword routing, and deep links.",
  "frontend/docs/STYLE_GUIDE.md": "Defines Whisper’s visual design system including color palettes, typography, accessibility rules, and style principles.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Basic HTML shell defining root divs and loading the main frontend script.",
  "frontend/public/whisper-logo-teal.svg": "SVG icon representing the teal Whisper logo with layered shapes.",
  "frontend/src/App.tsx": "Main app component managing routing state, Secretary widget behavior, and registration of navigation destinations.",
  "frontend/src/components/common/HomeHeader.tsx": "Header component with navigation, auth controls, and responsive mobile menu handling path changes manually.",
  "frontend/src/components/common/IconBubble.tsx": "Styled circular icon container supporting size and color variants.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Reusable spinner with optional label and size presets for loading states.",
  "frontend/src/components/common/LoginButton.tsx": "Login/logout button integrating Internet Identity auth with loading state handling.",
  "frontend/src/components/common/UserProfileMenu.tsx": "User profile dropdown showing avatar, profile navigation, and logout functionality.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form card for creating an instance, including name generation, geographic selection, validation, and proposal submission.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "Dropdown for selecting a county based on state, with loading and error handling.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown for selecting a place based on county, including loading and error states.",
  "frontend/src/components/create-instance/SelectState.tsx": "Dropdown for selecting a US state with fetched state data and error handling.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Displays a dialog with proposal details and tabs for overview and tasks, using category and geography helpers.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Provides task creation and status toggling for an issue project, including loading and error states.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Shows detailed proposal info with live data refresh and optionally opens the related Issue Project dialog.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Lists all proposals with loading and error handling and opens the proposal detail dialog on selection or navigation events.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "Renders a dismissible card prompting users to engage with the Secretary feature.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Implements a searchable typeahead input for selecting locations with keyboard navigation and loading states.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Interactive chat-style widget that drives the FlowEngineBrain, manages geography/typeahead data, messages, and user input processing.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Creates a DOM portal for rendering the SecretaryWidget into an overlay root when open.",
  "frontend/src/hooks/useActor.ts": "Builds and caches a backend actor tied to the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdminContributionLogs.ts": "Fetches paginated admin-only contribution logs using the backend actor.",
  "frontend/src/hooks/useAdminUserContributionLogs.ts": "Fetches contribution logs for a specific user principal with admin-only access.",
  "frontend/src/hooks/useCallerContributionSummary.ts": "Loads the authenticated caller’s contribution summary, keyed to their principal.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Fetches and updates the current caller’s user profile with identity-scoped caching.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Retrieves secretary complaint category suggestions and all categories based on geographic hierarchy.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Validates and submits new instance proposals and checks name availability via backend calls.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the current SPA path by listening to popstate changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced version of a changing value for delayed actions.",
  "frontend/src/hooks/useDeleteProposal.ts": "Deletes a proposal through the backend and invalidates related react-query caches.",
  "frontend/src/hooks/useHideProposal.ts": "Hides a proposal through the backend and refreshes relevant moderation and proposal queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Defines React Query hooks for fetching, creating, and updating proposal tasks with optimistic UI updates.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook that syncs a piece of state with localStorage while safely handling SSR.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches the admin moderation queue and maps proposals into UI-ready moderation items.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and exposes ready and error state, resetting when the source changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and updating user profiles, proposals, admin status, and geographic data.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages chat-style message state and menu visibility for the secretary UI component.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Implements a registry for navigation destinations with keyword lookup and action execution.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Provides temporary client-side storage and mutations for setting and retrieving issue project categories.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "React Query mutation hook that updates a proposal's status via backend and invalidates related queries on success.",
  "frontend/src/hooks/useUSGeography.ts": "React Query hooks for fetching states, counties, and places with error-tolerant empty-array defaults.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light/dark theme tokens and utility classes including hero, hover effects, and overlays.",
  "frontend/src/lib/formatProposalGeography.ts": "Helpers to label, format, and stringify proposal geography data including level, population, and location parts.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines Secretary navigation options with keyword matching and utilities for creating and parsing deep links.",
  "frontend/src/lib/secretaryReportIssueData.ts": "Fetches geography details and top issues from backend and combines them into structured results for reporting flows.",
  "frontend/src/lib/secretaryTopIssuesMessaging.ts": "Class that fetches top issues for states, counties, or cities and formats user-facing messages with fallbacks.",
  "frontend/src/lib/uiCopy.ts": "Centralized UI text constants for product, navigation, proposals, authentication, and other interface sections.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Generates, validates, normalizes, and parses WHISPER-prefixed instance names based on US geography levels.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Shows admin-only moderation UI, handling authentication, admin checks, and loading/error states.",
  "frontend/src/pages/admin/components/ContributionLogsSection.tsx": "Admin section for viewing global or user-specific contribution logs with pagination, search, and error handling.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Displays a list of moderation items with status badges, icons, and action dialogs for review operations.",
  "frontend/src/pages/GeographyPage.tsx": "Displays a placeholder geography page with a header, back navigation, and coming-soon content.",
  "frontend/src/pages/ProfilePage.tsx": "Renders the user profile page with login state, profile editing, image upload, and save/logout actions.",
  "frontend/src/secretary/brain/FlowEngineBrain.ts": "Implements the SecretaryBrain using a flow engine, handling intents, slots, geography lookup, navigation, and flow event listeners.",
  "frontend/src/secretary/brain/hooks.ts": "Provides utilities to compose, filter, combine, and log flow event listeners.",
  "frontend/src/secretary/brain/SecretaryBrain.ts": "Defines the SecretaryBrain interface for handling user input, actions, messages, navigation, and context exposure.",
  "frontend/src/secretary/copy/secretaryCopy.ts": "Holds static English copy strings for prompts, menus, error messages, and flow text used by the Secretary UI.",
  "frontend/src/secretary/copy/secretaryPrompts.ts": "Generates dynamic prompt strings for top issues, discovery results, slot prompts, and repair confirmations.",
  "frontend/src/secretary/decisions/secretaryDecisions.ts": "Contains pure decision logic for flow branching, geography selection, issue reporting, and unknown input handling.",
  "frontend/src/secretary/flow/flows.ts": "Defines all Secretary flow nodes, their onEnter behavior, and the view models for menu, discovery, and report issue flows.",
  "frontend/src/secretary/flow/runner.ts": "Implements the main flow controller that handles actions, transitions between nodes, emits events, and produces node view models.",
  "frontend/src/secretary/flow/types.ts": "Defines core flow types including node IDs, actions, transitions, context state, view models, and event listeners.",
  "frontend/src/secretary/intent/flowRegistry.ts": "Maps each intent to its required/optional slots and slot order, with support for a navigation handler.",
  "frontend/src/secretary/intent/flowRunner.ts": "Provides logic for determining missing slots, filling slots, producing prompts, and executing intent completion actions.",
  "frontend/src/secretary/intent/geographyLookup.ts": "Performs backend-assisted lookup of state, county, and place from free text, returning the most specific match.",
  "frontend/src/secretary/intent/geographyNlp.ts": "Contains deterministic string-matching helpers to extract state, county, and place from text using provided geography lists.",
  "frontend/src/secretary/intent/index.ts": "Barrel export exposing all intent and slot management utilities, geography lookup, and repair helpers.",
  "frontend/src/secretary/intent/intentClassifier.ts": "Rule-based classifier that maps normalized user text to intents like reporting issues or finding instances.",
  "frontend/src/secretary/intent/repair.ts": "Detects correction cues in user text, identifies which slot to repair, and applies slot clearing logic.",
  "frontend/src/secretary/intent/slotState.ts": "Utility functions for reading, writing, clearing, and validating Secretary intent slots, including dependent-slot resets and creating empty slot bags.",
  "frontend/src/secretary/intent/types.ts": "Type definitions for Secretary intents, slot names, slot value structures, and intent context.",
  "frontend/src/secretary/observability/secretaryTrace.ts": "In-memory tracing utility that records recent Secretary events with optional console logging.",
  "frontend/src/secretary/state/secretaryContext.ts": "Manages the Secretary conversation context, including initialization, resets, message handling, and slot resets with dependencies.",
  "frontend/src/secretary/ui/secretaryViewModel.ts": "Transforms node view models into UI-friendly structures and exposes a simple icon-name passthrough.",
  "frontend/src/utils/assetUrl.ts": "Resolves asset URLs using Vite's base path, normalizing slashes for consistent production and dev behavior.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Implements custom browser events to signal navigation from the Secretary to a project and provides listener setup/cleanup.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, persisting them in session storage, and clearing them.",
  "frontend/src/utils/userFacingError.ts": "Maps backend error messages to user-friendly strings for authorization, geography, proposal, tasks, and generic failures.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, fonts, animations, and plugin setup.",
  "project_state.json": "Metadata describing project state, tracked features, and requirements for Secretary smoke-test execution."
}