{
  "backend/main.mo": "Motoko actor defining user profiles, contribution logging, governance models, and social feed posts with instance-scoped storage primitives and authorization mixins.",
  "feature_evidence.json": "Feature evidence list mapping hierarchical location selector and Secretary UI work to specific frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend architecture, styles, hooks, components, and geography-driven instance creation features.",
  "frontend/docs/ARCHITECTURE.md": "High-level Whisper architecture outlining hierarchical installations, ICP canister mapping, scaling modules, and system design principles.",
  "frontend/docs/ATOMIC_MILESTONES_FEED_ISSUES_SECRETARY.md": "Sequential implementation milestones for feed, civic issues, and Secretary/map integration across frontend and backend.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Specification for complaint category suggestions including storage arrays in Motoko and location-based issue mapping.",
  "frontend/docs/DEPLOYMENT.md": "Deployment guide covering prerequisites, local development, production deployment, cycle management, and troubleshooting.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes on homepage redesign detailing hero imagery, contrast fixes, Secretary widget styling, and typography/spacing updates.",
  "frontend/docs/PHASED_PLAN.md": "Outlines phased development of Whisper from architecture groundwork to single-installation prototype and multi-installation escalation features, with clear deliverables and non-goals for each phase.",
  "frontend/docs/RETRY_PROD_DEPLOYMENT_RUNBOOK.md": "Provides a checklist and prerequisites for retrying failed production deployments and gathering diagnostics.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Explains the registry pattern for registering and navigating Secretary assistant destinations via options, free‑text routing, and deep links.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Manual smoke test covering instance creation, moderation, task management, evidence upload, regression fixes, and new feed/issue/Secretary features including mobile.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Regression smoke test checklist validating logo, header, profile, navigation, Secretary suggestion features, and base‑path deployment behavior.",
  "frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md": "Smoke tests for the modular Secretary flow engine, covering menu display, discovery, issue reporting flows, keyword/deep‑link navigation, and error recovery.",
  "frontend/docs/STYLE_GUIDE.md": "Whisper’s visual style guide defining design principles, color palette, typography, and usage rules for accessible, civic‑inspired UI design.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Base HTML file bootstrapping the Whisper frontend with root mounts and module script entrypoint.",
  "frontend/public/whisper-logo-teal.svg": "SVG asset containing the teal Whisper logo with circle and stylized directional paths.",
  "frontend/src/App.tsx": "Main application component managing routing, secretary UI behavior, lazy‑loaded pages, and task route parsing. It sets up react-query and listens to navigation events to update visible pages.",
  "frontend/src/components/common/EarnedPointsInlineBadge.tsx": "Displays a small inline badge showing earned points when contributions succeed, hidden for duplicates or zero points.",
  "frontend/src/components/common/HomeHeader.tsx": "Renders the top navigation header with routing, mobile menu handling, and user profile access, using client-side history updates.",
  "frontend/src/components/common/IconBubble.tsx": "Reusable circular icon container with size and color variants for consistent styled icon display.",
  "frontend/src/components/common/LoadingIndicator.tsx": "A shared spinner and optional text label component for loading states with configurable sizing.",
  "frontend/src/components/common/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow, login state, and cache clearing with optional icons and variants.",
  "frontend/src/components/common/UserProfileMenu.tsx": "Dropdown user menu showing profile info, profile navigation, and logout, including avatar generation from stored profile data.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form for proposing new Whisper instances with auto-generated names, validation, geography selection, contribution logging, and submission workflow.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "County dropdown tied to selected state, loading county data and handling errors, selection, and disabled states.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown that loads and displays places for a selected county, with loading and error states.",
  "frontend/src/components/create-instance/SelectState.tsx": "Dropdown for selecting a US state, fetching state data and handling loading and error conditions.",
  "frontend/src/components/feed/FeedList.tsx": "Displays a paginated instance feed with infinite scroll, plus loading, error, and empty states.",
  "frontend/src/components/feed/FlagPostDialog.tsx": "Dialog allowing authenticated users to flag a post with an optional reason, using a mutation API.",
  "frontend/src/components/feed/PostCard.tsx": "Card view of a post showing author info, preview content, and actions to view details or flag.",
  "frontend/src/components/feed/PostComposer.tsx": "Form for creating a post, optionally selecting an instance name, with authentication and validation.",
  "frontend/src/components/feed/PostDetailDialog.tsx": "Dialog showing full post details with author info, timestamps, loading and error handling.",
  "frontend/src/components/issue-project/EvidenceUploadSection.tsx": "Provides a UI for uploading evidence files, generating a stable referenceId, and logging a contribution event with inline and toast-based point feedback.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Displays detailed issue project info with tabs, related tasks, geography, and conversion options, including an embedded evidence upload section.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Shows and manages issue project tasks, allowing creation, status toggling, and contribution logging with earned-points feedback.",
  "frontend/src/components/location/LocationAcquisitionCard.tsx": "Provides geolocation-based or manual location selection with status feedback and optional confirmation.",
  "frontend/src/components/location/LocationSelector.tsx": "Renders cascading state, county, and place selectors using shared dropdown components.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Displays proposal details with live data, geography info, and an option to open the linked issue project dialog.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Displays a list of proposals with loading, error, refresh, and detail dialog handling, including integration with Secretary navigation events.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "Renders a dismissible card nudging users to open the Secretary assistant with a call-to-action button.",
  "frontend/src/components/secretary/SecretaryHierarchicalLocationSelector.tsx": "Provides a hierarchical state–county–place selector using existing location selection logic with a Continue action enabled when a valid location is chosen.",
  "frontend/src/components/secretary/SecretaryIssueCategorySelect.tsx": "A simple labeled dropdown component for selecting an issue category using shadcn Select UI elements.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Implements a searchable typeahead input with keyboard navigation, filtering, and option selection callbacks.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Main Secretary chat widget handling guided flows, text and speech input, geography selection, and dynamic UI based on the flow engine's view model.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Mounts the SecretaryWidget into an overlay portal, manages the FlowEngineBrain instance, and wires in geography data and navigation callbacks.",
  "frontend/src/hooks/useActor.ts": "Fetches and initializes an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useAdminContributionLogs.ts": "Fetches paginated admin contribution logs using the actor, restricted to admin users through an enabled flag.",
  "frontend/src/hooks/useAdminFlaggedPosts.ts": "Provides hooks for admins to fetch flagged posts, clear flags, and delete posts with automatic cache invalidation and toast feedback.",
  "frontend/src/hooks/useAdminUserContributionLogs.ts": "Fetches a user's contribution logs for admins, requiring a valid principal and admin flag.",
  "frontend/src/hooks/useAdminWspTokenOperations.ts": "Supplies admin-only hooks to mint or burn WSP tokens with input validation and related cache updates.",
  "frontend/src/hooks/useBrowserGeolocation.ts": "Wraps the browser Geolocation API, exposing status, coordinates, errors, and reset functionality.",
  "frontend/src/hooks/useCallerContributionSummary.ts": "Loads the logged-in user's contribution summary using their principal-scoped query key.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Fetches and saves the caller's user profile with identity-scoped caching and mutation support.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Fetches complaint category suggestions or full lists based on geography level with error handling and caching.",
  "frontend/src/hooks/useContributionEventLogger.ts": "Logs contribution events with deduplication, error normalization, reward mapping, and cache updates.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Checks instance name availability and submits instance proposals with validation and cache invalidation.",
  "frontend/src/hooks/useCreatePost.ts": "Creates posts for logged‑in users, handling backend errors and invalidating instance post queries.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the current SPA route using popstate events and normalizes it against the base URL.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a delay to reduce rapid updates.",
  "frontend/src/hooks/useDeleteProposal.ts": "Deletes a proposal via React Query and invalidates moderation and proposal caches.",
  "frontend/src/hooks/useFlagPost.ts": "Flags a post with a reason, handles errors, refreshes feed caches, and shows toast messages.",
  "frontend/src/hooks/useGovernanceProposals.ts": "Provides React Query hooks to list, fetch, create, and vote on governance proposals with identity checks.",
  "frontend/src/hooks/useHideProposal.ts": "Hides a proposal and refreshes related moderation and proposal queries.",
  "frontend/src/hooks/useInstanceFeed.ts": "Fetches paginated instance-specific posts using infinite querying and error handling.",
  "frontend/src/hooks/useInstanceScopeLocation.ts": "Persists and restores selected location metadata in localStorage and exposes clearing functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, identity loading, and session state management.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries whether the current caller is an admin, enabled once the actor is available.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Fetches, creates, and updates legacy proposal tasks with optimistic updates and error handling.",
  "frontend/src/hooks/useLocalStorageState.ts": "Stores React state in localStorage with SSR-safe guards for reading and writing.",
  "frontend/src/hooks/useLocationSelection.ts": "Manages hierarchical US location selection and derives a canonical locationId and display name.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches and maps backend moderation queue proposals into UI-ready moderation items using React Query.",
  "frontend/src/hooks/usePostDetail.ts": "Retrieves a single post by ID via React Query, handling backend errors with user-friendly messages.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and exposes ready/error state, resetting when the source changes.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple React Query hooks for fetching proposals, geography data, complaint categories, staking info, and posts from the backend.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages chat messages and menu visibility for an assistant-style chat interface.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Stores and manages navigable destinations with keyword search and action triggering.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Temporarily stores issue project categories in localStorage and exposes mutate/get helpers.",
  "frontend/src/hooks/useSpeechToText.ts": "Wraps browser speech recognition to provide live transcripts, errors, and listen controls.",
  "frontend/src/hooks/useStakingInfo.ts": "Fetches user-specific staking info with identity-scoped React Query keys.",
  "frontend/src/hooks/useStakingMutations.ts": "Provides stake and unstake mutations and invalidates related staking and balance queries.",
  "frontend/src/hooks/useSystemVoices.ts": "Loads system speech synthesis voices and exposes support and loading state.",
  "frontend/src/hooks/useTasks.ts": "Provides React Query hooks for listing, retrieving, creating, and converting tasks, with error handling and cache invalidation.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook to approve or reject proposals, validating inputs and invalidating related proposal queries on success.",
  "frontend/src/hooks/useUserProfileByPrincipal.ts": "Fetches a user's profile by principal with safe null fallbacks and 5‑minute caching.",
  "frontend/src/hooks/useUSGeography.ts": "Defines React Query hooks to load US states, counties, and places from the backend with stable caching and safe fallbacks.",
  "frontend/src/hooks/useWspBalance.ts": "Retrieves the caller’s WSP token balance using identity-scoped query keys and merged loading state.",
  "frontend/src/index.css": "Tailwind base and utility layers defining light/dark themes, colors, layout utilities, and custom UI effects.",
  "frontend/src/lib/contributionActionTypes.ts": "Exports canonical contribution action type constants and a list for UI filtering.",
  "frontend/src/lib/earnedPointsToast.ts": "Utility to show contribution-point toasts with action-specific messages, duplicate suppression, and optional cached total display.",
  "frontend/src/lib/formatProposalGeography.ts": "Provides helpers to label geography levels, format population and proposal geography fields, and produce readable geography strings.",
  "frontend/src/lib/formatTokenAmount.ts": "Formats BigInt token amounts into decimal strings with optional decimal places.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines secretary navigation options and utilities for keyword matching and deep link parsing/creation.",
  "frontend/src/lib/secretaryReportIssueData.ts": "Stubs async fetch helpers for geography details and top issues, returning placeholder responses until backend is implemented.",
  "frontend/src/lib/secretaryTopIssuesMessaging.ts": "Provides messaging helpers for retrieving and formatting top-issue data, currently returning fallback messages.",
  "frontend/src/lib/uiCopy.ts": "Centralized UI copy containing text strings for product, pages, and components.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Generates, validates, normalizes, and extracts WHISPER- prefixed instance names based on geography level.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and Internet Identity providers and renders the root component.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin dashboard for reviewing moderation items, approving or rejecting proposals, and managing flagged content.",
  "frontend/src/pages/admin/components/ContributionLogsSection.tsx": "Fetches and filters contribution logs for admins, offering navigation to related issues and pagination.",
  "frontend/src/pages/admin/components/FlaggedPostsSection.tsx": "Displays flagged posts for admins with options to clear flags or delete posts, including confirmation dialogs.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Renders a table of moderation items with status badges and admin actions such as approve, reject, hide, or delete.",
  "frontend/src/pages/admin/components/TokenOperationsSection.tsx": "Admin UI for minting and burning WSP tokens with input validation and success/error feedback.",
  "frontend/src/pages/FeedPage.tsx": "Feed page that manages location-based instance naming, restores persisted metadata, and renders community posts UI.",
  "frontend/src/pages/GeographyPage.tsx": "Displays a placeholder geography page with header, back navigation, and a coming‑soon message.",
  "frontend/src/pages/profile/components/CreateGovernanceProposalDialog.tsx": "Dialog for creating governance proposals with authentication checks, input validation, and submission handling.",
  "frontend/src/pages/profile/components/GovernanceProposalDetailDialog.tsx": "Displays full proposal details, vote tallies, and provides authenticated voting controls.",
  "frontend/src/pages/profile/components/GovernanceSection.tsx": "Lists governance proposals with loading/empty/error states and handles opening detail and creation dialogs.",
  "frontend/src/pages/profile/components/StakingSection.tsx": "Staking UI allowing users to stake/unstake WSP with validation, mutation calls, and balance checks.",
  "frontend/src/pages/ProfilePage.tsx": "Handles viewing and editing of the user profile, including image upload, contribution points, and token balances.",
  "frontend/src/pages/tasks/TaskCreatePage.tsx": "Form page for creating a task with validation and navigation to the new task on success.",
  "frontend/src/pages/tasks/TaskDetailPage.tsx": "Task detail view supporting status updates, self/admin assignment, and navigation back to the task list.",
  "frontend/src/pages/tasks/TasksListPage.tsx": "Lists tasks for a location with navigation to create or view individual tasks.",
  "frontend/src/secretary/brain/FlowEngineBrain.ts": "Flow-engine-based implementation of the SecretaryBrain handling intent classification, slot filling, navigation, and backend task actions.",
  "frontend/src/secretary/brain/hooks.ts": "Utility helpers for composing and filtering flow event listeners for the Secretary system.",
  "frontend/src/secretary/brain/SecretaryBrain.ts": "Interface defining the contract for SecretaryBrain behavior including input handling, view model retrieval, and listener management.",
  "frontend/src/secretary/copy/secretaryCopy.ts": "Centralized English copy for secretary menu, guided issue reporting, discovery flow, and fallback prompts.",
  "frontend/src/secretary/copy/secretaryPrompts.ts": "Provides functions to generate prompts for missing slots, category suggestions, confirmations, and guided report summaries, including task-related prompts.",
  "frontend/src/secretary/decisions/secretaryDecisions.ts": "Contains pure decision logic that determines flow branching, geography resolution, instance checks, and recovery handling.",
  "frontend/src/secretary/flow/flows.ts": "Defines all conversation flow nodes, their entry behavior, and UI view models, including guided report-issue steps and enhanced input controls.",
  "frontend/src/secretary/flow/runner.ts": "Implements the flow runner that processes actions, executes transitions, manages node lifecycle, and produces view models.",
  "frontend/src/secretary/flow/types.ts": "Declares core types for nodes, transitions, context, guided report drafts, and UI view models in the Secretary flow engine.",
  "frontend/src/secretary/intent/flowRegistry.ts": "Maps intents to required slots, slot order, and completion handlers, including task-related intent flows.",
  "frontend/src/secretary/intent/flowRunner.ts": "Implements slot-based flow execution for intents, including finding missing slots, generating prompts, filling slots, and running completion handlers.",
  "frontend/src/secretary/intent/geographyLookup.ts": "Provides async utilities to resolve state, county, and place from text via backend data and derive a location ID.",
  "frontend/src/secretary/intent/geographyNlp.ts": "Offers deterministic string-matching helpers to identify state, county, and place names in text and extract the most specific geography.",
  "frontend/src/secretary/intent/index.ts": "Barrel file re-exporting all intent, slot, flow, geography, and task utilities and types.",
  "frontend/src/secretary/intent/intentClassifier.ts": "Rule-based classifier mapping user text to intents using keyword and pattern checks, including task-related intents.",
  "frontend/src/secretary/intent/issueDescriptionNlp.ts": "Removes geography references and connectors from text to produce an issue description, with safeguards against over-stripping.",
  "frontend/src/secretary/intent/repair.ts": "Detects repair statements, infers which slot is being corrected, and clears dependent slots for re-entry.",
  "frontend/src/secretary/intent/slotState.ts": "Manages slot values including getting, setting, clearing, dependency clearing, and checking fill status, with task slot support.",
  "frontend/src/secretary/intent/taskExecutor.ts": "Routes task intents to the correct task action handlers and returns user-facing messages.",
  "frontend/src/secretary/intent/taskIntentActions.ts": "Implements async handlers for create, find, and update task intents, performing backend calls and returning user-facing messages. Handles validation, formatting, and error translation.",
  "frontend/src/secretary/intent/taskSlotParsing.ts": "Provides deterministic parsers for extracting task-related slots like IDs, status, location, title, description, and category from free text. Supports pattern matching and natural‑language heuristics.",
  "frontend/src/secretary/intent/types.ts": "Defines Secretary intent types, slot definitions, and slot bag structures used throughout the intent and flow system. Includes task management intent and slot extensions.",
  "frontend/src/secretary/observability/secretaryTrace.ts": "Implements a lightweight in-memory trace buffer for recording Secretary events with enable/disable controls. Supports querying, filtering, and clearing trace events.",
  "frontend/src/secretary/state/secretaryContext.ts": "Manages Secretary conversation state, including guided report drafts, slots, messages, and reset utilities. Provides helpers to mutate context without coupling to UI.",
  "frontend/src/secretary/ui/secretaryViewModel.ts": "Converts flow node view models into UI-ready render instructions and exposes icon lookup. Ensures consistent mapping of view model fields to UI behavior.",
  "frontend/src/utils/assetUrl.ts": "Resolves asset URLs and navigation paths relative to the app's base path, normalizing slashes for Vite deployments. Ensures safe asset and router path construction.",
  "frontend/src/utils/instanceScope.ts": "Stores and retrieves last-used location IDs and metadata in localStorage with validation and error handling. Provides utilities to clear stored location data.",
  "frontend/src/utils/profileImageUrl.ts": "Creates object URLs from profile image byte arrays and provides cleanup via URL revocation. Handles invalid or missing image data safely.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Implements custom event–based signaling for navigating to project pages from the Secretary. Supports listening, cleanup, and optional metadata like origin and proposal identifiers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash-based), persist them in sessionStorage, and clear them when needed.",
  "frontend/src/utils/userFacingError.ts": "Maps backend and string error messages to concise, user-friendly English error text.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Describes the project state and two existing features related to adding a hierarchical location selector to the Secretary flow."
}