{
  "backend/main.mo": "Defines the main canister actor with storage, authorization mixins, and extensive data types for user profiles, contributions, geography, and proposals.",
  "backend/migration.mo": "Provides a migration function that converts old contribution log state into the new structure while preserving log entries.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend documentation and source files used in the project.",
  "frontend/docs/ARCHITECTURE.md": "Architecture document outlining Whisper's vision, hierarchical installations, ICP canister mapping, and modular subsystem design.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Spec describing the complaint category suggestion system, including backend storage arrays and location-based issue mapping.",
  "frontend/docs/DEPLOYMENT.md": "Deployment guide with prerequisites, configuration, and instructions for deploying the system to ICP.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes detailing homepage redesign changes including hero assets, contrast fixes, typography, spacing, and Secretary UI adjustments.",
  "frontend/docs/PHASED_PLAN.md": "Phased development plan describing staged feature rollout from architecture to multi-installation support and escalation.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Documentation of the Secretary assistant’s navigation registry system for routing users to pages or actions.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Manual smoke test covering full instance creation, moderation, issue reporting, task management, and key UI regression checks.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Regression checklist validating logo rendering, header styling, profile loading, navigation, geography suggestions, Secretary flows, and base-path deployment.",
  "frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md": "Smoke test for Secretary widget covering menu behavior, discovery paths, issue reporting modes, keyword/deep-link navigation, recovery states, and back-to-menu flows.",
  "frontend/docs/STYLE_GUIDE.md": "Visual design guidelines defining Whisper’s color palette, typography, and accessibility rules for consistent civic-themed UI styling.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend CSS.",
  "frontend/index.html": "Base HTML file that mounts the app root and loads the main TypeScript module.",
  "frontend/public/whisper-logo-teal.svg": "Teal Whisper logo SVG containing circular icon and stylized internal shapes.",
  "frontend/src/App.tsx": "Main application wrapper handling routing, secretary interactions, lazy‑loaded pages, and navigation registry setup.",
  "frontend/src/components/common/HomeHeader.tsx": "Header component providing navigation, logo rendering, admin/user controls, and popstate-based client-side routing.",
  "frontend/src/components/common/IconBubble.tsx": "Renders a stylized circular icon container with size and color variants.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Displays a spinner with an optional label and configurable size.",
  "frontend/src/components/common/LoginButton.tsx": "Authentication button handling login/logout states with optional icons.",
  "frontend/src/components/common/UserProfileMenu.tsx": "User menu showing profile info, navigation to profile, and logout functionality.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form card for creating an instance with name generation, geo selection, validation, and proposal submission.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "County dropdown that loads counties for a state with error and loading handling.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Place dropdown that lists places for a county with error and loading states.",
  "frontend/src/components/create-instance/SelectState.tsx": "State selector loading all states with support for errors and disabled states.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing issue project details with tabs for overview and tasks, using proposal and category data.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Renders a task list for a proposal, with ability to create tasks and toggle completion using related hooks. Handles loading, errors, and form interactions with toast feedback.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Displays a dialog with full proposal details, fetching live data and optionally auto-opening an Issue Project sub-dialog. Shows geography info, status, description, and handles nested dialog behavior.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Shows a grid of proposals with loading, error, and empty states, and opens the detail dialog on selection. Listens for navigation events to auto-open a specific proposal.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "A dismissible UI card prompting users to try the Secretary widget, with title, description, and an action button.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Provides a searchable typeahead input for selecting geographic options with keyboard navigation and optional loading state.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Implements the main Secretary chat widget, wiring the FlowEngineBrain to UI, handling messages, actions, geography data, and suggestions. Manages input, scrolling, and state updates.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Creates a portal-backed mount point for the Secretary widget, ensuring it renders into an overlay root when open.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminContributionLogs.ts": "Fetches paginated admin contribution logs from the backend using the authenticated actor.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Fetches and caches the caller's user profile and provides a mutation to save profile updates.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Provides category suggestions and full category lists based on hierarchy level and search input.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Checks instance-name availability and submits new instance proposals with validation and cache invalidation.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks and updates the current route path based on browser navigation events.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useDeleteProposal.ts": "Deletes a proposal via the backend and invalidates related moderation and proposal queries.",
  "frontend/src/hooks/useHideProposal.ts": "Hides a proposal using the backend and refreshes moderation and proposal caches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout functions, and identity persistence.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Fetches, creates, and updates tasks for a proposal with optimistic UI updates and cache syncing.",
  "frontend/src/hooks/useLocalStorageState.ts": "Syncs a React state value with localStorage while handling SSR safely.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches admin moderation queue via React Query and maps proposals into UI-friendly ModerationItem objects.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and returns ready/error state with automatic reset on src changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, proposals, admin status, and location-based data.",
  "frontend/src/hooks/useSecretaryChat.ts": "Provides simple chat state management with message history and menu visibility controls.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Maintains a registry of navigable destinations with keyword lookup and action execution.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Stores and retrieves temporary client-side proposal category values and invalidates related queries.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook to update proposal status and invalidate proposal and moderation-related queries.",
  "frontend/src/hooks/useUSGeography.ts": "React Query hooks for fetching states, counties, and places with error handling and caching.",
  "frontend/src/index.css": "Global Tailwind CSS theme and utility definitions featuring OKLCH color variables and layout helpers.",
  "frontend/src/lib/formatProposalGeography.ts": "Utilities to format proposal geography data, including labels, population, structured parts, and display strings.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines Secretary navigation options with keyword matching and deep link helpers.",
  "frontend/src/lib/secretaryReportIssueData.ts": "Fetches geography details and top issues from the backend with combined error‑handled reporting utilities.",
  "frontend/src/lib/secretaryTopIssuesMessaging.ts": "Provides methods to retrieve and format top issues for states, counties, and cities with user-friendly messaging.",
  "frontend/src/lib/uiCopy.ts": "Centralized UI text copy for product, navigation, proposals, and other interface sections.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Generates, validates, normalizes, and parses WHISPER‑prefixed instance names based on geography level.",
  "frontend/src/main.tsx": "Application entry point initializing React, Internet Identity, and React Query providers.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin-only moderation dashboard handling authentication checks and rendering moderation items, logs, and error/loading states.",
  "frontend/src/pages/admin/components/ContributionLogsSection.tsx": "Admin UI section that fetches and paginates contribution logs with loading, error, and empty states.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Component rendering a table of moderation items with status badges, category icons, and action confirmation dialogs.",
  "frontend/src/pages/GeographyPage.tsx": "Renders the Geography page with header, navigation back button, and placeholder content for upcoming features.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page allowing authenticated users to view and edit their name and profile image with validation and save logic.",
  "frontend/src/secretary/brain/FlowEngineBrain.ts": "Flow engine–based implementation of SecretaryBrain managing intents, slots, navigation, geography data, and conversation context.",
  "frontend/src/secretary/brain/hooks.ts": "Utility functions for composing and filtering flow event listeners, including no-op and console logging variants.",
  "frontend/src/secretary/brain/SecretaryBrain.ts": "Interface defining the SecretaryBrain abstraction, including input handling, state access, view models, and navigation events.",
  "frontend/src/secretary/copy/secretaryCopy.ts": "Provides static English UI strings and templates for Secretary flows, including menu text, discovery prompts, issue-reporting copy, and slot-filling messages.",
  "frontend/src/secretary/copy/secretaryPrompts.ts": "Defines helper functions that generate contextualized prompt strings for issues, discovery results, slot-filling, and unknown-input responses.",
  "frontend/src/secretary/decisions/secretaryDecisions.ts": "Contains pure decision functions that choose next nodes, determine geography, check for existing instances, and validate report-issue progression.",
  "frontend/src/secretary/flow/flows.ts": "Declares data-driven node definitions for all Secretary conversation flows, including UI behavior, messages, and transitions between states.",
  "frontend/src/secretary/flow/runner.ts": "Implements the flow controller that executes transitions, updates context, emits events, and returns node view models while coordinating special node logic.",
  "frontend/src/secretary/flow/types.ts": "Defines core types for nodes, transitions, actions, context, and UI view models used throughout the Secretary flow engine.",
  "frontend/src/secretary/intent/flowRegistry.ts": "Maps intents to their required and optional slots and slot order, and exposes functions to access flow definitions and a navigation handler.",
  "frontend/src/secretary/intent/flowRunner.ts": "Implements slot-driven intent flow: finds missing slots, fills them, generates prompts, and triggers intent completion navigation.",
  "frontend/src/secretary/intent/geographyLookup.ts": "Performs backend-assisted state/county/place extraction from free text using NLP helpers and hierarchical matching.",
  "frontend/src/secretary/intent/geographyNlp.ts": "Provides deterministic text-matching utilities for identifying states, counties, and places in free text.",
  "frontend/src/secretary/intent/index.ts": "Barrel file exporting intent, flow, repair, and geography utilities and types.",
  "frontend/src/secretary/intent/intentClassifier.ts": "Rule-based classifier mapping user text to predefined intents using keyword heuristics.",
  "frontend/src/secretary/intent/repair.ts": "Detects correction messages and identifies which slot to repair, clearing affected slots.",
  "frontend/src/secretary/intent/slotState.ts": "Defines getters/setters for slot values, clearing logic, dependency resets, and empty slot bag creation.",
  "frontend/src/secretary/intent/types.ts": "Defines intent types, slot names, slot value structures, and intent context interfaces.",
  "frontend/src/secretary/observability/secretaryTrace.ts": "Lightweight tracing utility storing recent internal events in a ring buffer for debugging.",
  "frontend/src/secretary/state/secretaryContext.ts": "Maintains conversation context with helpers to reset, update messages, and clear slots or flow-specific state.",
  "frontend/src/secretary/ui/secretaryViewModel.ts": "Transforms flow node models into UI-ready view models and resolves icon names.",
  "frontend/src/utils/assetUrl.ts": "Resolves static asset URLs relative to Vite's base path with normalization.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Implements a custom browser event system for triggering and listening to project navigation actions from the Secretary flow.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing parameters.",
  "frontend/src/utils/userFacingError.ts": "Maps backend error messages to simplified, user-friendly English strings for UI display.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theming, color variables, animations, and plugin usage for the frontend.",
  "project_state.json": "Stores project metadata, feature requests, and current project status for the stable‑memory contribution log implementation effort."
}