{
  "backend/main.mo": "Defines the main canister actor with storage, authorization mixins, and extensive types for user profiles, contributions, rewards, and U.S. geography data.",
  "backend/migration.mo": "Migration module upgrading stored contribution data by adding centralized reward values and an awarded-contributions map.",
  "feature_evidence.json": "Feature report listing frontend files and components involved in logging contribution events and refreshing contribution summaries.",
  "frontend-file-summaries.txt": "Prewritten summaries describing many frontend files, hooks, components, and documents in the project.",
  "frontend/docs/ARCHITECTURE.md": "Architecture overview detailing Whisper’s hierarchical installation model, ICP canister mapping, and modular subsystem design.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Developer specification for the complaint category suggestion system including backend storage and location-based mappings.",
  "frontend/docs/DEPLOYMENT.md": "Deployment guide outlining prerequisites, configuration, and steps for deploying Whisper on ICP.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes documenting visual and UX updates to the homepage including hero section, contrast fixes, and typography changes.",
  "frontend/docs/PHASED_PLAN.md": "Outlines phased development of Whisper from foundational architecture to single‑installation prototype and future multi‑installation support, with deliverables, hooks, and non‑goals.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Describes the registry system for Secretary navigation, enabling destinations to register for option buttons, keyword routing, and deep links.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Provides a full manual smoke test for proposal creation, moderation, issue reporting, task management, and regression checks across UI flows.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Defines regression‑focused smoke tests covering logo rendering, styling fixes, profile loading, navigation, Secretary flows, and base‑path deployment.",
  "frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md": "Details smoke tests for all Secretary assistant flows including discovery, issue reporting, custom categories, keyword and deep‑link navigation, and recovery states.",
  "frontend/docs/STYLE_GUIDE.md": "Specifies Whisper’s visual design principles, color palette, typography, and accessibility guidelines for consistent civic‑themed styling.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend CSS.",
  "frontend/index.html": "HTML entry point defining app root containers and loading the main TypeScript bundle.",
  "frontend/public/whisper-logo-teal.svg": "SVG asset containing the teal Whisper logo with circular emblem and white icon elements.",
  "frontend/src/App.tsx": "Main app component managing routing, secretary navigation, lazy-loaded pages, and React Query setup.",
  "frontend/src/components/common/HomeHeader.tsx": "Responsive header with navigation, authentication-aware menus, and path-based active state handling.",
  "frontend/src/components/common/IconBubble.tsx": "Styled circular icon container supporting size and variant customization.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Reusable spinner with optional label and size variants for consistent loading UI.",
  "frontend/src/components/common/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow, loading states, and query cache clearing.",
  "frontend/src/components/common/UserProfileMenu.tsx": "User dropdown showing profile info, avatar, navigation to profile, and logout action.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form card for creating instance proposals, including geography selectors, name validation, and submission logic.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "County selector tied to selected state, fetching county data and handling loading and errors.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown for selecting a place within a county, loading places via hook and handling errors or missing county.",
  "frontend/src/components/create-instance/SelectState.tsx": "Dropdown for selecting a US state, loading list via hook and displaying errors or disabled states.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing issue project details with tabs for overview and tasks, including category and status info.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Task management tab allowing creation and completion toggling of tasks for an issue project.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog displaying detailed proposal info, fetching live data and optionally opening associated issue project details.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Section listing all proposals with loading, error, and empty states, and supporting navigation to detail dialogs.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "UI card prompting users to open secretary features, with dismiss and open actions.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "A searchable typeahead input component with keyboard navigation and dropdown filtering for selecting geographic options.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Main secretary chat widget integrating FlowEngineBrain, geography lookups, suggestions, and message handling with auto-scrolling and input controls.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Creates and mounts a portal container for rendering the SecretaryWidget into a dedicated DOM overlay root.",
  "frontend/src/hooks/useActor.ts": "Fetches and manages an authenticated or anonymous backend actor, invalidating related queries when identity changes.",
  "frontend/src/hooks/useAdminContributionLogs.ts": "Loads paginated admin contribution logs via the backend actor using React Query.",
  "frontend/src/hooks/useAdminUserContributionLogs.ts": "Fetches contribution logs for a specific user principal through admin APIs with validation and pagination.",
  "frontend/src/hooks/useCallerContributionSummary.ts": "Retrieves the current caller’s contribution summary keyed to their principal using React Query.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Gets and saves the caller’s user profile with identity-scoped caching and mutation-based invalidation.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Provides complaint category suggestions and full category lists per hierarchy level using backend geography methods.",
  "frontend/src/hooks/useContributionEventLogger.ts": "Wraps logContributionEvent with duplicate handling, error normalization, and automatic cache invalidation.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Provides hooks to check instance-name availability and submit validated instance proposals, handling errors, caching, and contribution logging.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the current SPA route path by listening to popstate events for navigation updates.",
  "frontend/src/hooks/useDebouncedValue.ts": "Debounces a value by a delay, updating only after inactivity to prevent rapid updates.",
  "frontend/src/hooks/useDeleteProposal.ts": "Adds a mutation for deleting proposals and invalidates moderation and proposal caches on success.",
  "frontend/src/hooks/useHideProposal.ts": "Adds a mutation for hiding proposals and refreshes moderation and proposal data after completion.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, loading stored identities and managing login, logout, and status.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Provides hooks to fetch tasks, create new tasks with optimistic updates and logging, and update task completion state with rollback support.",
  "frontend/src/hooks/useLocalStorageState.ts": "Stores state in localStorage with SSR guards, syncing changes automatically.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches and maps backend moderation queue proposals into UI-ready moderation items with loading control.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and exposes ready/error state, resetting when the source changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, proposals, admin status, issues, and geographic entities via the backend actor.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages secretary chat state including messages, menu visibility, and reset helpers.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Provides a registry for navigation destinations with keyword lookup, registration, and execution actions.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Implements temporary client‑side storage for proposal category assignment with React Query invalidation.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook for approving or rejecting proposals with validation and query invalidation.",
  "frontend/src/hooks/useUSGeography.ts": "React Query hooks for fetching states, counties, and places with robust empty/error handling and caching.",
  "frontend/src/index.css": "Tailwind CSS configuration defining light/dark themes, utility classes, and layout styling.",
  "frontend/src/lib/contributionActionTypes.ts": "Defines canonical contribution action type constants aligned with backend enums.",
  "frontend/src/lib/formatProposalGeography.ts": "Helpers to format proposal geography data including level labels, population formatting, and display strings.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines Secretary navigation options, keyword matching, and deep‑link creation/parsing utilities.",
  "frontend/src/lib/secretaryReportIssueData.ts": "Fetches geography info and top issues from the backend with fallback messages and combined reporting utilities.",
  "frontend/src/lib/secretaryTopIssuesMessaging.ts": "Provides formatted top‑issues messages for states, counties, and cities using backend lookups with error handling.",
  "frontend/src/lib/uiCopy.ts": "Centralized UI text strings for navigation, proposals, authentication, and other interface sections.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Generates, validates, and parses WHISPER‑prefixed instance names based on geography level.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin page that checks authentication/admin status and displays moderation items along with contribution logs.",
  "frontend/src/pages/admin/components/ContributionLogsSection.tsx": "Admin UI to view global or user-specific contribution logs with pagination, search, loading, and error states.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Renders a table of moderation items with status badges, category icons, and actions like approve, reject, hide, or delete.",
  "frontend/src/pages/GeographyPage.tsx": "Renders a placeholder geography page with static UI and navigation back to home.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits user profile data including name and image with backend persistence and authentication checks.",
  "frontend/src/secretary/brain/FlowEngineBrain.ts": "Implements the flow-engine-based SecretaryBrain, managing context, intents, slots, geography data, and flow navigation.",
  "frontend/src/secretary/brain/hooks.ts": "Utility helpers for composing and filtering flow event listeners, including no-op and console loggers.",
  "frontend/src/secretary/brain/SecretaryBrain.ts": "Defines the SecretaryBrain interface with methods for handling input, actions, context, listeners, and typeahead.",
  "frontend/src/secretary/copy/secretaryCopy.ts": "Static English copy for secretary flows covering menus, discovery, issue reporting, slot prompts, and navigation.",
  "frontend/src/secretary/copy/secretaryPrompts.ts": "Provides small helper functions to build formatted prompts and messages for Secretary flows, including issues lists, slot prompts, and discovery messages.",
  "frontend/src/secretary/decisions/secretaryDecisions.ts": "Implements pure decision logic for branching in the Secretary flow, such as selecting next nodes, handling unknown input, and determining geography or instance presence.",
  "frontend/src/secretary/flow/flows.ts": "Defines all conversational nodes and their UI models for the Secretary system, including menus, discovery steps, and issue-reporting flows.",
  "frontend/src/secretary/flow/runner.ts": "Controls flow execution by handling actions, transitioning between nodes, emitting events, and generating view models based on node definitions.",
  "frontend/src/secretary/flow/types.ts": "Declares core types for nodes, transitions, actions, context, and view models used across the Secretary flow engine.",
  "frontend/src/secretary/intent/flowRegistry.ts": "Maps intents to their required and optional slots, defines slot order, and provides registry and navigation handler utilities.",
  "frontend/src/secretary/intent/flowRunner.ts": "Manages slot filling for intents, determining missing slots, generating slot prompts, updating slot bags, and executing intent completion actions.",
  "frontend/src/secretary/intent/geographyLookup.ts": "Fetches states, counties, and places from the backend and performs free-text geography matching, returning the most specific match.",
  "frontend/src/secretary/intent/geographyNlp.ts": "Provides deterministic client-side text matching utilities to identify states, counties, and places from free text.",
  "frontend/src/secretary/intent/index.ts": "Barrel module exporting all intent, slot, repair, and geography lookup utilities.",
  "frontend/src/secretary/intent/intentClassifier.ts": "Rule-based intent classifier mapping normalized user text to predefined intents.",
  "frontend/src/secretary/intent/repair.ts": "Detects repair-like messages and identifies which slot to correct, then clears slots accordingly.",
  "frontend/src/secretary/intent/slotState.ts": "Manages slot state including getting, setting, clearing, and handling dependent slot resets.",
  "frontend/src/secretary/intent/types.ts": "Defines intent, slot, slot bag, and context-related TypeScript types for the Secretary system.",
  "frontend/src/secretary/observability/secretaryTrace.ts": "Lightweight tracing utility storing recent internal events for debugging.",
  "frontend/src/secretary/state/secretaryContext.ts": "Manages the Secretary conversation context including initialization, resets, and message handling.",
  "frontend/src/secretary/ui/secretaryViewModel.ts": "Transforms flow node view models into UI-ready structures and exposes icon name mapping.",
  "frontend/src/utils/assetUrl.ts": "Resolves asset and navigation URLs using the app’s base path to ensure correct linking.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Implements event-based navigation signaling between Secretary and the project UI.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, store them in sessionStorage, retrieve them, and clear them, supporting both query-string and hash-based routing.",
  "frontend/src/utils/userFacingError.ts": "Maps backend error messages to concise user-friendly messages for authorization, geography lookup, proposal, task, and connectivity errors.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color variables, animations, and plugin usage for the frontend.",
  "project_state.json": "Describes the project’s current phase, architecture notes, known issues, and lists existing and pending feature requests for contribution rewards and logging."
}