{
  "backend/main.mo": "Defines authorization mixin, extensive US geography and proposal types, and helper constructors for empty geography, state/county structures, and proposals.",
  "feature_evidence.json": "Declares a feature-evidence report linking a Secretary widget discoverability feature to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists pre‑generated summaries of many frontend documentation and source files, mainly describing architecture, styles, geography workflows, and React components.",
  "frontend/docs/ARCHITECTURE.md": "Explains Whisper’s architectural vision, hierarchical installations, ICP canister mapping, and modular subsystem design for future scalability.",
  "frontend/docs/DEPLOYMENT.md": "Provides developer-oriented deployment guidance for ICP, including dfx configuration, upgrade workflow, and cycle management practices.",
  "frontend/docs/PHASED_PLAN.md": "Outlines a phased development roadmap from architecture to multi‑installation support, specifying goals, deliverables, and non‑goals for each phase.",
  "frontend/docs/STYLE_GUIDE.md": "Details Whisper’s visual design system including color tokens, typography, accessibility rules, and UI styling principles conveying civic authority.",
  "frontend/index.css": "Defines Tailwind base layers and extensive CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/index.html": "Provides the root HTML structure and loads the main React entrypoint.",
  "frontend/src/App.tsx": "Main React app layout managing header actions, proposal visibility, secretary UI, and create-instance modal state.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form component for proposing new instances, handling geographic selection, auto-generated names, validation, and submission.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog showing full proposal details with admin actions to approve or reject and built-in loading and error states.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Displays the list of proposals with loading, error, and empty states, and opens the detail dialog for selected items.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "Small banner prompting users to try the Secretary assistant with open and dismiss callbacks.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Implements a chat widget UI that integrates with useSecretaryChat to display messages, handle option selections, and manage chat state and opening behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Provides hooks to check instance name availability and submit instance creation proposals, invalidating related queries on success.",
  "frontend/src/hooks/useDebouncedValue.ts": "Implements a debounced value hook that delays updates by a specified timeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing identity state, login flow, and exposing context to the app.",
  "frontend/src/hooks/useLocalStorageState.ts": "Provides a React state hook synchronized with localStorage with SSR safety guards.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for checking parent relationships, fetching proposals, getting a proposal, and checking admin status via the backend actor.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages chat state for the Secretary assistant, including messages, menu handling, and interpreting user input into actions.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook that updates a proposal’s status and invalidates related queries on success.",
  "frontend/src/hooks/useUSGeography.ts": "React Query hooks that fetch states, counties, and places from the backend with error handling and caching.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining the app’s color system, typography, and dark mode.",
  "frontend/src/lib/formatProposalGeography.ts": "Utility functions to format proposal geography into readable text and map hierarchy levels to labels.",
  "frontend/src/main.tsx": "App entry point that sets up React Query, Internet Identity, and renders the root component.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors from CSS variables, fonts, and plugins.",
  "project_state.json": "Project metadata describing architecture, constraints, known issues, and existing features for the Whisper platform."
}