{
  "backend/main.mo": "Defines the main canister with mixins for authorization and blob storage, plus extensive types for US geography, proposals, user profiles, and internal data structures.",
  "feature_evidence.json": "Lists feature evidence reports describing two frontend modifications with associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files including docs, hooks, components, and configuration.",
  "frontend/docs/ARCHITECTURE.md": "Architecture document defining Whisper’s vision, installation model, canister mapping, and modular subsystem design.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Spec describes backend storage of complaint categories in stable memory for AI Secretary suggestion logic.",
  "frontend/docs/DEPLOYMENT.md": "Provides deployment instructions for Whisper on ICP including prerequisites, configuration, and workflows.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Details homepage redesign requirements including permanent hero text, image assets, contrast fixes, and UI rules.",
  "frontend/docs/PHASED_PLAN.md": "Outlines the multi‑phase Whisper development plan from architectural foundation to multi‑installation support.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Explains the Secretary navigation registry system for registering and routing to frontend destinations.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Manual smoke test covering proposal creation, admin approval, issue project flow, task management, and regression checks.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Regression-focused QA checklist validating logo rendering, hover colors, profile flows, navigation, and base-path safety.",
  "frontend/docs/STYLE_GUIDE.md": "Design guidelines defining Whisper’s visual principles, color system, typography, and accessibility rules.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "HTML entry point mounting the app and loading the draft-preview blocker and main script.",
  "frontend/public/caffeine-draft-preview-blocker.js": "Script that detects Caffeine draft environments and blocks injected editor scripts to prevent load errors.",
  "frontend/public/whisper-logo-teal.svg": "Teal circular Whisper logo SVG with stylized white shapes.",
  "frontend/src/App.tsx": "Main app component handling client-side routing and rendering lazy-loaded pages with a hero home view.",
  "frontend/src/components/common/AppErrorBoundary.tsx": "React error boundary that displays a fallback UI, logs detailed errors, and handles reload/reset behavior.",
  "frontend/src/components/common/HomeHeader.tsx": "Responsive header with logo, navigation, admin link handling, mobile menu, and login integration using Internet Identity.",
  "frontend/src/components/common/IconBubble.tsx": "Styled circular icon wrapper supporting size and color variants.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Reusable spinner with optional label and size options.",
  "frontend/src/components/common/LoginButton.tsx": "Login/logout button wired to Internet Identity with loading state and query cache clearing.",
  "frontend/src/components/common/UserProfileMenu.tsx": "User dropdown showing avatar, profile navigation, and logout behavior with profile fetching.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form card for creating an instance with auto‑generated names, geographic selection, validation, and proposal submission.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "County dropdown that loads counties for a selected state with loading and error states.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Place dropdown that loads places for a selected county with loading and error handling.",
  "frontend/src/components/create-instance/SelectState.tsx": "State selector that loads all states and handles loading and error states.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing issue project details with overview and tasks tabs, using proposal data and category lookup.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Tasks tab allowing creation, listing, and status toggling of tasks for a proposal via task hooks.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog displaying proposal details with live data fetching and optional auto-opening of the issue project view.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Section listing all proposals with loading states, refresh controls, and navigation-triggered detail dialog opening.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "Dismissible nudge card prompting users to open the Secretary feature.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Typeahead search component filtering and selecting location options with keyboard navigation.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Main interactive Secretary chat widget managing discovery and issue-reporting flows with geography lookups and instance checks.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Renders the SecretaryWidget into a DOM portal targeting an overlay container.",
  "frontend/src/hooks/useAccountDeletion.ts": "Provides mutations for users to request account deletion and for admins to process those requests.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user's identity, invalidating related queries on changes.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Fetches and saves the current user's profile using identity-scoped query keys.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Fetches complaint suggestions and all complaint categories based on geography level via backend APIs.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Checks instance-name availability and submits new instance proposals with validation and error handling.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the current SPA route path and updates on browser navigation events.",
  "frontend/src/hooks/useDebouncedValue.ts": "Debounces a value over a delay to limit rapid updates such as while typing.",
  "frontend/src/hooks/useDeleteProposal.ts": "Mutation to delete a proposal and refresh related moderation and proposal data.",
  "frontend/src/hooks/useHideProposal.ts": "Mutation to hide a proposal and invalidate affected moderation and proposal queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for managing Internet Identity authentication, including loading, login, logout, and status tracking. Wraps AuthClient creation and exposes identity and login state.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Implements React Query hooks for fetching, creating, and updating project tasks via a backend actor. Includes optimistic updates and cache invalidation logic.",
  "frontend/src/hooks/useLocalStorageState.ts": "A small React hook that syncs state with localStorage with SSR safety. Reads and writes JSON values while handling errors gracefully.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches and maps backend moderation queue proposals into a UI-friendly moderation item list. Handles loading states tied to actor initialization.",
  "frontend/src/hooks/usePreloadedImage.ts": "Loads an image URL and tracks ready/error state, resetting when the source changes. Uses an Image object and synchronous load fallback.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for checking parent relationships, fetching proposals, retrieving single proposal details, and checking admin status. Integrates authentication and actor readiness into query enabling.",
  "frontend/src/hooks/useSecretaryAutoCreateInstance.ts": "Mutation hook that auto-creates a Whisper instance proposal based on geographic selection and canonical naming. Computes metadata, submits a proposal, handles failures, and invalidates related queries.",
  "frontend/src/hooks/useSecretaryChat.ts": "Simple stateful hook for a secretary chat UI, managing message history and menu visibility. Supports adding messages and resetting or returning to the menu.",
  "frontend/src/hooks/useSecretaryGeography.ts": "Provides React Query hooks for secretary endpoints to fetch states, counties, cities, top issues, and city search results by hierarchical IDs.",
  "frontend/src/hooks/useSecretaryInstanceAvailability.ts": "Checks availability of Whisper instances for given geography levels and aggregates multi-level availability.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Implements a registry for navigation destinations with register, unregister, lookup, and keyword search capabilities.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Stores and retrieves temporary issue project categories in localStorage and invalidates related queries on update.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Updates proposal status via backend and invalidates proposal and moderation queries after success.",
  "frontend/src/hooks/useUSGeography.ts": "Contains hooks to fetch states, counties, and places from the backend with graceful handling of empty results.",
  "frontend/src/index.css": "Defines global Tailwind-based theme variables, dark mode styles, layout utilities, and visual effects.",
  "frontend/src/lib/formatProposalGeography.ts": "Provides helpers to format geography labels, population, and proposal geography metadata into display-friendly strings.",
  "frontend/src/lib/secretaryFriendlyMessages.ts": "Builds friendly Assistant messages based on geography, instance existence, and top issues, plus helpers for founding/instance-found text.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines Secretary navigation options with keyword matching and deep-link creation/parsing utilities.",
  "frontend/src/lib/uiCopy.ts": "Centralizes all user-facing UI text for consistent messaging and easy localization.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Generates, validates, and normalizes Whisper instance names and computes canonical names based on geography.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/admin/AdminDeletionRequestsPage.tsx": "Admin interface to view and process account deletion requests with authentication, authorization, and mutation handling.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin moderation page handling authentication, admin access checks, and displaying moderation items with navigation actions.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Displays a table of moderation items with status badges, category icons, and confirmation dialogs for approve/reject/hide/delete actions.",
  "frontend/src/pages/GeographyPage.tsx": "Renders a geography placeholder page with navigation back to home and UI copy integration.",
  "frontend/src/pages/profile/ProfileEditPage.tsx": "Profile editing page supporting backend fields, local-only fields, image upload/preview, deletion requests, and saving profile changes.",
  "frontend/src/pages/profile/profileLocalState.ts": "Local storage helpers for storing and retrieving profile fields not yet supported by the backend.",
  "frontend/src/pages/profile/ProfileViewPage.tsx": "Profile display page showing user info, image, local-only fields, and navigation to edit mode.",
  "frontend/src/pages/ProfilePage.tsx": "Empty placeholder file for the profile page.",
  "frontend/src/utils/assetUrl.ts": "Utility resolving asset paths safely relative to the app's base URL.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Provides event-based navigation for directing the secretary flow to specific project pages.",
  "frontend/src/utils/spaNavigate.ts": "Simple SPA navigation helper using pushState and popstate events.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params (including hash routes), persisting them in sessionStorage, and clearing them from the URL or session.",
  "frontend/src/utils/userFacingError.ts": "Converts various error types into normalized user-friendly messages with special handling for moderation and runtime issues.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and theme settings for the frontend build.",
  "project_state.json": "Project metadata describing efforts to prevent Caffeine preview crashes by blocking injected draft-editor scripts and removing related dependencies."
}