{
  "backend/main.mo": "Defines actor with access control and comprehensive US geography, proposal, and installation data types plus initializers for empty geography structures.",
  "feature_evidence.json": "Feature evidence record describing a revert-to-Draft-38 task referencing App.tsx and related components.",
  "frontend-file-summaries.txt": "Lists summaries for various frontend files including docs, hooks, components, and configuration.",
  "frontend/docs/ARCHITECTURE.md": "Architecture document outlining Whisper’s vision, hierarchical installation model, ICP canister mapping, and modular subsystem design.",
  "frontend/docs/DEPLOYMENT.md": "Developer deployment guide with dfx configuration, deployment steps, upgrade workflow, and cycle management practices.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Notes describing homepage redesign including hero image, contrast fixes, typography, spacing, and visual effects.",
  "frontend/docs/PHASED_PLAN.md": "Phased development roadmap detailing deliverables and non-goals for progressive Whisper implementation.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Explains registry pattern for Secretary assistant navigation including destinations, actions, and routing behavior.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Manual smoke test checklist for verifying full instance proposal creation and follow-up task workflows in the app.",
  "frontend/docs/STYLE_GUIDE.md": "Design guidelines defining Whisper’s visual style, including colors, typography, and accessibility rules.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main application component managing navigation, UI section visibility, and secretary command registration.",
  "frontend/src/components/common/HomeHeader.tsx": "Fixed header component displaying the Whisper logo and a Get Started button.",
  "frontend/src/components/common/IconBubble.tsx": "Reusable circular icon container supporting size and color variants.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Shared loading spinner component with optional label and size control.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form component for creating an instance proposal with name validation and geographic selection.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "County dropdown component that loads counties for a selected state and handles errors and loading states.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown for selecting a place within a county, loading place options via a hook and handling errors or missing county selection.",
  "frontend/src/components/create-instance/SelectState.tsx": "State selection dropdown that loads all states, maps them into options, and displays errors if fetching fails.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Dialog showing detailed info about an issued project, including overview and tasks tabs with status, description, and geography.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Tasks tab allowing creation and completion toggling of project tasks, with loading and error states.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Dialog showing proposal details, allowing admins to approve or reject and optionally open the related issue project.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Section listing all proposals with loading, error handling, auto-open behavior, and a details dialog.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "UI card promoting the Secretary feature with a dismiss button and call-to-action to open it.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "UI chat widget that handles user input, keyword-based option matching, and displays messages using secretary chat logic.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Creates a portal to render the SecretaryWidget into an overlay container mounted on the document body.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Provides hooks to check instance-name availability and submit new instance proposals with error handling and cache invalidation.",
  "frontend/src/hooks/useDebouncedValue.ts": "Debounces a changing value by a configurable delay to avoid rapid updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and identity persistence using Dfinity’s AuthClient.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Hooks for fetching tasks, creating tasks, and updating task status for a proposal using backend actor methods.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook to persist React state to localStorage with SSR guards and error handling.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and returns readiness/error flags with console warnings on load failures.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks for parent-child relationship checks, proposal retrieval, and admin status queries using the backend actor.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages secretary chat state, including messages, menu visibility, and helper functions to add or reset messages.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Provides a registry for navigation destinations with methods to register, find by keyword, and execute navigation actions.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Mutation hook to update a proposal's status and invalidate related queries after success.",
  "frontend/src/hooks/useUSGeography.ts": "React Query hooks for fetching US states, counties, and places from the backend with error handling and caching.",
  "frontend/src/index.css": "Tailwind-based global styles defining theming variables, dark mode, utilities, and animations.",
  "frontend/src/lib/formatProposalGeography.ts": "Formats proposal geography into readable strings and provides labels for hierarchy levels.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines secretary navigation intents, deep link parsing/creation, option metadata, and keyword matching.",
  "frontend/src/main.tsx": "App entry point setting up React Query, identity provider, and rendering the root App component.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/src/utils/userFacingError.ts": "Converts unknown errors into safe user-facing messages while logging originals.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling class-based dark mode, custom color variables, fonts, animations, and plugins for animation and typography.",
  "project_state.json": "Project state file describing schema version, current project metadata, and a feature request to revert the codebase to Draft 38."
}