{
  "backend/main.mo": "Defines the main Motoko actor with storage, authorization, user profiles, contribution logging, governance models, and social feed post structures. Initializes maps for posts and instance scoping with various domain types.",
  "feature_evidence.json": "Feature evidence report describing required minimal React state handling for PostComposer’s optional photo input. Lists affected file, components, tests, and metadata.",
  "frontend-file-summaries.txt": "JSON mapping of many frontend file paths to concise summaries describing architecture, routing, hooks, UI components, and styling behaviors across the project.",
  "frontend/docs/ARCHITECTURE.md": "High-level architecture document outlining Whisper’s vision, hierarchical installation model, canister topology, and modular subsystem design. Provides principles, data flow, and multi-canister scaling direction.",
  "frontend/docs/ATOMIC_MILESTONES_FEED_ISSUES_SECRETARY.md": "Defines milestone-driven implementation plan for feed, civic issues, and Secretary/map integration. Lists frontend/backend requirements and smoke tests for each stage.",
  "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md": "Specifies backend category storage, location-based complaint mapping, and API requirements for the Secretary’s category suggestion system. Documents arrays stored in backend/main.mo.",
  "frontend/docs/DEPLOYMENT.md": "Provides deployment instructions for Whisper including prerequisites, local setup, and ICP deployment workflow. Covers cycles, tooling, and environment configuration.",
  "frontend/docs/HOMEPAGE_REDESIGN_NOTES.md": "Details design updates for the homepage including hero image, contrast fixes, typography, layout, and Secretary widget styling. Documents visual standards and accessibility improvements.",
  "frontend/docs/PHASED_PLAN.md": "Describes the multi‑phase development roadmap for Whisper with deliverables, non‑goals, and scaling hooks from prototype to multi‑installation system.",
  "frontend/docs/RETRY_PROD_DEPLOYMENT_RUNBOOK.md": "Provides a checklist and prerequisites for safely retrying failed production deployments and gathering diagnostics.",
  "frontend/docs/SECRETARY_NAVIGATION_HOOKS.md": "Explains the registry system for registering navigable destinations so the Secretary assistant can route users via options, free text, or deep links.",
  "frontend/docs/SMOKE_TEST_INSTANCE_FOLLOWUPS.md": "Outlines full end‑to‑end manual smoke tests for proposals, task management, evidence uploads, regression fixes, and hyperlocal feed/issue/Secretary flows.",
  "frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md": "Defines regression smoke tests for UI fixes, Secretary flow behavior, profile/identity issues, navigation, and base‑path deployments.",
  "frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md": "Documents smoke tests for the modular Secretary assistant flows including discovery, reporting, category selection, keyword routing, and error recovery.",
  "frontend/docs/STYLE_GUIDE.md": "Specifies Whisper’s visual design system including colors, typography, layout principles, and accessibility requirements.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Base HTML file setting up root containers and loading the main TypeScript entrypoint.",
  "frontend/public/whisper-logo-teal.svg": "SVG asset defining the teal Whisper logo with circular motif and white internal marks.",
  "frontend/src/App.tsx": "Main app component handling routing, secretary UI state, and lazy-loaded pages using react-query and popstate listeners.",
  "frontend/src/components/common/EarnedPointsInlineBadge.tsx": "Inline badge showing earned contribution points unless duplicate or zero.",
  "frontend/src/components/common/HomeHeader.tsx": "Top navigation header with logo, route buttons, mobile menu, and user profile menu integration.",
  "frontend/src/components/common/IconBubble.tsx": "Reusable circular icon wrapper with size and color variants.",
  "frontend/src/components/common/LoadingIndicator.tsx": "Spinner with optional label for consistent loading UI across the app.",
  "frontend/src/components/common/LoginButton.tsx": "Login/logout button using Internet Identity with status handling and optional icon.",
  "frontend/src/components/common/UserProfileMenu.tsx": "Dropdown user menu showing avatar, profile link, and logout option with profile image handling.",
  "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx": "Form card for proposing a new instance with geography selectors, name generation, and contribution logging.",
  "frontend/src/components/create-instance/SelectCounty.tsx": "Dropdown for selecting a county based on a state, with loading and error states.",
  "frontend/src/components/create-instance/SelectPlace.tsx": "Dropdown for selecting a place within a county, fetching place data and handling loading or error states.",
  "frontend/src/components/create-instance/SelectState.tsx": "State selection dropdown that loads all states and handles loading, errors, and selection events.",
  "frontend/src/components/feed/FeedList.tsx": "Displays an infinite-scrolling feed of posts with loading, error, and empty states.",
  "frontend/src/components/feed/FlagPostDialog.tsx": "Dialog allowing authenticated users to flag a post with an optional reason.",
  "frontend/src/components/feed/PostCard.tsx": "Renders a post preview with author info and actions to view details or flag the post.",
  "frontend/src/components/feed/PostComposer.tsx": "Form for creating a new post, including instance selection, content input, and optional photo upload placeholder.",
  "frontend/src/components/feed/PostDetailDialog.tsx": "Modal showing full post details with author info, timestamps, and loading/error states.",
  "frontend/src/components/issue-project/EvidenceUploadSection.tsx": "Renders an evidence upload form that logs EVIDENCE_ADDED contributions and displays earned points or duplicate info. Handles file selection, simulated upload, errors, and resets state after submission.",
  "frontend/src/components/issue-project/IssueProjectDetailDialog.tsx": "Shows a dialog with tabs for an issue project, including overview, tasks, and evidence upload. Loads proposal data, lists related tasks, and enables converting an issue into a task with navigation.",
  "frontend/src/components/issue-project/IssueProjectTasksTab.tsx": "Displays tasks for an issue project with create and toggle functionality. Logs COMMENT_CREATED contributions for new tasks and shows inline points or errors.",
  "frontend/src/components/location/LocationAcquisitionCard.tsx": "Provides location acquisition via browser geolocation with error handling and a fallback manual selector. Lets users confirm or manually pick state, county, and place.",
  "frontend/src/components/location/LocationSelector.tsx": "Composed selector for state, county, and place using existing dropdown components. Clears dependent selections and supports disabling.",
  "frontend/src/components/proposals/ProposalDetailDialog.tsx": "Shows proposal details in a dialog with live data refresh and optional auto-opening of the issue project view. Includes geography info, status, and navigation into the issue project dialog.",
  "frontend/src/components/proposals/ProposalsSection.tsx": "Displays a proposals list with loading, error, refresh, and detail-dialog handling, including navigation triggered by secretary events.",
  "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx": "Renders a dismissible card prompting users to open the Secretary assistant.",
  "frontend/src/components/secretary/SecretaryHierarchicalLocationSelector.tsx": "Provides a guided state–county–place selector with initialization logic and a Continue button enabled once a location is valid.",
  "frontend/src/components/secretary/SecretaryIssueCategorySelect.tsx": "Simple dropdown for selecting an issue category using shadcn-ui Select components.",
  "frontend/src/components/secretary/SecretaryLocationTypeahead.tsx": "Implements a searchable typeahead input with keyboard navigation, option filtering, and selectable results.",
  "frontend/src/components/secretary/SecretaryWidget.tsx": "Full-featured Secretary chat widget supporting text, speech input, dynamic flow rendering, and multiple input modes like location selectors and category pickers.",
  "frontend/src/components/secretary/SecretaryWidgetPortal.tsx": "Creates and mounts a SecretaryWidget into an overlay root while managing FlowEngineBrain and geography data updates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdminContributionLogs.ts": "Fetches paginated admin-only contribution logs using the actor, enabled only when admin access is confirmed.",
  "frontend/src/hooks/useAdminFlaggedPosts.ts": "Hooks to fetch flagged posts and allow admins to clear flags or delete posts with query invalidation and error toasts.",
  "frontend/src/hooks/useAdminUserContributionLogs.ts": "Fetches contribution logs for a specific user principal, enabled only for admins.",
  "frontend/src/hooks/useAdminWspTokenOperations.ts": "Provides admin-only hooks for minting and burning WSP tokens with input validation and cache invalidation.",
  "frontend/src/hooks/useBrowserGeolocation.ts": "Wraps browser geolocation, exposing status, coordinates, errors, and retry/reset helpers.",
  "frontend/src/hooks/useCallerContributionSummary.ts": "Loads the current user's contribution summary using identity-scoped caching.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Fetches and saves the caller’s user profile with identity-scoped caching and mutation invalidation.",
  "frontend/src/hooks/useComplaintSuggestions.ts": "Fetches complaint category suggestions or full category lists based on geography level and search term.",
  "frontend/src/hooks/useContributionEventLogger.ts": "Logs contribution events with deduping, user-friendly errors, and summary cache updates.",
  "frontend/src/hooks/useCreateInstanceProposal.ts": "Checks instance-name availability and submits new instance proposals with validation and cache invalidation.",
  "frontend/src/hooks/useCreatePost.ts": "Creates a post for the current user and invalidates relevant post queries with error toasts.",
  "frontend/src/hooks/useCurrentPath.ts": "Tracks the current SPA route by listening to popstate and normalizing the base path.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced version of a value using a configurable delay.",
  "frontend/src/hooks/useDeleteProposal.ts": "Mutation hook to delete a proposal and invalidate moderation and proposal queries.",
  "frontend/src/hooks/useFlagPost.ts": "Mutation hook to flag a post, handles identity checks, errors, and refreshes feed-related queries.",
  "frontend/src/hooks/useGovernanceProposals.ts": "Hooks to list, fetch, create, and vote on governance proposals with identity validation and query invalidation.",
  "frontend/src/hooks/useHideProposal.ts": "Mutation hook to hide a proposal and refresh moderation and proposal queries.",
  "frontend/src/hooks/useInstanceFeed.ts": "Infinite query hook to load paginated posts for an instance with error handling.",
  "frontend/src/hooks/useInstanceScopeLocation.ts": "Manages persisting and restoring selected location metadata via localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, loading and managing authentication state using AuthClient.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries whether the current caller is an admin, enabled when actor is ready.",
  "frontend/src/hooks/useIssueProjectTasks.ts": "Hooks to fetch, create, and update proposal tasks with optimistic updates and error handling.",
  "frontend/src/hooks/useLocalStorageState.ts": "Persists React state to localStorage with SSR-safe guards.",
  "frontend/src/hooks/useLocationSelection.ts": "Manages hierarchical state/county/place selection and derives a canonical locationId and display name.",
  "frontend/src/hooks/useModerationItems.ts": "Fetches the admin moderation queue and maps backend proposals into UI-friendly moderation items using React Query.",
  "frontend/src/hooks/usePostDetail.ts": "Loads detailed post data by postId via React Query with user-facing error handling.",
  "frontend/src/hooks/usePreloadedImage.ts": "Preloads an image URL and returns ready/error state, resetting when the src changes.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple React Query hooks for fetching proposals, geography data, complaint categories, and staking info from the backend.",
  "frontend/src/hooks/useSecretaryChat.ts": "Manages chat messages and menu visibility for the secretary assistant UI.",
  "frontend/src/hooks/useSecretaryNavigationRegistry.ts": "Registers navigation destinations and supports lookup, navigation, and keyword-based matching.",
  "frontend/src/hooks/useSetIssueProjectCategory.ts": "Stores and retrieves temporary issue project categories in localStorage and invalidates related queries.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements speech-to-text using the browser SpeechRecognition API with transcript, error, and listening state.",
  "frontend/src/hooks/useStakingInfo.ts": "Fetches staking info scoped to the current identity and tracks actor loading state.",
  "frontend/src/hooks/useStakingMutations.ts": "Provides stake and unstake mutations with error handling and cache invalidation.",
  "frontend/src/hooks/useSystemVoices.ts": "Loads available system speech synthesis voices and reports support and loading state.",
  "frontend/src/hooks/useTasks.ts": "Provides React Query hooks for listing, retrieving, creating, and converting tasks with backend actor calls and query invalidation.",
  "frontend/src/hooks/useUpdateProposalStatus.ts": "Defines a mutation for approving or rejecting proposals and invalidates related proposal and moderation queries.",
  "frontend/src/hooks/useUserProfileByPrincipal.ts": "Fetches a user profile by principal using React Query, returning null on errors for graceful fallback.",
  "frontend/src/hooks/useUSGeography.ts": "Offers hooks to fetch U.S. states, counties, and places with stable caching, error handling, and actor-based queries.",
  "frontend/src/hooks/useWspBalance.ts": "Retrieves the caller’s WSP token balance with identity-scoped caching and combined loading state handling.",
  "frontend/src/index.css": "Defines global Tailwind-based styling, theme variables, dark mode tokens, and utility classes for layout and UI effects.",
  "frontend/src/lib/contributionActionTypes.ts": "Declares canonical contribution action type constants and exports them along with a list for UI filtering.",
  "frontend/src/lib/earnedPointsToast.ts": "Implements a toast helper that displays earned contribution points with action-specific messaging and duplicate suppression.",
  "frontend/src/lib/formatProposalGeography.ts": "Provides helpers for formatting proposal geography data, including labels, population formatting, parts extraction, and readable geography strings.",
  "frontend/src/lib/formatTokenAmount.ts": "Formats BigInt token amounts with optional decimals into display-friendly strings.",
  "frontend/src/lib/secretaryNavigation.ts": "Defines secretary navigation options, keyword-based lookup, and deep link parsing/creation utilities.",
  "frontend/src/lib/secretaryReportIssueData.ts": "Provides async helpers to fetch geography details and top issues, currently returning fallback data due to unimplemented backend methods.",
  "frontend/src/lib/secretaryTopIssuesMessaging.ts": "Implements a messaging helper to retrieve and format top issues by geography level, returning friendly fallback messages.",
  "frontend/src/lib/uiCopy.ts": "Centralized UI copy object containing static text strings for product, features, proposals, governance, and more.",
  "frontend/src/lib/whisperInstanceNaming.ts": "Generates, validates, normalizes, and parses WHISPER- prefixed instance names based on geography level.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminModerationPage.tsx": "Admin page that displays moderation items, handles approval/rejection/hide/delete actions, and restricts access to admins.",
  "frontend/src/pages/admin/components/ContributionLogsSection.tsx": "Displays paginated contribution logs with filters and navigation to related issues for admins.",
  "frontend/src/pages/admin/components/FlaggedPostsSection.tsx": "Shows flagged posts for admins with options to clear flags or delete posts, including pagination and confirmation dialogs.",
  "frontend/src/pages/admin/components/ModerationItemsList.tsx": "Lists moderation items with status badges and actions, providing confirmation dialogs and empty-state handling.",
  "frontend/src/pages/admin/components/TokenOperationsSection.tsx": "Admin UI for minting and burning WSP tokens with validation, pending state, and success/error feedback.",
  "frontend/src/pages/FeedPage.tsx": "Feed page that manages location selection, restores and generates instance names, and displays community posts and location UI.",
  "frontend/src/pages/GeographyPage.tsx": "Renders a placeholder geography page with header navigation and a coming-soon message.",
  "frontend/src/pages/profile/components/CreateGovernanceProposalDialog.tsx": "Dialog for creating governance proposals with authentication checks, form validation, and submission handling.",
  "frontend/src/pages/profile/components/GovernanceProposalDetailDialog.tsx": "Displays a proposal’s details, tallies, and vote controls with authentication gating and vote submission logic.",
  "frontend/src/pages/profile/components/GovernanceSection.tsx": "Lists governance proposals with loading/empty/error states and opens dialogs for viewing details or creating new proposals.",
  "frontend/src/pages/profile/components/StakingSection.tsx": "Staking UI allowing users to stake or unstake WSP with validation, balance checks, and mutation-driven updates.",
  "frontend/src/pages/ProfilePage.tsx": "Handles user profile viewing and editing, including image upload, saving profile data, and displaying contribution points and balances.",
  "frontend/src/pages/tasks/TaskCreatePage.tsx": "Form page for creating a task, handling validation, submission, and navigation after creation.",
  "frontend/src/pages/tasks/TaskDetailPage.tsx": "Displays task details with status changes and assignment actions, using backend task mutations.",
  "frontend/src/pages/tasks/TasksListPage.tsx": "Lists tasks for a location with loading, error, and navigation to create or view individual tasks.",
  "frontend/src/secretary/brain/FlowEngineBrain.ts": "Implements the flow-engine-based SecretaryBrain, coordinating intents, slot filling, navigation, and backend task actions.",
  "frontend/src/secretary/brain/hooks.ts": "Provides utilities to compose, filter, and log SecretaryBrain flow event listeners.",
  "frontend/src/secretary/brain/SecretaryBrain.ts": "Defines the SecretaryBrain interface for handling input, actions, view models, listeners, and context.",
  "frontend/src/secretary/copy/secretaryCopy.ts": "Contains English UI copy for Secretary flows, including menu text, discovery prompts, issue reporting, and guided workflows.",
  "frontend/src/secretary/copy/secretaryPrompts.ts": "Provides prompt builders for slot filling, issue reporting, category suggestions, repair confirmations, and guided report summaries.",
  "frontend/src/secretary/decisions/secretaryDecisions.ts": "Contains pure decision logic for flow branching, geography resolution, suggestion handling, unknown input recovery, and validation.",
  "frontend/src/secretary/flow/flows.ts": "Defines all conversation flow nodes, their UI view models, and entry behaviors for discovery, issue reporting, and guided flows.",
  "frontend/src/secretary/flow/runner.ts": "Implements flow execution, including transitions, node entry/exit, view-model generation, and the FlowRunner controller.",
  "frontend/src/secretary/flow/types.ts": "Defines core types for nodes, transitions, actions, context, view models, and guided report drafts with location metadata.",
  "frontend/src/secretary/intent/flowRegistry.ts": "Maps intents to required slots, slot order, and completion behaviors, including task-related intents.",
  "frontend/src/secretary/intent/flowRunner.ts": "Runs intent flows by finding missing slots, filling them, prompting for values, and executing completion handlers.",
  "frontend/src/secretary/intent/geographyLookup.ts": "Performs backend-assisted state/county/place lookup from text and derives a location ID.",
  "frontend/src/secretary/intent/geographyNlp.ts": "Provides deterministic client-side matching of states, counties, and places in text and extracts the most specific geography.",
  "frontend/src/secretary/intent/index.ts": "Re-exports all intent, slot, flow, and geography utilities from the intent system.",
  "frontend/src/secretary/intent/intentClassifier.ts": "Classifies free text into intents using keyword and pattern matching, including task and issue types.",
  "frontend/src/secretary/intent/issueDescriptionNlp.ts": "Strips geography tokens and connectors from text to derive an issue description.",
  "frontend/src/secretary/intent/repair.ts": "Detects user corrections and identifies which slot to repair, including task-related slots.",
  "frontend/src/secretary/intent/slotState.ts": "Manages slot storage, clearing, dependency resets, and filled-state checks.",
  "frontend/src/secretary/intent/taskExecutor.ts": "Executes create, find, and update task intents using backend actor methods and returns user-facing messages.",
  "frontend/src/secretary/intent/taskIntentActions.ts": "Defines async handlers for create, find, and update task intents, validating slots, calling backend APIs, and returning user-facing messages.",
  "frontend/src/secretary/intent/taskSlotParsing.ts": "Provides text parsers for task-related slots including IDs, status, location IDs, titles, descriptions, and categories.",
  "frontend/src/secretary/intent/types.ts": "Defines Secretary intent types, task-related slot names, slot value structures, and intent context shapes.",
  "frontend/src/secretary/observability/secretaryTrace.ts": "Implements a lightweight in-memory trace buffer for logging Secretary events with enable/disable controls.",
  "frontend/src/secretary/state/secretaryContext.ts": "Manages Secretary conversation state, including intent state, slots, guided report drafts, and message handling.",
  "frontend/src/secretary/ui/secretaryViewModel.ts": "Converts node view models into UI-friendly rendering instructions and maps icon identifiers.",
  "frontend/src/utils/assetUrl.ts": "Provides helpers to resolve asset URLs and navigation paths respecting the app’s base path.",
  "frontend/src/utils/instanceScope.ts": "Stores and retrieves last-used location IDs and metadata in localStorage with basic validation.",
  "frontend/src/utils/profileImageUrl.ts": "Creates and revokes object URLs for displaying profile images from byte arrays.",
  "frontend/src/utils/secretaryProjectNavigation.ts": "Implements event-based navigation signaling from Secretary to project views with optional metadata.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/userFacingError.ts": "Maps various backend error strings to short, user-friendly English messages.",
  "frontend/tailwind.config.js": "Configures Tailwind theme settings, colors, fonts, animations, and plugin usage for the frontend.",
  "project_state.json": "Describes the project’s current state, including feature progress, goals, and metadata for build planning."
}