{
  "kind": "build_request",
  "title": "Implement stable-memory backed contribution log (Phase 1 step 1)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a stable-memory backed Contribution Log in the Motoko canister so contribution log entries and the next log entry ID persist across canister upgrades. This must cover the existing contribution logging APIs in backend/main.mo (e.g., recordContribution, addContributionPoints, getCallerContributionHistory, getCallerContributionSummary) without changing their externally observable behavior (other than persistence across upgrades).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Run step 1"
        ]
      },
      "acceptanceCriteria": [
        "After recording one or more contribution log entries, upgrading the canister preserves all previously recorded log entries and the next log entry ID (no ID reuse after upgrade).",
        "Contribution log persistence is implemented using stable memory (stable vars and preupgrade/postupgrade, or an equivalent stable structure) rather than in-memory-only Map/List state.",
        "Existing authorization behavior remains intact (e.g., only callers with #user permission can record/view their own contribution history/summary).",
        "The contribution history query still enforces a bounded result size (e.g., existing limit clamped to a maximum) and does not introduce unbounded payloads.",
        "Build passes and the canister compiles successfully with the updated stable-memory contribution log implementation."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor architecture with all Motoko logic in backend/main.mo.",
    "If an upgrade migration is required for existing deployed state, follow the repository migration policy (conditional migration) and do not break existing stable state."
  ],
  "nonGoals": [
    "Do not implement token minting, burning, staking, transfers, governance voting, or any on-chain token logic.",
    "Do not add admin-only contribution log APIs or admin UI in this step.",
    "Do not add WSP placeholder fields to user profiles in this step.",
    "Do not create or connect contribution events to issues/comments/evidence/categories in this step."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}