{
  "kind": "build_request",
  "title": "Document clean rebuild + redeploy procedure and troubleshooting for draft deployment errors",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the deployment documentation to include an explicit “clean rebuild and redeploy” procedure that clears local build artifacts/caches and then rebuilds + redeploys the project, including a short troubleshooting section for intermittent Caffeine draft deployment failures (e.g., retry guidance) and the known draft preview issue showing `draft-editor:error disallowed origin: https://just-olive-eim-draft.caffeine.xyz`. All user-facing text in the docs must be in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "trigger a clean rebuild and redeploy"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/docs/DEPLOYMENT.md` contains a clearly labeled section for performing a clean rebuild and redeploy, with concrete steps a developer can follow.",
        "`frontend/docs/DEPLOYMENT.md` includes a troubleshooting section that mentions intermittent platform-level draft deployment failures and recommends retrying a clean rebuild/redeploy when they occur.",
        "The troubleshooting section mentions the known draft preview console error `draft-editor:error disallowed origin: https://just-olive-eim-draft.caffeine.xyz` as a platform preview issue, without attributing it to application code.",
        "All new/updated documentation text is written in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under the immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not implement new application features or change existing UI/UX behavior as part of this request.",
    "Do not add third-party integrations or external deployment tooling beyond what is already used by the project."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}