{
  "kind": "build_request",
  "title": "Execute Secretary smoke-test steps 5 and 6 (geography suggestions + flow engine)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the Secretary widget discovery flow shows county/city suggestions after a state is selected, and that suggestions are filtered correctly with no console errors (as described in step 5 of `frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Run steps 5 and 6"
        ]
      },
      "acceptanceCriteria": [
        "With geography data ingested, opening the Secretary widget and running the discovery flow allows selecting a state and then immediately shows county/city suggestions.",
        "The suggestions list updates (filters) correctly based on the selected state and user input without noticeable lag.",
        "No errors appear in the browser console while running this flow."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Secretary flow engine behavior matches the manual checklist in step 6 of `frontend/docs/SMOKE_TEST_REGRESSION_PATCH.md` (and the detailed scenarios in `frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md`), including menu rendering, discovery, report-issue paths (with and without top issues), custom category flow, back-to-menu behavior, keyword navigation, and unknown-input recovery.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Run steps 5 and 6"
        ]
      },
      "acceptanceCriteria": [
        "Opening the Secretary widget shows a menu with four options and a greeting message.",
        "Discovery flow works end-to-end (state → location → result), and returning back to menu resets flow state.",
        "Report issue flow works both when top issues exist and when they do not; selecting a category completes the flow and triggers the expected navigation behavior.",
        "Custom category flow works via a “Something else” path and accepts a user-entered category.",
        "Keyword navigation (e.g., typing a destination keyword) routes to the correct page and the widget closes when expected.",
        "Unknown input produces an English recovery message and provides a working “Back to Menu” action.",
        "No console errors or React hooks warnings occur during these flows."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Do not edit frontend files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT.",
    "Keep backend logic (if any changes are needed) within the single Motoko actor in `backend/main.mo`; only introduce/modify `backend/migration.mo` if a state upgrade is required."
  ],
  "nonGoals": [
    "Do not implement new Secretary intents or add new product features beyond what is needed to satisfy smoke-test steps 5 and 6.",
    "Do not introduce real-time communication features (e.g., WebSockets) or third-party auth providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}