{
  "kind": "build_request",
  "title": "Refine Secretary lookup flow and update navbar membership CTA + branding colors",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the top navigation bar branding colors: keep using the existing teal logo SVG, render the “Whisper” wordmark text in white, and render all menu item labels in white by default with teal styling on hover/rollover and when selected/active.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Refine the secretary's lookup flow and keep the logo its current teal color and make the Whisper text white along with the menu items in the menu bar and teal when selected or rolled over."
        ]
      },
      "acceptanceCriteria": [
        "The header continues to use the existing asset at frontend/public/whisper-logo-teal.svg with no color modifications to the SVG.",
        "The “Whisper” text next to the logo renders white in the header.",
        "Desktop nav menu labels (e.g., Geography, Admin when present) render white by default.",
        "On hover, focused, or active route, nav menu labels render in teal (consistent with the app’s existing teal accent token).",
        "Mobile menu items match the same white default / teal hover-active behavior."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change the header “Get Started” CTA behavior so that when the user is not authenticated it triggers Internet Identity login (becoming a site member) rather than scrolling to a page section or initiating instance creation/chat flows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Also \"Get Started\" can remain but I want that to call the login to become a site member, not activate the instance or chat."
        ]
      },
      "acceptanceCriteria": [
        "When not authenticated, clicking “Get Started” initiates the Internet Identity login flow.",
        "When not authenticated, clicking “Get Started” does not scroll to the “get-started” section and does not navigate to create-instance, proposals, or open the Secretary widget.",
        "If login is already in progress, the CTA is disabled (or otherwise prevents duplicate login attempts) and shows an appropriate loading state consistent with existing auth UI copy."
      ]
    },
    {
      "id": "REQ-3",
      "text": "When the user is authenticated, replace the header “Get Started” CTA with a user profile entry that shows the user’s profile image (fallback if none) and label, and opens a submenu with at least: “Profile” (navigates to /profile) and “Logout” (logs out and clears cached queries).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Once the user is logged in, it changes from \"Get Started\" to User Profile and image with submenu."
        ]
      },
      "acceptanceCriteria": [
        "After successful authentication, the “Get Started” CTA is no longer shown in the header.",
        "A profile control is shown instead, including an avatar image when available; if no image is available, a deterministic fallback (e.g., initials or generic icon) is shown.",
        "Opening the profile control shows a submenu that includes “Profile” and “Logout”.",
        "Clicking “Profile” navigates to the existing profile page route and closes the submenu.",
        "Clicking “Logout” logs out (clears identity) and clears React Query cache, matching existing logout behavior.",
        "Mobile header/menu provides equivalent authenticated profile access and logout."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Refine the Secretary “lookup/discovery” flow to avoid auto-navigation side effects and make the outcome explicit: after the user selects state + county or city, show a clear result message and present explicit next-action buttons (e.g., “View existing instance” when found, or “Create an instance proposal” when not found), without automatically navigating after a timeout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Refine the secretary's lookup flow"
        ]
      },
      "acceptanceCriteria": [
        "When an existing instance is detected, the Secretary shows a result state with an explicit action button to navigate to the relevant destination; it does not auto-navigate after a delay.",
        "When no instance is detected, the Secretary shows the “founding citizen” result message and an explicit action button to proceed to instance proposal creation; it does not auto-navigate after a delay.",
        "The Secretary remains open on the result step until the user chooses an action or closes the widget.",
        "The refined flow continues to support both county and city selection and continues to use the existing geography data sources and typeahead UI.",
        "All user-facing text in the refined flow is in English."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui must not be edited directly; compose existing shadcn components instead.",
    "Do not modify immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep the existing logo asset frontend/public/whisper-logo-teal.svg and its teal color unchanged."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers; use Internet Identity only.",
    "Do not introduce new backend canisters or databases.",
    "Do not implement real-time communication (e.g., WebSockets) as part of the Secretary flow changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}