{
  "kind": "build_request",
  "title": "Add automatic slot-filling to the Secretary so it gathers missing details",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Enable the Secretary’s intent/slot-filling mode to automatically pre-fill slots from a single user message (at minimum: geography slots and, for the report-issue intent, the initial issue description) and then ask only for the remaining missing required slots.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Run Add slot-filling so the Secretary can gather missing details automatically"
        ]
      },
      "acceptanceCriteria": [
        "When the user types a single message like “Potholes in Omaha, Nebraska near 72nd street”, the Secretary enters slot-filling mode, pre-fills the state (and place when possible), sets a reasonable initial issue_description, and only prompts for missing required slots (e.g., category) instead of restarting at the menu.",
        "When geography cannot be reliably extracted, the Secretary prompts for the missing geography slot using the existing slot prompt copy.",
        "All prompts and recovery messages shown during slot-filling are in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Wire complaint category suggestions into slot-filling: when the next missing slot is issue_category, fetch and present category suggestions based on the currently filled geography level and the current issue_description slot, and allow the user to choose a suggestion to fill the category slot.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Run Add slot-filling so the Secretary can gather missing details automatically"
        ]
      },
      "acceptanceCriteria": [
        "During report_issue slot-filling, once issue_description is filled and issue_category is the next missing slot, the UI shows suggested categories.",
        "Clicking a suggested category fills the issue_category slot and advances the slot-filling flow.",
        "If no suggestions are returned, the Secretary asks the user to type a category (English prompt) and uses the next user message to fill issue_category."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix Secretary location typeahead selection so it works for any active geography slot (state, county, or place) and correctly advances slot-filling after selection.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Run Add slot-filling so the Secretary can gather missing details automatically"
        ]
      },
      "acceptanceCriteria": [
        "When the next slot is state, selecting a state from the typeahead fills the state slot and triggers the next prompt.",
        "When the next slot is county or place, selecting an option from the typeahead fills the correct slot and triggers the next prompt.",
        "Typeahead selection does not rely on undefined/non-existent brain methods; slot determination and filling works reliably."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure slot-filling completion behavior is user-visible and consistent: after all required slots for an intent are filled, the Secretary executes the existing completion navigation for that intent and then resets back to the main menu with an English confirmation message.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Run Add slot-filling so the Secretary can gather missing details automatically"
        ]
      },
      "acceptanceCriteria": [
        "For report_issue, once required slots are filled, the Secretary navigates via the existing navigation handler to the proposals/reporting destination and closes the widget when requested by the completion handler.",
        "After completion, the Secretary conversation resets and shows an English prompt like “Done! Anything else I can help with?” on the next visible state."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only shadcn components).",
    "Do not modify any files listed in frontend.immutablePaths in SYSTEM_CONTEXT.",
    "Backend must remain a single Motoko actor (no additional backend canisters/services for this change)."
  ],
  "nonGoals": [
    "Implementing the WSP token canister or token operations.",
    "Implementing new backend geography datasets or changing geography storage schemas.",
    "Adding new intents beyond the existing intent set; focus on making slot-filling work reliably for current intents."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}