{
  "kind": "build_request",
  "title": "Step 6: Display Contribution Points on Profile page (state-sourced, teal styling, instant updates)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a clearly visible Contribution Points summary element to the user Profile page that prominently shows the user’s total contribution points, styled consistently with the existing Profile layout and using a teal accent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Run Step 6: Add Contribution Points display on profile page • 6.1 Add a new UI element in the Profile page showing total contribution points. • 6.3 Style it consistently with the profile layout and teal accent color."
        ]
      },
      "acceptanceCriteria": [
        "On the Profile page, there is a dedicated UI element for Contribution Points that includes a prominently displayed total.",
        "The styling matches the existing Profile cards/components and includes a teal accent (e.g., icon/heading/border) consistent with current design tokens/components."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Source the displayed contribution points total strictly from existing client-side React state/React Query cache already used by the Profile page, and do not add any new backend calls/endpoints for this display.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "6.2 Pull the point total from the existing React state (no new backend calls)."
        ]
      },
      "acceptanceCriteria": [
        "No new backend methods, canister calls, or new React Query fetch hooks are introduced solely to support the Contribution Points display.",
        "The Profile page continues to use the existing in-app state (e.g., the existing contribution summary state already present on the page) to render the total."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a short English helper hint under/near the Contribution Points total explaining what contribution points represent, and add an English fallback message for users with zero total points.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "6.4 Show a short hint explaining what contribution points are. • 6.6 Add fallback text for users with zero points. Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "The Contribution Points UI includes a short helper hint in English (may reuse existing copy if appropriate).",
        "If the user’s total contribution points is 0, the UI shows an explicit English fallback message (e.g., “No contribution points yet”) instead of only showing a bare 0, or in addition to the 0 (as long as it is clearly a fallback state)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the Contribution Points total updates immediately in the Profile page UI after an earned-points toast event, without requiring a backend refetch to see the updated number.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "6.5 Ensure the number updates immediately after a toast event."
        ]
      },
      "acceptanceCriteria": [
        "After a contribution is logged and the earned-points toast is shown, the Contribution Points total displayed on the Profile page updates immediately (same session) to reflect the newly awarded points.",
        "This immediate update is driven by updating existing client-side state/React Query cache (e.g., via queryClient.setQueryData) rather than waiting for a backend refetch triggered solely for UI freshness."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Verify and adjust the Contribution Points UI element to be mobile responsive (readable layout, no overflow, appropriate spacing) across small screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "6.7 Confirm mobile responsiveness."
        ]
      },
      "acceptanceCriteria": [
        "On narrow/mobile widths, the Contribution Points element remains readable and properly spaced (no clipped text, overlapping elements, or horizontal scrolling).",
        "The layout adapts appropriately (e.g., stacking or responsive grid behavior) while staying consistent with the Profile page design."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing Shadcn components instead).",
    "Do not modify immutable hook entry files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Do not add new backend calls/endpoints for the Contribution Points display; use existing client-side state/cache."
  ],
  "nonGoals": [
    "Do not introduce new contribution point types, new reward rules, or changes to the backend contribution calculation.",
    "Do not redesign the entire Profile page—only add/adjust the Contribution Points display to meet Step 6 requirements.",
    "Do not add new authentication methods beyond existing Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}