{
  "kind": "build_request",
  "title": "Mitigate Caffeine preview blank screen by blocking injected draft editor script and stripping editor-triggering dependency chain",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a temporary, early-executing in-site blocker that prevents the Caffeine preview system’s injected draft editor script from loading/executing (e.g., draft-script.js / draft-editor), so the preview no longer crashes with the “disallowed origin” error and the React app can mount.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "can you strip it and write a temporary script in the site that blocks dependency chain completely so the preview system stops injecting their script?"
        ]
      },
      "acceptanceCriteria": [
        "The blocker is implemented without modifying any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
        "The blocker runs before the application bundle executes (i.e., it is loaded before the main module script).",
        "When opening a draft preview URL (e.g., https://just-olive-eim-draft.caffeine.xyz), the browser console no longer shows the draft-editor “disallowed origin” error originating from injected draft scripts, and the app renders instead of a blank white page.",
        "The blocker is scoped as “temporary” and is gated to only activate on Caffeine draft preview hostnames/conditions (so it does not interfere with normal deployments)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Strip the suspected editor-triggering dependency chain from the frontend bundle so the preview system stops deciding to inject the draft editor subsystem in the first place.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "can you strip it and write a temporary script in the site that blocks dependency chain completely so the preview system stops injecting their script?"
        ]
      },
      "acceptanceCriteria": [
        "Frontend build succeeds after removing the suspected editor-related dependency chain (including any direct imports and transitive inclusions that can trigger editor/script injection heuristics).",
        "No editor-related packages/imports/runtime references remain in the built frontend output (e.g., no references indicative of draft editor tooling in the compiled JS).",
        "Draft preview loads and renders the app without requiring the temporary blocker to catch/neutralize injected draft editor scripts (blocker may remain in place, but should not be the only thing preventing a crash)."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture; do not introduce additional backend services.",
    "Do not modify files listed as immutable in SYSTEM_CONTEXT: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui.",
    "Keep all user-facing text in English.",
    "Do not change the homepage mission statement strings or the “PERMANENT HERO TEXT – DO NOT CHANGE IN FUTURE BUILDS” comment in frontend/src/App.tsx."
  ],
  "nonGoals": [
    "Implementing a permanent platform-level fix to Caffeine’s preview injection behavior (this is a temporary in-app mitigation).",
    "Adding new product features unrelated to fixing the preview blank-screen/injected-script failure.",
    "Changing backend logic, schema, or adding migrations unless strictly required for the preview mitigation (not expected)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}