{
  "kind": "build_request",
  "title": "Phase 4 Staking: Add read-only staking queries and upgrade-safe persistence",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add read-only backend query methods for staking records without changing existing user profile APIs: (1) a query that returns the caller’s staking record (returning null/empty/default when unset) and is gated by the existing #user permission check; (2) a query that returns a staking record for an arbitrary Principal, allowed only when the caller is that Principal or the caller is an admin, otherwise trap with an Unauthorized error message in English.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Run steps 2 and 3"
        ]
      },
      "acceptanceCriteria": [
        "When the caller lacks #user permission, the caller-staking query traps with an Unauthorized message in English.",
        "When the caller has #user permission and has no staking record stored, the caller-staking query returns a null/empty/default response (whichever matches the existing frontend expectations).",
        "When querying staking for an arbitrary Principal: (a) caller==target principal returns the record (or null/empty/default when unset); (b) admin caller returns the record (or null/empty/default when unset); (c) all other callers trap with an Unauthorized message in English.",
        "No staking/unstaking/reward logic is added; queries are strictly read-only."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure canister upgrades remain safe after adding staking state by updating the existing upgrade persistence mechanism (preupgrade/postupgrade and/or backend/migration.mo per the current codebase pattern) so staking records are persisted and restored correctly, and older deployments can upgrade with staking state initialized to empty/defaults.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Run steps 2 and 3"
        ]
      },
      "acceptanceCriteria": [
        "After an upgrade, existing non-staking state continues to load as before (no regressions).",
        "After an upgrade, staking records map/state is present and initialized (empty if none existed previously).",
        "If staking records existed pre-upgrade, they are retained post-upgrade.",
        "The upgrade path does not introduce new staking logic beyond persistence initialization."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor architecture with all Motoko logic in backend/main.mo (do not introduce additional backend services).",
    "Use English for any user-facing error text (e.g., Unauthorized traps)."
  ],
  "nonGoals": [
    "Do not implement staking/unstaking actions, locking/terms, reward accrual, or any governance voting logic.",
    "Do not modify existing user profile APIs or add profile fields as part of Steps 2 and 3."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}