{
  "kind": "build_request",
  "title": "Step 5: Earned contribution-points toast feedback after logging events",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a small shared earned-points toast helper/component that renders the message \"+X contribution points earned\" using the existing Sonner toaster, with an auto-dismiss duration of 2–3 seconds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "5.1 Create a small shared toast component for “+X contribution points earned”.",
          "5.6 Auto‑dismiss the toast after 2–3 seconds."
        ]
      },
      "acceptanceCriteria": [
        "A reusable module exists (component or helper) that can be called from multiple flows to show the earned-points toast.",
        "The toast displays the earned points in the form “+<number> contribution points earned”.",
        "Toast dismisses automatically after 2000–3000ms (inclusive)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Trigger the shared earned-points toast immediately after any successful contribution-log API call (i.e., after useContributionEventLogger().mutateAsync resolves with isDuplicate === false), replacing any ad-hoc toast usage in existing flows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "5.2 Trigger the toast immediately after a successful contribution‑log API call."
        ]
      },
      "acceptanceCriteria": [
        "At least the IssueProjectTasksTab flow no longer constructs its own Sonner toast message and instead uses the shared earned-points toast helper/component.",
        "The toast only fires on success results where isDuplicate is false (duplicate results do not show the toast).",
        "The toast is shown after the logContributionEvent call succeeds, not before."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Populate the toast’s “updated total points” (if shown) strictly from local React state (React Query cache) without performing any backend fetch; the implementation must read the latest cached contribution summary to derive the updated total.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "5.3 Pull the updated total points from the local React state (no backend fetch)."
        ]
      },
      "acceptanceCriteria": [
        "The toast logic reads total points from React Query cache (e.g., queryClient.getQueryData for the caller contribution summary) and does not call any actor method to fetch updated totals solely for the toast.",
        "If the cached total is unavailable, the toast still renders the earned-points message without crashing."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Show different user-facing toast messages depending on contribution action type (issue created, comment created, evidence added).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "5.4 Show different messages depending on the action type (issue, comment, evidence)."
        ]
      },
      "acceptanceCriteria": [
        "For each of the action types ISSUE_CREATED, COMMENT_CREATED, and EVIDENCE_ADDED, the toast uses distinct English phrasing (not the same generic sentence).",
        "The action type mapping uses the canonical constants in frontend/src/lib/contributionActionTypes.ts (no new divergent strings)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add Secretary-friendly English phrasing variants for earned-points toasts when the contributing action originates inside Secretary chat flows, and ensure chat-origin toasts use those variants.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "5.5 Add Secretary‑friendly phrasing for when actions originate inside chat flows."
        ]
      },
      "acceptanceCriteria": [
        "The shared toast API supports an explicit origin/context flag (e.g., \"chat\" vs \"standard\").",
        "When origin is \"chat\", the toast copy is adjusted to be Secretary-friendly English (e.g., acknowledges the action was completed via the assistant) for each relevant action type."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure the earned-points toast never appears twice if two actions fire quickly by implementing a simple client-side toast lock (time-based or in-flight boolean) within the shared toast helper/component.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "5.7 Ensure it never appears twice if two actions fire quickly (use a simple lock)."
        ]
      },
      "acceptanceCriteria": [
        "Rapid successive triggers (e.g., within a short window) result in at most one earned-points toast being shown.",
        "The lock is implemented centrally in the shared toast module (not duplicated per call site).",
        "The lock does not block unrelated toasts elsewhere in the app (scope limited to the earned-points toast)."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Do not fetch updated total points from the backend for the toast; use only local React state/React Query cache.",
    "Do not modify files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Backend remains single-actor; no backend changes are required for Step 5."
  ],
  "nonGoals": [
    "Adding new backend endpoints or changing backend reward/points logic.",
    "Implementing real-time updates or WebSocket-style push for point totals.",
    "Redesigning the global toast system beyond the earned-points toast behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}