{
  "kind": "build_request",
  "title": "Implement steps 1–3: Profile routes, profile view fields, and edit form UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Support two profile routes: /profile (read-only profile view) and /profile/edit (edit form). Routing must work with the current popstate-based navigation (no new router dependency) and must be reachable from the existing header/user menu navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-last"
        ],
        "quotes": [
          "Run prompts 1,2 and 3"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /profile renders a profile view screen for the authenticated user.",
        "Navigating to /profile/edit renders an edit form screen for the authenticated user.",
        "Navigation to /profile and /profile/edit works via window.history.pushState + PopStateEvent (consistent with existing HomeHeader navigation).",
        "Unauthenticated users visiting either /profile or /profile/edit see an authentication-required state with a login action."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement the /profile UI to display the core profile fields in a clean, mobile-first layout using existing Tailwind + shadcn components and Whisper styling. The view must include: avatar, display name, username/handle, bio, role/badges, location, join date, contribution stats, external links, and recent activity summary. For any fields not yet available from the backend, render sensible placeholders/empty states without breaking existing functionality.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-last"
        ],
        "quotes": [
          "Run prompts 1,2 and 3"
        ]
      },
      "acceptanceCriteria": [
        "The /profile page displays an avatar with fallback when no image is set.",
        "The /profile page displays the saved display name from the existing profile data source when available.",
        "The /profile page includes UI sections for: handle, bio, role/badges, location, join date, contribution stats, external links, and recent activity summary.",
        "If a field is missing/unavailable, the UI shows an empty/placeholder state (no crashes, no console errors from undefined access).",
        "The page remains responsive on mobile and meets basic accessibility expectations (labels for key fields, accessible button text)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement the /profile/edit UI as an edit form that lets the authenticated user update: display name, bio, avatar upload/removal, external links (1–3), and preferences (at minimum provide UI controls for preferences even if persistence is deferred). The edit page must provide Save/Cancel behavior and route back to /profile on cancel and on successful save.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-last"
        ],
        "quotes": [
          "Run prompts 1,2 and 3"
        ]
      },
      "acceptanceCriteria": [
        "The /profile/edit page includes form controls for display name, bio, avatar upload/removal, and 1–3 external links.",
        "The existing avatar upload validations (image type and max size) remain enforced.",
        "Cancel returns the user to /profile without saving changes.",
        "Save persists at least the fields currently supported by the backend (display name + avatar) via the existing save hook; fields not yet supported by the backend must not break save and should have clear non-blocking behavior (e.g., remain local-only or show as 'not yet supported' without failing the save).",
        "After a successful save, the /profile view reflects the updated name/avatar (via React Query invalidation or refetch)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend/src/components/ui (read-only UI component sources). Compose them instead.",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Do not introduce a new routing framework; use the existing popstate + pathname approach already used in frontend/src/App.tsx and frontend/src/components/common/HomeHeader.tsx.",
    "Keep changes scoped to steps 1–3 only; do not implement backend schema expansions or admin deletion-request flows in this build."
  ],
  "nonGoals": [
    "Adding or changing Motoko backend types/methods for the additional profile fields (bio, handle, role, location, stats, links, activity).",
    "Implementing the account deletion request flow or admin review UI.",
    "Modifying unrelated Whisper subsystems (Secretary, geography DB, instance creation, proposals, moderation, tokenomics).",
    "Implementing real messaging/DM functionality."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}