{
  "kind": "build_request",
  "title": "Add backend getStakingInfo query and read-only staking UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a basic backend query method named getStakingInfo that returns the caller’s staking information using the existing StakingRecord type and stakingRecords storage.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "run steps 4. Add a basic getStakingInfo method"
        ]
      },
      "acceptanceCriteria": [
        "The Motoko canister exposes a public query method named getStakingInfo.",
        "getStakingInfo returns a nullable StakingRecord for the caller (null when no record exists).",
        "The method is included in the generated frontend candid bindings (frontend can import/call it via the actor).",
        "No state-breaking changes are introduced to existing staking storage (stakingRecords continues to be the source of truth)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a read-only staking UI in the Profile page that fetches staking info from the backend using getStakingInfo and displays Total Staked, Available Balance, Locked Balance, and Pending Rewards, with loading and empty states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "and 5. Add frontend staking UI (read-only)"
        ]
      },
      "acceptanceCriteria": [
        "A React Query hook exists to fetch staking info from the backend getStakingInfo method (identity-scoped caching, consistent with existing query patterns).",
        "The Profile page renders a Staking section card (read-only) showing the four staking fields formatted with the existing token amount formatter.",
        "While the query is loading, the staking section shows a loading indicator.",
        "When the backend returns null, the staking section shows an English empty-state message indicating no staking record is available.",
        "No stake/unstake actions or inputs are present in the staking UI."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit any files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implement staking mutations (stake, unstake, claim rewards).",
    "Add any real-time updates or background polling beyond existing React Query defaults.",
    "Add third-party auth or wallets (only Internet Identity is supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}