{
  "kind": "build_request",
  "title": "Step 7: Admin UI for inspecting contribution logs (filters, pagination, links, admin-only access)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a dedicated Admin page section labeled \"Contribution Logs\" that is visible within the Admin area and uses English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Run Step 7: Add admin UI for inspecting contribution logs • 7.1 Add a new Admin page section labeled “Contribution Logs”."
        ]
      },
      "acceptanceCriteria": [
        "Admin area includes a clearly labeled section titled \"Contribution Logs\".",
        "All user-facing labels/messages in the section are in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fetch contribution logs using the existing admin-only backend API endpoints and display them without loading all entries at once.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "7.2 Fetch logs using the existing admin‑only API endpoint.",
          "7.5 Add pagination to avoid loading everything at once."
        ]
      },
      "acceptanceCriteria": [
        "The logs list is populated via the existing admin-only endpoints already used by the app (e.g., paginated global admin logs).",
        "The UI does not attempt to load all logs at once; it uses pagination/incremental loading."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Render contribution log entries in a simple, scannable list format that includes: user (principal), action type, points, and timestamp.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "7.3 Display entries in a simple list: user, action type, points, timestamp."
        ]
      },
      "acceptanceCriteria": [
        "Each log entry row/card shows: user identifier (principal), action type, points, and a human-readable timestamp.",
        "The list remains readable on mobile widths (no horizontal overflow for key fields; long principals are truncated/wrapped appropriately)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add filters to the Contribution Logs section for (a) action type and (b) date (range or from/to), and apply them to the displayed entries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "7.4 Add filters for action type and date."
        ]
      },
      "acceptanceCriteria": [
        "An action type filter is available (e.g., dropdown/select) and can narrow the visible entries.",
        "A date filter is available (e.g., from/to date inputs) and can narrow the visible entries by timestamp.",
        "Changing filters updates the displayed entries consistently (including empty-state messaging when no entries match)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add pagination controls for the contribution logs view(s) so admins can navigate through multiple pages of results, and clearly indicate what range/page is currently shown.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "7.5 Add pagination to avoid loading everything at once."
        ]
      },
      "acceptanceCriteria": [
        "Pagination controls allow navigating forward/back through pages (or loading more/previous) for global contribution logs.",
        "The UI indicates the current slice of results (e.g., offset/range or page index).",
        "Pagination continues to work correctly when filters are applied (e.g., resets offset appropriately or prevents confusing ranges)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Link each log entry to its related issue/comment/evidence item when a reference identifier is present, and handle unknown/unlinkable references gracefully.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "7.6 Link each log entry to the related issue/comment/evidence item."
        ]
      },
      "acceptanceCriteria": [
        "If a log entry includes a referenceId, the UI presents it as a clickable link or action that navigates to the related entity using existing app navigation patterns/routes.",
        "If an entry cannot be linked (unknown type, missing route, or invalid referenceId), the UI displays the reference as non-clickable text (no broken links)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Ensure only administrators can access the Contribution Logs section/page by enforcing admin gating in the UI and preventing non-admin users from viewing log data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "7.7 Ensure only admins can access the page."
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated users are prompted to log in before seeing any admin content.",
        "Authenticated non-admin users are shown an access denied state and do not see contribution logs content.",
        "When not an admin, the app does not execute contribution-log fetch queries (no admin log calls triggered)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Ensure the Contribution Logs UI is mobile responsive and matches the existing admin styling conventions (cards, spacing, typography, and states for loading/error/empty).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "7.8 Confirm mobile responsiveness and clean admin styling."
        ]
      },
      "acceptanceCriteria": [
        "On mobile, the Contribution Logs section remains usable (filters accessible, list readable, pagination reachable) without layout breakage.",
        "Loading, error, and empty states are visually consistent with the existing Admin page styling."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only UI components must be composed, not edited).",
    "Do not modify immutable frontend hook bootstrap files (e.g., useInternetIdentity/useActor/main.tsx) listed in SYSTEM_CONTEXT. Use composition/wrapper logic elsewhere if needed.",
    "Backend must remain a single Motoko actor in backend/main.mo; add migration.mo only if state schema changes are required."
  ],
  "nonGoals": [
    "Implementing new backend admin endpoints for filtering/pagination beyond what already exists (UI should rely on existing endpoints and/or client-side filtering on fetched pages).",
    "Adding non-admin user-facing contribution log browsing features.",
    "Changing contribution points awarding logic or how logs are written on the backend."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}