{
  "kind": "build_request",
  "title": "Connect contribution rewards to issue-flow actions (issue, comment, evidence)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Define centralized contribution reward values for the three issue-flow actions: issue creation, comment creation, and evidence upload. Store the mapping in the backend so the server (not the frontend) is the source of truth for points and rewardType per action.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Run step 1. Connect contribution rewards to issue‑flow actions 1.1 Define reward values for each action (issue, comment, evidence)"
        ]
      },
      "acceptanceCriteria": [
        "Backend has a single, centralized mapping from actionType -> {points, rewardType} for: issue creation, comment creation, evidence upload.",
        "The mapping is used by backend logging logic (i.e., frontend does not send arbitrary points to be trusted).",
        "Action type strings are documented/consistent across backend + frontend (single canonical set)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend logic to log contribution events for the three issue-flow actions using the existing contribution log structures in backend/main.mo. Implement a single backend entrypoint that the frontend can call with (actionType, referenceId?, details?) and the backend will: validate actionType, resolve reward values from the centralized mapping, write a ContributionLogEntry, and return the created log entry id.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1.2 Add backend logic to log these new contribution events",
          "1.3 Update frontend calls so each action triggers the log entry"
        ]
      },
      "acceptanceCriteria": [
        "A new or updated backend method exists that allows the frontend to record an event by actionType and optional referenceId/details, and the backend determines pointsAwarded + rewardType from configured criteria.",
        "On success, the backend returns the created contribution log entry id.",
        "Unauthorized callers are rejected using existing authorization checks (consistent with current contribution log methods)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add guardrails in the backend to prevent duplicate or invalid contribution events. At minimum: reject unknown actionType values, reject events with missing/invalid referenceId when required for that action, and prevent duplicate awards for the same (caller, actionType, referenceId) combination.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1.4 Add guardrails for duplicates or invalid events"
        ]
      },
      "acceptanceCriteria": [
        "If actionType is not one of the supported issue-flow action types, the backend rejects the request with a clear error message.",
        "Duplicate submissions for the same (caller, actionType, referenceId) do not create additional ContributionLogEntry records and do not award additional points.",
        "Backend enforces basic input constraints (e.g., referenceId length bounds and/or details length bounds) to avoid unbounded storage abuse.",
        "Guardrails are applied consistently regardless of which frontend screen triggers the event."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the frontend so each issue-flow action triggers the backend contribution log entry after a successful action. Specifically, after successful completion of: (a) issue creation, (b) comment creation, (c) evidence upload, the frontend must call the backend contribution-event logging entrypoint with the correct actionType and a stable referenceId for deduplication (e.g., proposal/issue identifier, comment identifier, evidence/blob identifier).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1.3 Update frontend calls so each action triggers the log entry"
        ]
      },
      "acceptanceCriteria": [
        "Creating an issue results in exactly one new contribution log entry for the caller.",
        "Creating a comment results in exactly one new contribution log entry for the caller.",
        "Uploading evidence results in exactly one new contribution log entry for the caller.",
        "If the same frontend action is retried (e.g., user double-clicks, network retry, refresh), the backend dedupe prevents multiple awards, and the frontend handles the duplicate response without breaking the UI."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure frontend state that depends on contribution logs/points can be refreshed after these new events. After a successful contribution log call, invalidate/refetch the React Query cache for the caller’s contribution summary so earned totals are up to date for any pages that display them.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Connect contribution rewards to issue‑flow actions"
        ]
      },
      "acceptanceCriteria": [
        "After any of the three actions, the caller contribution summary query (useCallerContributionSummary) is invalidated/refetched so subsequent renders show updated totals.",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT (compose existing hooks/components instead)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko architecture (all logic in backend/main.mo).",
    "Do not modify files under frontend immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add UI to display “earned points” notifications/toasts in this step (that is Phase 2 step 2).",
    "Do not expand the admin dashboard contribution logs UI (that is Phase 2 step 4).",
    "Do not change authentication providers (Internet Identity only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}