{
  "kind": "build_request",
  "title": "Phase 4 Secretary integration: add task intents (create_task, find_tasks, update_task)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the Secretary intent type system to include three new intents: create_task, find_tasks, and update_task.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "Run Phase 4: Secretary integration • Add Secretary intents: create_task, find_tasks, update_task."
        ]
      },
      "acceptanceCriteria": [
        "TypeScript type `SecretaryIntent` (frontend/src/secretary/intent/types.ts) includes 'create_task', 'find_tasks', and 'update_task'.",
        "All intent-related modules compile without TypeScript errors after adding the new intents."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add task-related slot definitions required to fulfill the new task intents, including at minimum: task title, task description, task category, location identifier, and task identifier (for updates). Ensure an empty slot bag can be created and slot fill/clear checks work for the new slots.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "Add Secretary intents: create_task, find_tasks, update_task."
        ]
      },
      "acceptanceCriteria": [
        "`SecretarySlot`, `SlotBag`, and `createEmptySlotBag()` support the new task slots in frontend/src/secretary/intent/types.ts and frontend/src/secretary/intent/slotState.ts.",
        "`isSlotFilled`, `clearSlot`, and any dependent-slot clearing logic handle the new task slots correctly (no runtime exceptions when clearing/filling)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the rule-based intent classifier to recognize the new intents from common user phrasing (e.g., “create a task”, “show tasks”, “find tasks”, “update task”, “mark task done”), without breaking existing intents.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "Add Secretary intents: create_task, find_tasks, update_task."
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/secretary/intent/intentClassifier.ts returns 'create_task' for at least one create-task phrasing, 'find_tasks' for at least one list/find phrasing, and 'update_task' for at least one update/mark-done phrasing.",
        "Existing classifications (e.g., report_issue, find_instance, create_instance, ask_category, top_issues) still work as before (no dead code or unreachable logic introduced)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Register the new intents in the intent flow registry with required/optional slots and a slot fill order, and define completion behavior hooks for each intent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "Add Secretary intents: create_task, find_tasks, update_task."
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/secretary/intent/flowRegistry.ts contains flow definitions for create_task, find_tasks, and update_task, each with a `slotOrder` and `requiredSlots`.",
        "Each new intent has an `onComplete` implementation that triggers the corresponding task operation (create/list/update) or navigates to an appropriate task UI route when necessary."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add English slot-filling prompts for the new task slots so the Secretary can ask for missing task information during an intent flow (e.g., ask for title, description, location, category, and which task to update).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/secretary/copy/secretaryPrompts.ts `buildSlotPrompt(...)` returns appropriate English prompts for each new task slot.",
        "When a task intent is active and a required slot is missing, the UI shows the corresponding prompt rather than the generic fallback prompt."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Integrate the task intent system into the Secretary runtime so task intents are actually executed from chat input: when user text is received, classify to a task intent when appropriate, run slot-filling using the intent flow runner, and on completion call the existing task backend methods via the current actor (createTask, listTasksByLocation, getTask/updateTask) and present a short English confirmation/result message in the Secretary chat.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "Run Phase 4: Secretary integration • Add Secretary intents: create_task, find_tasks, update_task."
        ]
      },
      "acceptanceCriteria": [
        "When the user types a create-task message, the Secretary gathers missing required slots (via prompts) and then calls the existing create task backend path (as used by frontend/src/hooks/useTasks.ts `useCreateTask`).",
        "When the user types a find-tasks message and provides/has a location, the Secretary calls the existing list tasks backend path (as used by frontend/src/hooks/useTasks.ts `useListTasksByLocation`) and prints a readable summary (e.g., first N tasks with titles and statuses) in the chat.",
        "When the user types an update-task message and provides/has enough identifiers, the Secretary calls the existing update task backend path (as used by frontend/src/hooks/useTasks.ts `useUpdateTaskStatus`, i.e., actor.updateTask(...)) and confirms the update in chat.",
        "No changes are made to immutable frontend paths (per SYSTEM_CONTEXT), and the app builds successfully."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (these paths are immutable).",
    "Keep all backend logic in the single Motoko actor (backend/main.mo); only add backend changes if the existing task APIs needed by the Secretary intents are missing."
  ],
  "nonGoals": [
    "Add third-party authentication providers (only Internet Identity is supported).",
    "Add real-time messaging or WebSocket-based updates for tasks.",
    "Introduce new backend services or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}