{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Front-page Secretary discoverability greeting/tooltip",
  "requirements": [
    {
      "id": "REQ-46",
      "summary": "Add a small, dismissible greeting/tooltip in the main app shell that highlights the Secretary feature and provides a CTA to open the existing Secretary widget, with client-side persistence.",
      "acceptanceCriteria": [
        "A small greeting/tooltip is visible somewhere in the main app shell (e.g., near the header actions area and/or near the floating Secretary button) when the user first visits or until dismissed.",
        "The greeting/tooltip includes an explicit, English call-to-action that references the existing Secretary feature (e.g., \"Need help? Click Secretary to get started.\") and provides a clickable control that opens the Secretary widget.",
        "The greeting/tooltip can be dismissed by the user and stays dismissed for that user across page reloads (client-side persistence is acceptable).",
        "All user-facing text in the greeting/tooltip is in English.",
        "The greeting/tooltip styling uses existing Tailwind + shadcn components/tokens and matches the established civic theme (no new color palette).",
        "The greeting/tooltip is accessible: keyboard-operable controls, visible focus states, and appropriate aria-labels for icon-only dismiss/close controls (if used)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/secretary/SecretaryDiscoverabilityNudge.tsx",
          "operation": "create",
          "description": "Create a small, non-intrusive greeting/tooltip component that uses existing shadcn/ui components (e.g., Card, Button) and Tailwind tokens to match the civic theme; includes English copy referencing Secretary, an explicit CTA button that triggers an onOpenSecretary callback, and an icon-only dismiss control with aria-label and keyboard support. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useLocalStorageState.ts",
          "operation": "create",
          "description": "Add a lightweight React + TypeScript hook to read/write a dismissed flag in localStorage (with safe defaults and SSR guards) so the greeting/tooltip stays dismissed across reloads."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new SecretaryDiscoverabilityNudge into the main app shell (e.g., positioned near the Secretary button area and/or near the floating widget region). Connect the CTA to setIsSecretaryOpen(true), hide the nudge when dismissed (persisted via the localStorage hook) and optionally when the Secretary widget is already open. Ensure all new user-facing text is English and uses existing Tailwind + shadcn tokens. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}