{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Deployment docs: clean rebuild/redeploy procedure + draft deployment troubleshooting",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Expand deployment documentation with a clear clean rebuild + redeploy procedure and troubleshooting notes for intermittent Caffeine draft deployment failures and the known draft preview disallowed-origin console error.",
      "acceptanceCriteria": [
        "`frontend/docs/DEPLOYMENT.md` contains a clearly labeled section for performing a clean rebuild and redeploy, with concrete steps a developer can follow.",
        "`frontend/docs/DEPLOYMENT.md` includes a troubleshooting section that mentions intermittent platform-level draft deployment failures and recommends retrying a clean rebuild/redeploy when they occur.",
        "The troubleshooting section mentions the known draft preview console error `draft-editor:error disallowed origin: https://just-olive-eim-draft.caffeine.xyz` as a platform preview issue, without attributing it to application code.",
        "All new/updated documentation text is written in English."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Rewrite/extend the deployment guide to (1) add a clearly labeled “Clean rebuild and redeploy” section with concrete steps to clear local build artifacts/caches (e.g., dependency install artifacts, build outputs, tool caches as applicable) and then rebuild + redeploy using the project’s existing tooling/scripts; and (2) add a “Troubleshooting” section that explicitly covers intermittent Caffeine draft deployment failures with retry guidance and explicitly documents the known draft preview console error `draft-editor:error disallowed origin: https://just-olive-eim-draft.caffeine.xyz` as a platform preview issue (not application code). Ensure all documentation text is in English and avoid introducing new tools or workflows beyond what the repo already uses."
        }
      ]
    }
  ]
}