{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Secretary slot-filling: auto-prefill, category suggestions, and robust geography typeahead selection",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Auto-enter slot-filling from a single message, prefill geography and initial report_issue description, and prompt only for remaining required slots (English prompts).",
      "acceptanceCriteria": [
        "When the user types a single message like “Potholes in Omaha, Nebraska near 72nd street”, the Secretary enters slot-filling mode, pre-fills the state (and place when possible), sets a reasonable initial issue_description, and only prompts for missing required slots (e.g., category) instead of restarting at the menu.",
        "When geography cannot be reliably extracted, the Secretary prompts for the missing geography slot using the existing slot prompt copy.",
        "All prompts and recovery messages shown during slot-filling are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/secretary/brain/FlowEngineBrain.ts",
          "operation": "modify",
          "description": "Extend slot-filling entry from the menu so that after intent classification it also pre-fills report_issue.issue_description from the same user message (using a simple, deterministic heuristic that removes detected geography phrases when possible), while retaining the existing geography prefill behavior and English slot prompts for any remaining required slots."
        },
        {
          "path": "frontend/src/secretary/intent/issueDescriptionNlp.ts",
          "operation": "create",
          "description": "Add a small, deterministic helper to derive an initial issue_description from a single free-text message given any extracted state/county/place (e.g., strip matched geography tokens and common connectors like “in/near/at”, fallback to original text if stripping is unreliable)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "When issue_category is the next missing slot during report_issue slot-filling, fetch and show category suggestions based on filled geography level and issue_description; allow click-to-fill or fallback to typed category (English).",
      "acceptanceCriteria": [
        "During report_issue slot-filling, once issue_description is filled and issue_category is the next missing slot, the UI shows suggested categories.",
        "Clicking a suggested category fills the issue_category slot and advances the slot-filling flow.",
        "If no suggestions are returned, the Secretary asks the user to type a category (English prompt) and uses the next user message to fill issue_category."
      ],
      "file_operations": [
        {
          "path": "frontend/src/secretary/brain/FlowEngineBrain.ts",
          "operation": "modify",
          "description": "In intent-slot-filling mode, when next missing slot becomes issue_category for report_issue and issue_description is present, compute suggestions via the existing FlowRunner complaint-suggestion capability using the most specific filled geography level (place > county > state). Store the resulting suggestions for the UI; if none are returned, emit an English prompt that asks the user to type a category and allow the next user text to fill issue_category."
        },
        {
          "path": "frontend/src/components/secretary/SecretaryWidget.tsx",
          "operation": "modify",
          "description": "Change suggested-category UI behavior so clicking a suggestion immediately submits it through the brain (treat as filling issue_category and advancing slot-filling), rather than only copying it into the input box."
        },
        {
          "path": "frontend/src/secretary/copy/secretaryPrompts.ts",
          "operation": "modify",
          "description": "Refine issue_category prompting copy to support both cases: (1) suggestions available (English prompt introducing suggested categories), (2) no suggestions available (English prompt asking the user to type a category)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make location typeahead selection fill whichever geography slot is currently active (state/county/place) and advance slot-filling reliably without relying on undefined brain methods.",
      "acceptanceCriteria": [
        "When the next slot is state, selecting a state from the typeahead fills the state slot and triggers the next prompt.",
        "When the next slot is county or place, selecting an option from the typeahead fills the correct slot and triggers the next prompt.",
        "Typeahead selection does not rely on undefined/non-existent brain methods; slot determination and filling works reliably."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/secretary/SecretaryWidget.tsx",
          "operation": "modify",
          "description": "Fix typeahead selection handler to determine the active geography slot using the shared slot-filling logic (import getNextMissingSlot from the intent runner), then delegate selection to the brain in a slot-aware way for state/county/place, and ensure the flow advances to the next prompt."
        },
        {
          "path": "frontend/src/secretary/brain/FlowEngineBrain.ts",
          "operation": "modify",
          "description": "Add a dedicated method for geography typeahead selections that fills the correct currently-missing geography slot using the selected option’s data (USState/USCounty/USPlace), clears dependent slots when appropriate (e.g., state change clears county/place), and then continues slot-filling to the next prompt."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure slot-filling completion triggers the existing intent navigation, then visibly resets to the main menu with an English confirmation message.",
      "acceptanceCriteria": [
        "For report_issue, once required slots are filled, the Secretary navigates via the existing navigation handler to the proposals/reporting destination and closes the widget when requested by the completion handler.",
        "After completion, the Secretary conversation resets and shows an English prompt like “Done! Anything else I can help with?” on the next visible state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/secretary/brain/FlowEngineBrain.ts",
          "operation": "modify",
          "description": "Harden completion behavior for intent-slot-filling: after all required slots are filled, invoke the existing completion navigation helper for that intent (ensuring it requests widget close where already defined), then reset context to menu state and enqueue a single English confirmation prompt for the next visible state."
        },
        {
          "path": "frontend/src/components/secretary/SecretaryWidget.tsx",
          "operation": "modify",
          "description": "Ensure the widget message-sync logic correctly reflects the post-completion reset state (including the English confirmation message) after the brain triggers navigation/closure via the existing navigationHandler."
        }
      ]
    }
  ]
}