{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Warm hero photo swap, warmer overlay gradient, and teal CTA contrast consistency",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Swap hero background to the new warm/neutral real-life community collaboration photo and ensure cache-busted delivery.",
      "acceptanceCriteria": [
        "Hero background image in the hero section uses the new generated asset (not the prior version) and the image clearly depicts a real-life community collaboration scene.",
        "Refreshing the page (including hard refresh) consistently shows the latest hero image (implement cache-busting via filename change and/or versioned asset reference).",
        "Hero image remains full-bleed and properly cropped (object-cover) across mobile and desktop without distortion."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/whisper-hero-community-real-warm-v3.dim_1600x900.png",
          "operation": "create",
          "description": "Add the edited/generated hero image asset with warmer/neutral white balance as specified (cache-busting via new filename)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the hero <img> source to use the new asset at frontend/public/assets/generated/whisper-hero-community-real-warm-v3.dim_1600x900.png (ensuring cache-busted reference) while keeping full-bleed object-cover behavior and current cropping intent."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Warm/neutral-tune the hero overlay gradient and opacity to preserve photo visibility while keeping headline/body text readable.",
      "acceptanceCriteria": [
        "Overlay gradient tint is adjusted away from overly cool/dark rendering and reads as warm/neutral while still fitting the existing civic-teal design language.",
        "Overlay opacity is tuned so the hero photo remains clearly recognizable (not overly obscured), while the hero headline and paragraph remain readable against the full image.",
        "Hero headline and description remain visually legible at common breakpoints (mobile + desktop) without relying on the image being unusually dark."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a dedicated hero overlay utility/class (Tailwind @apply-based) that uses warm/neutral-leaning gradient stops with teal continuity and tuned opacity for readability; keep within existing Tailwind + CSS variable token system (no raw hex)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace the current hero overlay gradient classes with the new warm/neutral overlay utility (or updated Tailwind classes) and adjust opacity levels so the updated photo remains recognizable while maintaining strong text readability."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix CTA styling so 'Get Started' never becomes white-on-white and standardize CTAs to a consistent teal-forward palette with proper hover/focus-visible states.",
      "acceptanceCriteria": [
        "The header \"Get Started\" button has sufficient contrast between text and background in both light and dark modes (no white-on-white).",
        "Primary CTAs use the existing teal accent styling (accent + accent-hover) with clear hover, active, and focus-visible states.",
        "Button styling remains consistent across the header and hero CTAs (radius, borders, shadows), without introducing ad-hoc raw colors (use existing Tailwind tokens/CSS variables)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Define reusable CTA utility classes for primary teal CTAs (bg-accent, text using accent foreground, hover:bg-accent-hover, and focus-visible ring using existing tokens) to ensure consistent contrast and interaction states across the app."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Apply the shared CTA utilities to the header 'Get Started' button and hero primary CTA (and any other primary-accent CTAs in this file) using the existing shadcn-ui Button component for consistent radius/border/shadow/focus behavior. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}