{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Secretary intent/slot mini-flow engine integrated with geography + issue categories",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Represent core intents and per-intent slot state in Secretary context with independent slot reset support.",
      "acceptanceCriteria": [
        "Secretary state includes fields for activeIntent and per-intent slot values (filled/unfilled).",
        "Slot values can be reset independently without resetting the entire conversation (to support repair behavior later)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/secretary/flow/types.ts",
          "operation": "modify",
          "description": "Extend SecretaryContext typing to include activeIntent and a slot-bag structure that can track filled/unfilled values for slots (state, county, city/place, issue_category, issue_description) per intent."
        },
        {
          "path": "frontend/src/secretary/state/secretaryContext.ts",
          "operation": "modify",
          "description": "Initialize and reset new intent/slot fields in createInitialContext/reset helpers; add new helpers for resetting individual slots and dependent slots without wiping messages/conversation."
        },
        {
          "path": "frontend/src/secretary/intent/types.ts",
          "operation": "create",
          "description": "Define SecretaryIntent and SecretarySlot type unions plus slot value shapes used by the intent/slot engine (no UI)."
        },
        {
          "path": "frontend/src/secretary/intent/slotState.ts",
          "operation": "create",
          "description": "Add pure slot-state utilities (getSlot, setSlot, clearSlot, clearDependentSlots, isSlotFilled) to support independent reset/repair and future reuse."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a rule-based client-side intent classifier for free-text input that maps to supported intents and safely falls back on unknown behavior.",
      "acceptanceCriteria": [
        "Typing a supported command (e.g., \"report an issue\", \"create instance\", \"find my city\", \"category\") selects the corresponding intent reliably.",
        "Unknown text does not crash; it falls back to existing unknown/recovery behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/secretary/intent/intentClassifier.ts",
          "operation": "create",
          "description": "Implement a small keyword/pattern-based classifier that maps user free text to one of: report_issue, find_instance, create_instance, ask_category; return null/unknown when no match."
        },
        {
          "path": "frontend/src/secretary/brain/FlowEngineBrain.ts",
          "operation": "modify",
          "description": "Invoke the intent classifier on user free-text (especially from menu and during slot-filling). When an intent is recognized, set activeIntent and hand off to the slot-filling runner; when unknown, keep existing unknown/recovery handling."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement per-intent slot-filling prompts that ask for the next missing required slot and accept input via existing UI controls until complete.",
      "acceptanceCriteria": [
        "For `report_issue`, the assistant collects geography (if missing), then issue_description and issue_category (via suggestions/custom entry).",
        "For `create_instance`, the assistant collects geography slots needed to navigate into the instance-creation flow (or to preselect values where supported).",
        "For `find_instance`, the assistant collects geography slots and then routes to the closest existing discovery/top-issues functionality.",
        "The assistant never asks for slots that are already filled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/secretary/intent/flowRunner.ts",
          "operation": "create",
          "description": "Create an intent/slot mini-runner that: (1) determines the next missing slot from the active flow, (2) emits a prompt/view-model request, (3) consumes user input/actions to fill slots, and (4) triggers completion when all required slots are filled."
        },
        {
          "path": "frontend/src/secretary/copy/secretaryCopy.ts",
          "operation": "modify",
          "description": "Add English copy strings for intent/slot prompts (ask for state/county/place, ask for issue description, ask to pick/enter category, and clarifying messages) consistent with existing Secretary copy pattern."
        },
        {
          "path": "frontend/src/secretary/copy/secretaryPrompts.ts",
          "operation": "modify",
          "description": "Add prompt builders for slot-filling questions (including reflecting already-known geography) so prompts stay composable and consistent."
        },
        {
          "path": "frontend/src/secretary/brain/FlowEngineBrain.ts",
          "operation": "modify",
          "description": "Integrate the new slot-filling runner with the existing brain so that when activeIntent is set, the brain produces the appropriate view model and routes text/typeahead selections to slot fill handlers."
        },
        {
          "path": "frontend/src/secretary/ui/secretaryViewModel.ts",
          "operation": "modify",
          "description": "Extend view-model preparation to support the slot-filling UI states (showing text input vs typeahead vs suggestions) without requiring changes to core SecretaryWidget layout."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Wire geography slot-filling to existing state/county/place data used by typeahead so selecting an option fills slots and advances prompts.",
      "acceptanceCriteria": [
        "When the next missing slot is `state`, the Secretary shows state typeahead options sourced from existing geography queries.",
        "When the next missing slot is `county` or `place`, the Secretary shows the appropriate combined county/place options for the selected state (consistent with current discovery behavior).",
        "Selecting a typeahead option fills the corresponding slot and advances to the next missing slot prompt."
      ],
      "file_operations": [
        {
          "path": "frontend/src/secretary/brain/FlowEngineBrain.ts",
          "operation": "modify",
          "description": "Update getTypeaheadOptions() to return geography options not only for discovery nodes, but also when the active intent’s next missing slot is state/county/place, using the already-provided allStates/countiesForState/placesForState lists."
        },
        {
          "path": "frontend/src/components/secretary/SecretaryWidget.tsx",
          "operation": "modify",
          "description": "Update typeahead selection handling to route selected state/county/place into the slot-filling action path (in addition to existing discovery node handling), and ensure UI advances to the next slot prompt."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Show issue category suggestions after issue description using selected geography level, allow selecting a suggestion or entering a custom category, and store in issue_category slot.",
      "acceptanceCriteria": [
        "Given a filled geography slot set and a provided issue_description, the UI shows category suggestions (and supports “Something else” leading to custom category entry).",
        "If backend complaint-category suggestion endpoints are missing or incomplete, implement them in `backend/main.mo` using stable data arrays for city/county/state categories consistent with `frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md`.",
        "All user-facing copy for prompts and buttons remains in English and is consistent with the existing Secretary copy pattern."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useComplaintSuggestions.ts",
          "operation": "modify",
          "description": "Align the suggestions hook usage with the intent/slot flow so suggestions are fetched based on the slot-derived geography level and the provided issue description; ensure empty/missing suggestions degrade gracefully."
        },
        {
          "path": "frontend/src/components/secretary/SecretaryWidget.tsx",
          "operation": "modify",
          "description": "Wire the intent/slot flow’s category-selection step to the existing suggestions UI: render suggestion buttons when available, include a “Something else” affordance that transitions to custom category entry, and persist the chosen/custom category into the issue_category slot."
        },
        {
          "path": "frontend/docs/COMPLAINT_CATEGORY_SUGGESTIONS_SPEC.md",
          "operation": "modify",
          "description": "Add a short note clarifying how the frontend slot-filling flow consumes category suggestions (by geography level + search term) so frontend/backend expectations stay aligned."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Define completion rules that trigger the intent’s action via existing navigation/flows once all required slots are filled.",
      "acceptanceCriteria": [
        "`report_issue` completion triggers the same downstream behavior as the current report flow completion (navigation requested to issue project, or equivalent existing behavior).",
        "`create_instance` completion navigates to the existing Create Instance destination and closes the Secretary widget.",
        "`find_instance` completion routes into the existing discovery/top-issues presentation for the filled geography (or navigates to the appropriate page/dialog if that is the current pattern)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/secretary/intent/flowRegistry.ts",
          "operation": "create",
          "description": "Define completion actions per intent that call existing navigation patterns: report_issue triggers the existing issue-project navigation request mechanism; create_instance navigates to the create-instance destination and requests widget close; find_instance navigates into the existing discovery/top-issues flow for the filled geography."
        },
        {
          "path": "frontend/src/secretary/brain/FlowEngineBrain.ts",
          "operation": "modify",
          "description": "On intent completion, invoke the flow registry’s completion action using existing navigationHandler / project-navigation signaling so behavior matches current menu actions and report flow completion."
        },
        {
          "path": "frontend/src/hooks/useSecretaryNavigationRegistry.ts",
          "operation": "modify",
          "description": "If needed for find_instance/create_instance completion, ensure required destination IDs are registered and accessible to the brain’s navigation handler without introducing new routes."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add repair behavior so user corrections reset only relevant slots (and dependent slots) and continue slot filling without wiping the conversation.",
      "acceptanceCriteria": [
        "Changing a higher-level geography slot clears only dependent geography slots and preserves non-dependent slots (e.g., preserves description/category if still applicable per flow rules).",
        "The assistant confirms/reflects the updated slot state via its next prompt without requiring a full reset to menu."
      ],
      "file_operations": [
        {
          "path": "frontend/src/secretary/intent/repair.ts",
          "operation": "create",
          "description": "Implement lightweight repair detection/parsing for user messages (e.g., leading cues like “actually”, “sorry”, “I meant”) to infer intent to update specific slot(s), and utilities to clear dependent slots (state -> county/place; county -> place)."
        },
        {
          "path": "frontend/src/secretary/state/secretaryContext.ts",
          "operation": "modify",
          "description": "Add context-level helpers to apply a slot repair update while preserving messages and unrelated slot values; ensure dependent geography slots are cleared appropriately."
        },
        {
          "path": "frontend/src/secretary/brain/FlowEngineBrain.ts",
          "operation": "modify",
          "description": "During active slot-filling, attempt to apply repair logic before treating input as the next slot value; after repair, continue prompting for the next missing slot and reflect updated state in the next assistant prompt."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Create a centralized flow registry mapping intent -> required slots, prompt order, and completion action with extension hooks for future intents.",
      "acceptanceCriteria": [
        "Intent-to-flow mapping is defined in a single, discoverable module (registry) rather than scattered conditionals.",
        "Adding a new intent requires adding a registry entry and minimal glue code, not rewriting the core runner/widget.",
        "Existing Secretary flow-engine nodes/transitions continue to work (no regressions in menu, discovery, report-issue)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/secretary/intent/flowRegistry.ts",
          "operation": "create",
          "description": "Implement the flow registry: required slot list, prompt order, and completion action per intent; expose an API for registering/extending flows so future intents can be added with minimal changes."
        },
        {
          "path": "frontend/src/secretary/intent/index.ts",
          "operation": "create",
          "description": "Export registry and types from a single barrel module to keep the intent/slot system discoverable for future extension."
        },
        {
          "path": "frontend/src/secretary/brain/FlowEngineBrain.ts",
          "operation": "modify",
          "description": "Refactor intent-specific branching into registry-driven logic so new intents/slots can be added by updating the registry and slot handlers, not by expanding scattered conditionals."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Update Secretary smoke test checklist to cover new free-text intent routing, slot-filling, category selection, and repair behavior while keeping existing tests valid.",
      "acceptanceCriteria": [
        "`frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md` includes manual steps for: (1) triggering each intent by free-text, (2) slot-filling geography via typeahead, (3) selecting a complaint category suggestion, and (4) changing a slot mid-flow (repair) without full reset.",
        "All previously listed smoke tests remain valid and pass without new console errors."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/SMOKE_TEST_SECRETARY_FLOWS.md",
          "operation": "modify",
          "description": "Add new manual smoke tests for (a) free-text intent triggers for report_issue/find_instance/create_instance/ask_category, (b) stepwise slot filling with typeahead, (c) category suggestion selection + Something else custom category, and (d) mid-flow repair (e.g., changing state clears county/place only). Ensure existing test sections remain accurate."
        }
      ]
    }
  ]
}