{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Caffeine draft preview blank-screen mitigation (early script blocker + bundle dependency stripping)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a temporary, early-executing blocker that prevents Caffeine draft preview injected editor scripts from loading/executing so the React app mounts.",
      "acceptanceCriteria": [
        "The blocker is implemented without modifying any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
        "The blocker runs before the application bundle executes (i.e., it is loaded before the main module script).",
        "When opening a draft preview URL (e.g., https://just-olive-eim-draft.caffeine.xyz), the browser console no longer shows the draft-editor “disallowed origin” error originating from injected draft scripts, and the app renders instead of a blank white page.",
        "The blocker is scoped as “temporary” and is gated to only activate on Caffeine draft preview hostnames/conditions (so it does not interfere with normal deployments)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/caffeine-draft-preview-blocker.js",
          "operation": "create",
          "description": "Create a TEMPORARY, self-contained, early-load script that (only on Caffeine draft preview hostnames/conditions) blocks the injected draft editor script(s) from loading/executing by intercepting script insertion (e.g., document.createElement/appendChild, DOM mutations) and refusing URLs/identifiers matching known draft editor patterns (e.g., draft-script.js, draft-editor). Ensure it fails open (does nothing) on non-draft hosts and logs minimal diagnostics for verification."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Load the temporary blocker before the main module script so it executes prior to /src/main.tsx. Add a standard script tag referencing frontend/public/caffeine-draft-preview-blocker.js ahead of the existing module script. Keep changes minimal and do not alter the React entry path."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the suspected editor-triggering dependency chain from the frontend bundle so Caffeine preview no longer decides to inject the draft editor subsystem.",
      "acceptanceCriteria": [
        "Frontend build succeeds after removing the suspected editor-related dependency chain (including any direct imports and transitive inclusions that can trigger editor/script injection heuristics).",
        "No editor-related packages/imports/runtime references remain in the built frontend output (e.g., no references indicative of draft editor tooling in the compiled JS).",
        "Draft preview loads and renders the app without requiring the temporary blocker to catch/neutralize injected draft editor scripts (blocker may remain in place, but should not be the only thing preventing a crash)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Audit and remove any editor/draft-preview markers or injected-tooling hooks that could be present in the base HTML (e.g., extra script tags, data-* attributes, meta tags, or inline bootstraps that can trigger draft editor heuristics). Keep only what is required to mount the app (root containers + main module script + the temporary blocker from REQ-1)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit the top-level app module and its lazy imports for any suspected editor/draft tooling imports or transitive inclusions; remove/replace the dependency chain so no draft/editor-related code is reachable from the runtime bundle. Do not change the homepage mission statement strings or the “PERMANENT HERO TEXT – DO NOT CHANGE IN FUTURE BUILDS” comment."
        },
        {
          "path": "frontend/src/components/common/AppErrorBoundary.tsx",
          "operation": "modify",
          "description": "Harden the error boundary logging/handling to aid verification during draft preview testing (capture and surface relevant script/load/runtime errors without exposing new user-facing copy changes), ensuring the app provides actionable diagnostics if any residual editor-triggered failures occur."
        }
      ]
    }
  ]
}