{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend revert to Draft 38 state",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore the frontend UI/behavior to match Draft 38 exactly, removing any post–Draft 38 changes.",
      "acceptanceCriteria": [
        "The generated code in this draft matches Draft 38 behavior and UI as previously deployed/reviewed.",
        "No post–Draft 38 changes remain in the frontend or backend after the revert.",
        "The app builds successfully (frontend + backend) after reverting to Draft 38."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Revert the main application UI composition back to Draft 38, removing any post–Draft 38 sections/flows and restoring Draft 38 layout, interactions, and Secretary/navigation wiring. Ensure the hero uses the Draft 38 static asset at frontend/public/assets/generated/whisper-hero-provided.dim_1600x900.png (no remote URL dependency), with Draft 38 overlay styling (dark blue oklch(0.20 0.08 230) at 30% opacity) and Draft 38 CTA/button styles. Use existing shadcn-ui components already in the codebase (e.g., Card/Button/Input/Textarea) as per Draft 38 composition; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/common/HomeHeader.tsx",
          "operation": "modify",
          "description": "Revert the fixed header (branding + primary CTA) to the exact Draft 38 structure, copy, and styling, ensuring it matches Draft 38 behavior when interacting with the App’s 'Get Started' flow. If this file is listed as read-only in SYSTEM_CONTEXT, do not edit it; instead, achieve Draft 38 parity by adjusting composition/props usage in frontend/src/App.tsx."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Restore global theme tokens, utility classes, and any Draft 38-specific styling (including overlay root behavior and hero/widget contrast rules) to match Draft 38. Do not modify any read-only frontend paths listed in SYSTEM_CONTEXT; if this file is read-only, revert styling by adjusting Tailwind config usage and/or component class usage in composing files instead."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Revert Tailwind theme extensions (colors, shadows, animations, typography) back to the Draft 38 configuration so the UI renders identically to Draft 38. Do not modify any read-only frontend paths listed in SYSTEM_CONTEXT; if this file is read-only, achieve Draft 38 parity by reverting class usage in composing components instead."
        },
        {
          "path": "frontend/public/assets/generated/whisper-hero-provided.dim_1600x900.png",
          "operation": "create",
          "description": "Ensure the Draft 38 hero image asset exists at this exact path so the homepage hero can load it as a static asset without remote dependencies. If the asset already exists, replace it with the Draft 38 version and remove any post–Draft 38 asset substitutions in the UI wiring."
        }
      ]
    }
  ]
}