{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Log contribution rewards from issue-flow actions and refresh contribution summary",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Trigger backend contribution-event logging after successful issue creation, comment creation, and evidence upload with stable referenceIds.",
      "acceptanceCriteria": [
        "Creating an issue results in exactly one new contribution log entry for the caller.",
        "Creating a comment results in exactly one new contribution log entry for the caller.",
        "Uploading evidence results in exactly one new contribution log entry for the caller.",
        "If the same frontend action is retried (e.g., user double-clicks, network retry, refresh), the backend dedupe prevents multiple awards, and the frontend handles the duplicate response without breaking the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/contributionActionTypes.ts",
          "operation": "create",
          "description": "Create a single canonical, exported set of issue-flow contribution actionType string constants for frontend usage (issue creation, comment creation, evidence upload) to stay consistent with backend. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useContributionEventLogger.ts",
          "operation": "create",
          "description": "Add a small React hook/wrapper around actor.logContributionEvent that accepts (actionType, referenceId?, details?) and handles: actor availability, idempotent duplicate responses (do not break UI), and shared error normalization. This hook will be used by the three issue-flow actions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useCreateInstanceProposal.ts",
          "operation": "modify",
          "description": "After a successful submitProposal (issue creation), call the new contribution event logger with actionType for issue creation and a stable referenceId (the created instanceName), only after the action succeeds. Ensure any duplicate/guardrail error from the logging call is handled gracefully without failing the primary success flow. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useIssueProjectTasks.ts",
          "operation": "modify",
          "description": "After successful creation of the user-generated item that represents the app's \"comment creation\" in the current issue-flow UI (currently: createTask returns newTaskId), call the contribution event logger with the comment actionType and a stable referenceId (e.g., the returned newTaskId serialized). Ensure duplicate/guardrail errors do not break the UI flow. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "If this screen contains the current app's \"evidence upload\" action (e.g., a blob/image upload that completes successfully), wire the contribution event logger call after the upload/save succeeds using a stable referenceId (e.g., returned blob identifier or other stable upload identifier). Ensure retries/double-clicks do not break the UI if the backend reports a duplicate award. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Invalidate/refetch the caller contribution summary React Query cache after new contribution events so totals update.",
      "acceptanceCriteria": [
        "After any of the three actions, the caller contribution summary query (useCallerContributionSummary) is invalidated/refetched so subsequent renders show updated totals.",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT (compose existing hooks/components instead)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useContributionEventLogger.ts",
          "operation": "modify",
          "description": "On successful logContributionEvent completion (and on tolerated duplicate responses if applicable), invalidate/refetch the React Query cache for useCallerContributionSummary (query key prefix 'callerContributionSummary') so any totals shown across the app update. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useCallerContributionSummary.ts",
          "operation": "modify",
          "description": "Ensure the query key remains stable/predictable for invalidation (keep the existing 'callerContributionSummary' key prefix) and document the intended invalidation behavior in code comments to support the new event logging flow. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useCreateInstanceProposal.ts",
          "operation": "modify",
          "description": "Ensure the post-success contribution logging flow triggers contribution summary invalidation via the shared logger hook (no direct cache logic duplicated here beyond composing the shared hook). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}