{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Refine header branding/auth CTA and Secretary discovery results",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update header branding colors so wordmark and nav labels are white by default and teal on hover/active while keeping the existing teal logo SVG unchanged.",
      "acceptanceCriteria": [
        "The header continues to use the existing asset at frontend/public/whisper-logo-teal.svg with no color modifications to the SVG.",
        "The “Whisper” text next to the logo renders white in the header.",
        "Desktop nav menu labels (e.g., Geography, Admin when present) render white by default.",
        "On hover, focused, or active route, nav menu labels render in teal (consistent with the app’s existing teal accent token).",
        "Mobile menu items match the same white default / teal hover-active behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/common/HomeHeader.tsx",
          "operation": "modify",
          "description": "Adjust header styling classes to render the “Whisper” wordmark and all nav labels in white by default, with teal styling on hover/focus and for the active route; keep using frontend/public/whisper-logo-teal.svg as-is without modifying the SVG; ensure the same color behavior applies in the mobile Sheet menu. Use composed shadcn-ui primitives already in use (e.g., Button, Sheet) and verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useCurrentPath.ts",
          "operation": "create",
          "description": "Add a small hook to track the current route (listening to popstate) so HomeHeader can reliably apply an active/selected style to matching nav items (desktop + mobile) without editing any files in frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Change the header “Get Started” CTA so unauthenticated users start Internet Identity login (with disabled/loading state during login).",
      "acceptanceCriteria": [
        "When not authenticated, clicking “Get Started” initiates the Internet Identity login flow.",
        "When not authenticated, clicking “Get Started” does not scroll to the “get-started” section and does not navigate to create-instance, proposals, or open the Secretary widget.",
        "If login is already in progress, the CTA is disabled (or otherwise prevents duplicate login attempts) and shows an appropriate loading state consistent with existing auth UI copy."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/common/HomeHeader.tsx",
          "operation": "modify",
          "description": "Update the unauthenticated header CTA so the “Get Started” button calls useInternetIdentity().login(), is disabled when loginStatus is 'logging-in', and shows the existing uiCopy.auth.loggingIn label; remove/disable the previous scroll-to-section behavior for this CTA when unauthenticated. Use composed shadcn-ui Button and verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "When authenticated, replace the “Get Started” CTA with a profile control (avatar + label) that opens a submenu with Profile and Logout actions (including clearing React Query cache).",
      "acceptanceCriteria": [
        "After successful authentication, the “Get Started” CTA is no longer shown in the header.",
        "A profile control is shown instead, including an avatar image when available; if no image is available, a deterministic fallback (e.g., initials or generic icon) is shown.",
        "Opening the profile control shows a submenu that includes “Profile” and “Logout”.",
        "Clicking “Profile” navigates to the existing profile page route and closes the submenu.",
        "Clicking “Logout” logs out (clears identity) and clears React Query cache, matching existing logout behavior.",
        "Mobile header/menu provides equivalent authenticated profile access and logout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/common/UserProfileMenu.tsx",
          "operation": "create",
          "description": "Create a reusable authenticated header control that uses the existing useGetCallerUserProfile hook for display name and optional profileImage, renders an Avatar with deterministic fallback (e.g., initials), and provides a dropdown submenu with “Profile” (navigates to /profile) and “Logout” (calls clear() and queryClient.clear()). Compose existing shadcn-ui components (e.g., DropdownMenu, Avatar, Button) rather than editing files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/common/HomeHeader.tsx",
          "operation": "modify",
          "description": "Wire UserProfileMenu into the header for authenticated users (desktop and mobile), replacing the “Get Started” CTA when authenticated; ensure mobile Sheet shows equivalent Profile + Logout access and that selecting actions closes the mobile menu where appropriate. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Refine the Secretary lookup/discovery flow to show an explicit result step with clear messaging and explicit next-action buttons, removing any auto-navigation timeouts.",
      "acceptanceCriteria": [
        "When an existing instance is detected, the Secretary shows a result state with an explicit action button to navigate to the relevant destination; it does not auto-navigate after a delay.",
        "When no instance is detected, the Secretary shows the “founding citizen” result message and an explicit action button to proceed to instance proposal creation; it does not auto-navigate after a delay.",
        "The Secretary remains open on the result step until the user chooses an action or closes the widget.",
        "The refined flow continues to support both county and city selection and continues to use the existing geography data sources and typeahead UI.",
        "All user-facing text in the refined flow is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/secretary/SecretaryWidget.tsx",
          "operation": "modify",
          "description": "Replace the current discovery auto-navigation timeouts with an explicit 'result' step state that persists until user action: (1) if an existing instance is detected, show a clear found message plus a button such as “View existing instance” that navigates via the existing secretary navigation registry; (2) if not found, show the appropriate founding-citizen message plus a button such as “Create an instance proposal” that navigates to the create-instance destination. Keep the widget open on the result step and do not auto-close unless the user chooses an action or closes the widget. Retain existing county/city selection and typeahead behavior (SecretaryLocationTypeahead) and existing geography/proposals data sources. Use composed shadcn-ui components (Card/Button/etc.) already imported and verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/uiCopy.ts",
          "operation": "modify",
          "description": "Add/adjust English UI copy strings needed for the refined discovery result step (e.g., explicit result titles/messages and action button labels for found/not-found outcomes), ensuring all newly user-facing text is in English."
        }
      ]
    }
  ]
}