{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Step 6: Contribution Points summary on Profile (state-sourced, teal styling, instant updates)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a prominent, teal-accented Contribution Points total summary element to the Profile page that matches existing Profile card styling.",
      "acceptanceCriteria": [
        "On the Profile page, there is a dedicated UI element for Contribution Points that includes a prominently displayed total.",
        "The styling matches the existing Profile cards/components and includes a teal accent (e.g., icon/heading/border) consistent with current design tokens/components."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Refine the existing Contribution Points section to include a more prominent total summary area (teal-accented) within the existing shadcn-ui Card layout; keep styling consistent with current Profile cards and use teal tokens (e.g., accent/secondary). Use shadcn-ui Card components and existing IconBubble variant(s) to provide the teal accent. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure Contribution Points total is rendered strictly from existing client-side state/React Query cache already used by the Profile page, without introducing new backend calls.",
      "acceptanceCriteria": [
        "No new backend methods, canister calls, or new React Query fetch hooks are introduced solely to support the Contribution Points display.",
        "The Profile page continues to use the existing in-app state (e.g., the existing contribution summary state already present on the page) to render the total."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Compute and display the Contribution Points total using the existing useCallerContributionSummary hook data already loaded by the Profile page; avoid adding any new data-fetching hooks or backend calls for the display."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a short English helper hint near the Contribution Points total and show an explicit English fallback message when total points is zero.",
      "acceptanceCriteria": [
        "The Contribution Points UI includes a short helper hint in English (may reuse existing copy if appropriate).",
        "If the user’s total contribution points is 0, the UI shows an explicit English fallback message (e.g., “No contribution points yet”) instead of only showing a bare 0, or in addition to the 0 (as long as it is clearly a fallback state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/uiCopy.ts",
          "operation": "modify",
          "description": "Add/extend Profile-related English copy to support an explicit zero-points fallback message (e.g., a new uiCopy.profile.contributionPointsZeroFallback string) while keeping existing helper text intact."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Render the short English helper hint near/under the total (reusing uiCopy.profile.contributionPointsHelper) and conditionally show the explicit English zero-points fallback message when the cached/state total is 0."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update the Profile page’s displayed Contribution Points total immediately after an earned-points toast event by updating existing client-side React Query cache (no backend refetch required for UI freshness).",
      "acceptanceCriteria": [
        "After a contribution is logged and the earned-points toast is shown, the Contribution Points total displayed on the Profile page updates immediately (same session) to reflect the newly awarded points.",
        "This immediate update is driven by updating existing client-side state/React Query cache (e.g., via queryClient.setQueryData) rather than waiting for a backend refetch triggered solely for UI freshness."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useContributionEventLogger.ts",
          "operation": "modify",
          "description": "On successful contribution logging (non-duplicate), immediately update the existing React Query cache for the caller contribution summary (e.g., via queryClient.setQueriesData for keys starting with ['callerContributionSummary']) by incrementing totals based on the points awarded and reward type; avoid relying on a refetch for immediate UI correctness."
        },
        {
          "path": "frontend/src/lib/earnedPointsToast.ts",
          "operation": "modify",
          "description": "Adjust cached total reading to work with the existing identity-scoped contribution summary query keys (e.g., by reading the first matching query from the React Query cache for keys starting with ['callerContributionSummary']) so the toast can reflect updated cached totals without triggering backend reads."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Ensure the Contribution Points UI renders from the React Query cached contribution summary so that cache updates applied after contribution logging (and toast display) are reflected immediately on the Profile page without additional wiring."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Verify and adjust the Contribution Points summary element for mobile responsiveness (readability, spacing, no overflow) on small screens.",
      "acceptanceCriteria": [
        "On narrow/mobile widths, the Contribution Points element remains readable and properly spaced (no clipped text, overlapping elements, or horizontal scrolling).",
        "The layout adapts appropriately (e.g., stacking or responsive grid behavior) while staying consistent with the Profile page design."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Adjust the Contribution Points card’s internal layout to be responsive on small screens (e.g., ensure the prominent total area and any supporting breakdown/hint stack gracefully, maintain consistent spacing, and avoid overflow). Use existing Tailwind responsive utilities consistent with current Profile styling."
        }
      ]
    }
  ]
}