{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add issueDescription textarea to issue creation flow",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add an `issueDescription` multi-line textarea to the issue creation form and include it in review + submission payload.",
      "acceptanceCriteria": [
        "The issue creation form displays a clearly labeled textarea for `issueDescription` (English user-facing label).",
        "The textarea supports multi-line input (Enter inserts a new line and does not accidentally submit the form).",
        "The `issueDescription` value is included in the form’s internal state and is preserved while the user continues the issue creation flow.",
        "If the form has a review/confirmation step, the entered `issueDescription` is displayed in that summary.",
        "Submitting the issue creation form includes the `issueDescription` value in the submission payload used by the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/secretary/SecretaryWidget.tsx",
          "operation": "modify",
          "description": "Update the issue creation flow UI to render a clearly labeled `issueDescription` textarea (multi-line) during the issue-details step (e.g., the guided report details step), while keeping single-line input for other steps. Use the shadcn-ui Textarea component (already used elsewhere in the app) to support multi-line input; Verify the component's usage instructions before implementing. Ensure Enter inserts a newline in the textarea (do not intercept Enter-to-send in this mode), preserve the textarea value across navigation within the flow by syncing with the brain/context draft state, and keep the existing review/confirmation summary showing the captured description."
        },
        {
          "path": "frontend/src/secretary/flow/runner.ts",
          "operation": "modify",
          "description": "Ensure the issue creation submission action (e.g., guided confirmation submit) includes the captured `issueDescription` value from the current draft/state in the submission payload used by the app (without adding new backend capabilities). Keep behavior changes scoped to the issue creation flow only."
        }
      ]
    }
  ]
}