{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Whisper civic platform with an existing “Secretary” chat popup that should remain normal-sized (not full screen). Planned: automatic slot-filling and multi-step conversational flows for issue reporting with geography-aware suggestions (city/county/state), cross-referencing a locations database and a “50 most common issues” database, plus auto-creation of missing Whisper instances using a naming convention (e.g., WhisperOmaha-NE). Also planned: adding a WSP (Whisper Coin) token on ICP via a separate ICRC-1 ledger canister and integrating read-only balance display, with later phases for minting/rewards, staking, and governance.",
  "architectural_notes": [
    "Secretary refers to the existing chat popup UI; it should not become full-screen.",
    "Slot-filling and multi-step flows should trigger automatically for all user messages (not only via button/keyword).",
    "Geography handling should use fuzzy matching against a city/county/state database, then ask whether the issue is city/county/state.",
    "If a referenced city/county/state instance does not exist, prompt founding-member flow and auto-create required instances using naming like \"WhisperOmaha-NE\".",
    "WSP token must be deployed as a separate ICRC-1 ledger canister (not embedded in the main Whisper canister); Whisper stores the ledger canister ID for integration."
  ],
  "known_issues": [
    "Caffeine/AI build execution intermittently fails or returns 'couldn't implement' during token/flow implementation attempts; may require smaller, more specific build steps."
  ],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-enable-the-secretary-s-intent-slot-filling-mode-to-automatically-pre-fill-slots-from-a-single-user-message-at-minimum-geography-slots-and-for-the-report-issue-intent-the-initial-issue-description-and-then-ask-only-for-the-remaining-missing-required-slots",
      "title": "Enable the Secretary’s intent/slot-filling mode to automatically pre-fill slots from a single user message (at minimum: geography slots and, for the report-issue intent, the initial issue description) and then ask only for the remaining missing required slots.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-wire-complaint-category-suggestions-into-slot-filling-when-the-next-missing-slot-is-issue-category-fetch-and-present-category-suggestions-based-on-the-currently-filled-geography-level-and-the-current-issue-description-slot-and-allow-the-user-to-choose-a-suggestion-to-fill-the-category-slot",
      "title": "Wire complaint category suggestions into slot-filling: when the next missing slot is issue_category, fetch and present category suggestions based on the currently filled geography level and the current issue_description slot, and allow the user to choose a suggestion to fill the category slot.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-fix-secretary-location-typeahead-selection-so-it-works-for-any-active-geography-slot-state-county-or-place-and-correctly-advances-slot-filling-after-selection",
      "title": "Fix Secretary location typeahead selection so it works for any active geography slot (state, county, or place) and correctly advances slot-filling after selection.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-slot-filling-completion-behavior-is-user-visible-and-consistent-after-all-required-slots-for-an-intent-are-filled-the-secretary-executes-the-existing-completion-navigation-for-that-intent-and-then-resets-back-to-the-main-menu-with-an-english-confirmation-message",
      "title": "Ensure slot-filling completion behavior is user-visible and consistent: after all required slots for an intent are filled, the Secretary executes the existing completion navigation for that intent and then resets back to the main menu with an English confirmation message.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Implement automatic slot-filling in the existing Secretary chat popup to gather missing details from user messages",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Implement multi-step conversational flows in the Secretary (issue reporting, instance creation, category routing, guidance, etc.)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Keep the Secretary chat popup in normal sizing (not full screen)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Add geography-aware autosuggest and clarification (city/county/state) using a location database; cross-reference existing instances and allow founding-member auto-creation of missing instances",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Integrate a '50 most common issues' database to suggest categories during reporting flows",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Create WSP (Whisper Coin) on ICP as a dedicated ICRC-1 ledger canister and integrate Whisper to read/display balances (later phases: minting rewards, staking, governance/SNS)",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Whisper",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}