{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Investigate and mitigate blank white screen in Caffeine preview caused by injected draft editor script (disallowed origin) by stripping suspected dependency chain and adding a temporary in-site blocker to prevent preview system injection.",
  "architectural_notes": [
    "Caffeine preview may auto-inject an editor subsystem (draft-script.js) based on bundle detection, which can fail with a 'disallowed origin' error and prevent the app from mounting."
  ],
  "known_issues": [
    "Preview can render a blank white screen when injected draft editor script throws 'disallowed origin' for the preview URL (e.g., https://just-olive-eim-draft.caffeine.xyz)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-add-a-temporary-early-executing-in-site-blocker-that-prevents-the-caffeine-preview-system-s-injected-draft-editor-script-from-loading-executing-e-g-draft-script-js-draft-editor-so-the-preview-no-longer-crashes-with-the-disallowed-origin-error-and-the-react-app-can-mount",
      "title": "Add a temporary, early-executing in-site blocker that prevents the Caffeine preview system’s injected draft editor script from loading/executing (e.g., draft-script.js / draft-editor), so the preview no longer crashes with the “disallowed origin” error and the React app can mount.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-strip-the-suspected-editor-triggering-dependency-chain-from-the-frontend-bundle-so-the-preview-system-stops-deciding-to-inject-the-draft-editor-subsystem-in-the-first-place",
      "title": "Strip the suspected editor-triggering dependency chain from the frontend bundle so the preview system stops deciding to inject the draft editor subsystem in the first place.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Strip suspected editor-triggering dependency chain from the bundle to stop Caffeine preview from injecting draft-script.js (disallowed origin) and causing blank screen",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add a temporary in-site script/workaround to block the problematic dependency chain / prevent preview system injection of the editor script",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "projectName": "Mitigate Caffeine preview blank screen by blocking injected draft editor script and stripping editor-triggering dependency chain",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}