{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-12T01:27:47.861Z",
  "summary": "A shared Sonner-based earned-points toast helper was added and some flows were updated to use it after successful contribution logging with a centralized lock and optional total-points-from-cache line. However, the toast text does not correctly use the awarded points value, and chat-origin usage is not evidenced.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Toast displays the earned points in the form “+<number> contribution points earned” (using the actual points earned).",
      "reason": "The shared helper hard-codes point amounts in the toast title (+10/+5/+20 and a fallback +10) instead of using the provided pointsAwarded value.",
      "evidence": [
        "frontend/src/lib/earnedPointsToast.ts"
      ]
    },
    {
      "id": "REQ-4",
      "requirement": "Action-type-specific toast messages for ISSUE_CREATED, COMMENT_CREATED, and EVIDENCE_ADDED that still reflect the actual earned points.",
      "reason": "While action-type-specific branches exist, the toast title hard-codes points per action type rather than using the earned points from the API result.",
      "evidence": [
        "frontend/src/lib/earnedPointsToast.ts"
      ]
    },
    {
      "id": "REQ-5",
      "requirement": "Ensure chat-origin toasts use Secretary-friendly phrasing variants (origin/context flag used from Secretary chat flows).",
      "reason": "The helper supports origin='chat' and contains chat-specific copy, but the diff does not show any call site in Secretary chat flows invoking showEarnedPointsToast with origin: 'chat' (SecretaryWidget is truncated and shows only the import).",
      "evidence": [
        "frontend/src/lib/earnedPointsToast.ts",
        "frontend/src/components/secretary/SecretaryWidget.tsx"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Changed/added SecretaryWidgetPortal behavior (portal mounting, overlay-root creation, and adapting findByKeyword return type).",
      "reason": "Not requested by the BuildRequest (scope was earned-points toast behavior after logging contribution events).",
      "evidence": [
        "frontend/src/components/secretary/SecretaryWidgetPortal.tsx"
      ]
    },
    {
      "description": "Earned-points toast lock logs to console when skipping duplicates.",
      "reason": "BuildRequest required a lock but did not request console logging as part of the feature; this is additional behavior.",
      "evidence": [
        "frontend/src/lib/earnedPointsToast.ts"
      ]
    }
  ],
  "confidence": 0.74,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/src/components/create-instance/CreateInstancePlaceholderCard.tsx",
    "frontend/src/components/issue-project/IssueProjectTasksTab.tsx",
    "frontend/src/components/secretary/SecretaryWidget.tsx",
    "frontend/src/components/secretary/SecretaryWidgetPortal.tsx",
    "frontend/src/lib/earnedPointsToast.ts",
    "frontend/src/pages/ProfilePage.tsx",
    "project_state.json"
  ]
}